
&Вместо("ПолучитьКомплектующиеНоменклатуры")
Функция алсав_ПолучитьКомплектующиеНоменклатуры(ВариантКомплектации, Упаковка, Количество)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(ВариантКомплектации, Упаковка, Количество);
	//Возврат Результат;
	
	Возврат АЛСАВ_Сборка.ПолучитьКомплектующиеНоменклатуры(ВариантКомплектации, Упаковка, Количество );
КонецФункции


Функция алсав_ЗагрузитьИзСметыВТабличныйДокумент(Адрес, исходныйФайл) экспорт
	// Вставить содержимое обработчика.
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Адрес);
	тПуть = ПолучитьИмяВременногоФайла();
	
	ф = Новый Файл(исходныйФайл);
	тПуть = тПуть + "."+ф.Имя;	
	ДвоичныеДанные.Записать(тПуть);	
	таблДок = Новый ТабличныйДокумент;
	таблДок.Прочитать(тПуть);
	
	УдалитьФайлы(тПуть);
	
	Возврат таблДок;
КонецФункции


Функция алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес, исходныйФайл) экспорт
	// Вставить содержимое обработчика.
	таблДок = алсав_ЗагрузитьИзСметыВТабличныйДокумент(Адрес, исходныйФайл);
	Если ЛОЖЬ Тогда таблДок = Новый ТабличныйДокумент; КонецЕсли;
	
	началоТаблицы = 1;	
	Для номерСтроки = 1 по таблДок.ВысотаТаблицы Цикл
		Если "Артикул"=(таблДок.Область(номерСтроки,1,номерСтроки,1).Текст) Тогда
			началоТаблицы = номерСтроки+1; 
			BREAK;	
		КонецЕсли;
	КонецЦикла;
	номерСтроки = началоТаблицы;
	
	результ = Новый Массив;
	
	Пока 1 =1 Цикл
		артикул = СокрЛП(таблДок.Область(номерСтроки,1,номерСтроки,1).Текст);
		наименование = СокрЛП(таблДок.Область(номерСтроки,3,номерСтроки,2).Текст);
		количество = СокрЛП(таблДок.Область(номерСтроки,3,номерСтроки,3).Текст);
		едИзм = СокрЛП(таблДок.Область(номерСтроки,4,номерСтроки,4).Текст);
		номерСтроки = номерСтроки+1;
		
		результ.Добавить(Новый Структура(
			"НомерСтроки, Артикул, НаименованиеМатериала, РасчетноеКоличество, ЕдИзм",
			номерСтроки,
			артикул,
			наименование,
			количество,
			едИзм
		));
		
		Если НЕ ЗначениеЗаполнено(таблДок.Область(номерСтроки,2,номерСтроки,2).Текст) Тогда
			BREAK;
		КонецЕсли;
	КонецЦикла;
	
	Возврат результ;
КонецФункции


//Функция ОбновитьСоставИзделия(вариантКомплектации) экспорт
//	
//	Если ЛОЖЬ Тогда
//		вариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
//	КонецЕсли;
//	
//	Если НЕ вариантКомплектации.Основной Тогда
//		Возврат неопределено;
//	КонецЕсли;
//	
//	Если вариантКомплектации.ЭтоГруппа Тогда
//		Возврат неопределено;
//	КонецЕсли;
//	
//	состав = АЛСАВ_Сборка.ПолучитьКомплектующиеНоменклатуры(вариантКомплектации);
//	
//	ПродуктНоменклатура = вариантКомплектации.Владелец;
//	ПродуктХарактеристика = вариантКомплектации.Характеристика;
//	
//	нз = РегистрыСведений.алсав_СоставИзделий.СоздатьНаборЗаписей();
//	нз.Отбор.ПродуктНоменклатура.Установить(ПродуктНоменклатура);
//	нз.Отбор.ПродуктХарактеристика.Установить(ПродуктХарактеристика);
//	
//	Для Каждого стр из состав Цикл
//		запись = нз.Добавить();
//		ЗаполнитьЗначенияСвойств(запись,стр);
//		запись.Количество = стр.Количество;
//			
//		запись.ПродуктНоменклатура = ПродуктНоменклатура;
//		запись.ПродуктХарактеристика = ПродуктХарактеристика;
//		
//	КонецЦикла;
//	
//	нз.Записать(ИСТИНА);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	               |ГДЕ
//	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА
//	               |	И ВариантыКомплектацииНоменклатурыТовары.Номенклатура = &Номенклатура
//	               |	И ВариантыКомплектацииНоменклатурыТовары.Характеристика = &Характеристика";
//	
//	ЗАпрос.УстановитьПараметр("Номенклатура",ПродуктНоменклатура);
//	ЗАпрос.УстановитьПараметр("Характеристика",ПродуктХарактеристика);
//	
//	рез = Запрос.Выполнить().Выбрать();
//	Пока Рез.Следующий() Цикл
//		ОбновитьСоставИзделия(рез.ССылка);
//	КонецЦикла;
//КонецФункции