
&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	

	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаСервере
Процедура алсав_ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		СтрокаТЧТовары.КоличествоФакт = СтрокаТЧТовары.Количество;
		СтрокаТЧТовары.Количество = 0;
		СтрокаТЧТовары.КоличествоУпаковокФакт = СтрокаТЧТовары.КоличествоУпаковок;
		СтрокаТЧТовары.КоличествоУпаковок = 0;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура алсав_ПолучитьЗагруженныеТоварыИзХранилища_ФормаЗагрузкаФактическогоКоличеств(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		Попытка
			СтрокаТЧТовары = Объект.Товары[Число(СтрокаТоваров.НомерСтроки)-1];
			факт = 0 ;
			Попытка
				факт = Число(СтрокаТоваров.КоличествоФакт);
			Исключение;
			КонецПопытки;
			
			СтрокаТЧТовары.КоличествоФакт = факт;
			СтрокаТЧТовары.КоличествоУпаковокФакт = факт;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура алсав_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
	Если  ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		алсав_ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	ИначеЕсли  ИсточникВыбора.ИмяФормы = "Документ.ПересчетТоваров.Форма.алсав_ФормаЗагрузкаФактическогоКоличества" Тогда
		алсав_ПолучитьЗагруженныеТоварыИзХранилища_ФормаЗагрузкаФактическогоКоличеств(ВыбранноеЗначение.АдресТоваровВХранилище);	
		
		Для Каждого стр из Объект.Товары Цикл
			Элементы.Товары.ТекущаяСтрока = стр.ПолучитьИдентификатор();
			ТоварыКоличествоУпаковокФактПриИзменении(Элементы.Товары);
		КонецЦикла;
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура алсав_ЗагрузитьФактическоеКоличествоПосле(Команда)
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ПересчетТоваров", Объект.Ссылка);
	
	ОткрытьФорму(
		"Документ.ПересчетТоваров.Форма.алсав_ФормаЗагрузкаФактическогоКоличества",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	

КонецПроцедуры

