
&Перед("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.                            
	
	массивВариантовОбоеспечения = Новый Массив;
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);	
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.Требуется);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого стр из Заказы Цикл         
			Для Каждого стрЗаказа из стр.Заказ.Товары Цикл
				Если НЕ стрЗаказа.Отменено и массивВариантовОбоеспечения.Найти(стрЗаказа.ВариантОбеспечения) <> неопределено Тогда
					//Отказ = истина;
					//Сообщить("В заказе " + стр.Заказ + ", не корректный вариант обеспечения, позиция :"+стрЗаказа.НомерСтроки+" ")
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
