
Функция ПолучитьУзелОбменаБ24()
	ПланыОбмена.алсавб24_ПланОбменаБ24CRM.НайтиПоКоду("Б24_01");
КонецФункции

Процедура ВыполнитьОбменДанными() ЭКСПОРТ 
	//получить текущий номер отправки для узла палана обмена
	
	
	//получить изменения
	
	
	//исходя из типа объекта зарегестрированного к обмену пытаемся найти связанный с этим объектом элемент справочника контрагент
	
	
	//цикл выгрузки контрагентов в Б24 (если у контрагента нету согласшений в статусе действующий тогда пропускаем данного контрагента
	
	
	//Если выгрузка прошла успешна тогда увеличиваем номер отправки у узла палана обмена
КонецПроцедуры