
&НаСервере
Процедура СформироватьОтчетНаСервере()
	// Вставить содержимое обработчика.
	ЭтотОбъект.Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПереработчика";
	ЭтотОбъект.Результат.Очистить();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.УБ_ОтчетПереработчика.Макет");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НачДата=Формат(НачалоДня(ЭтотОбъект.Период.ДатаНачала),"ДЛФ=DD");
	ОбластьМакета.Параметры.КонДата= Формат(КонецДня(ЭтотОбъект.Период.ДатаОкончания),"ДЛФ=DD");
	ЭтотОбъект.Результат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
	ЭтотОбъект.Результат.Вывести(ОбластьМакета);
	ЭтотОбъект.Результат.НачатьАвтогруппировкуСтрок();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.Характеристика КАК Характеристика,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.ГотоваяПродукция КАК ГотоваяПродукция,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.ХарактеристикаГП КАК ХарактеристикаГП,
		|	СУММА(УБ_МатериалыВПереработкеОстаткиИОбороты.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
		|	СУММА(УБ_МатериалыВПереработкеОстаткиИОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(УБ_МатериалыВПереработкеОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(УБ_МатериалыВПереработкеОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.УБ_МатериалыВПереработке.ОстаткиИОбороты(
		|			&Начпериода,
		|			&КонПериода,
		|			Авто,
		|			,
		|			ФирмаПродавец = &ВыбПродавец
		|				И ФирмаПроизводитель = &Производитель) КАК УБ_МатериалыВПереработкеОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.Характеристика,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.ХарактеристикаГП,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.ГотоваяПродукция,
		|	УБ_МатериалыВПереработкеОстаткиИОбороты.Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоНачальныйОстаток),
		|	СУММА(КоличествоПриход),
		|	СУММА(КоличествоРасход),
		|	СУММА(КоличествоКонечныйОстаток)
		|ПО
		|	Номенклатура,
		|	Характеристика,
		|	ГотоваяПродукция,
		|	ХарактеристикаГП";
	
	Запрос.УстановитьПараметр("ВыбПродавец", ЭтотОбъект.Давалец);
	Запрос.УстановитьПараметр("КонПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Начпериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Производитель", ЭтотОбъект.Переработчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Н=0;
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
	
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаХарактеристика.Следующий() Цикл
			// Вставить обработку выборки ВыборкаХарактеристика
			
			Н=Н+1;
			ОбластьМакета = Макет.ПолучитьОбласть("Строка1");
			//ОбластьМакета.Параметры.НачДата=Формат(НачалоДня(ЭтотОбъект.Период.ДатаНачала),"ДЛФ=DD");
			//ОбластьМакета.Параметры.КонДата= Формат(КонецДня(ЭтотОбъект.Период.ДатаОкончания),"ДЛФ=DD");
			ОбластьМакета.Параметры.ПечНом=Н;
			ОбластьМакета.Параметры.Печматериал=""+ВыборкаНоменклатура.Номенклатура+" "+ВыборкаХарактеристика.Характеристика;
			ОбластьМакета.Параметры.ПечЕдиница=ВыборкаНоменклатура.Номенклатура.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ПечНачОст=ВыборкаХарактеристика.КоличествоНачальныйОстаток;
			ОбластьМакета.Параметры.ПечПриход=ВыборкаХарактеристика.КоличествоПриход;
			ОбластьМакета.Параметры.ПечРасход=ВыборкаХарактеристика.КоличествоРасход;
			ОбластьМакета.Параметры.ПечВозврат="";
			ОбластьМакета.Параметры.ПечКонОст=ВыборкаХарактеристика.КоличествоКонечныйОстаток;
			ОбластьМакета.Параметры.ПечГП="";
			ЭтотОбъект.Результат.Вывести(ОбластьМакета,1);
			ВыборкаГотоваяПродукция = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ЭтотОбъект.флПодробно Тогда				
				к=0;
				Пока ВыборкаГотоваяПродукция.Следующий() Цикл
					// Вставить обработку выборки ВыборкаГотоваяПродукция
		
					ВыборкаХарактеристикаГП = ВыборкаГотоваяПродукция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
					Пока ВыборкаХарактеристикаГП.Следующий() Цикл
						к=к+1;
						// Вставить обработку выборки ВыборкаХарактеристикаГП
						ОбластьМакета = Макет.ПолучитьОбласть("Строка2");
						ОбластьМакета.Параметры.ПечНом=""+Н+"."+к;
						ОбластьМакета.Параметры.Печматериал=""+ВыборкаНоменклатура.Номенклатура+" "+ВыборкаХарактеристика.Характеристика;
						ОбластьМакета.Параметры.ПечЕдиница=ВыборкаНоменклатура.Номенклатура.ЕдиницаИзмерения;
						ОбластьМакета.Параметры.ПечНачОст="";//ВыборкаХарактеристика.КоличествоНачальныйОстаток;
						ОбластьМакета.Параметры.ПечПриход="";//ВыборкаХарактеристика.КоличествоПриход;
						ОбластьМакета.Параметры.ПечРасход=ВыборкаХарактеристикаГП.КоличествоРасход;
						ОбластьМакета.Параметры.ПечВозврат="";
						ОбластьМакета.Параметры.ПечКонОст="";//ВыборкаХарактеристика.КоличествоКонечныйОстаток;
						ОбластьМакета.Параметры.ПечГП=""+ВыборкаГотоваяПродукция.ГотоваяПродукция+" "+ВыборкаХарактеристикаГП.ХарактеристикаГП;
						ЭтотОбъект.Результат.Вывести(ОбластьМакета,2);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	ЭтотОбъект.Результат.ЗакончитьАвтогруппировкуСтрок();

	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
	ЭтотОбъект.Результат.Вывести(ОбластьМакета);
	ЭтотОбъект.Результат.НачатьАвтогруппировкуСтрок();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УБ_ПоступлениеГПОбороты.Номенклатура КАК Номенклатура,
		|	УБ_ПоступлениеГПОбороты.Характеристика КАК Характеристика,
		|	СУММА(УБ_ПоступлениеГПОбороты.КоличествоОборот) КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.УБ_ПоступлениеГП.Обороты(
		|			&Начпериода,
		|			&КонПериода,
		|			Авто,
		|			ФирмаПродавец = &ВыбПродавец
		|				И ФирмаПроизводитель = &Производитель) КАК УБ_ПоступлениеГПОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УБ_ПоступлениеГПОбороты.Характеристика,
		|	УБ_ПоступлениеГПОбороты.Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоОборот)
		|ПО
		|	Номенклатура,
		|	Характеристика";
	
	Запрос.УстановитьПараметр("ВыбПродавец", ЭтотОбъект.Давалец);
	Запрос.УстановитьПараметр("КонПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Начпериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Производитель", ЭтотОбъект.Переработчик);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Н=0;
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
	
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Н=Н+1;
		Пока ВыборкаХарактеристика.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка3");
			ОбластьМакета.Параметры.ПечНом=""+Н;
			ОбластьМакета.Параметры.ПечГП=""+ВыборкаНоменклатура.Номенклатура+" "+ВыборкаХарактеристика.Характеристика;
			ОбластьМакета.Параметры.ПечЕдиница=ВыборкаНоменклатура.Номенклатура.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ПечКол=ВыборкаХарактеристика.КоличествоОборот;
			ЭтотОбъект.Результат.Вывести(ОбластьМакета,1);

		КонецЦикла;
	КонецЦикла;
	ЭтотОбъект.Результат.ЗакончитьАвтогруппировкуСтрок();	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ЭтотОбъект.Результат.Вывести(ОбластьМакета);
	



КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
