
&Вместо("ОбработкаЗаполнения")
Процедура алсав_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое метода.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ЗаполнитьНаОснованииПеремещения(ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры



Функция ЗаполнитьНаОснованииПеремещения(вхСсылка)
	Если 1=2 Тогда вхСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка() КонецЕсли;
	Для Каждого стр из вхСсылка.Товары Цикл
		нСтр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр,стр);
		Склад = вхСсылка.СкладПолучатель;
		Организация = вхСсылка.Организация;
		Подразделение = вхСсылка.Подразделение;  
		Комментарий = "На основании : "+вхСсылка;
		//ДокументОснование = вхСсылка;
	КонецЦикла;
КонецФункции

