
&Вместо("ЗаполнитьПравилаКонвертацииПредопределенныхДанных")
Процедура алсав_ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации)
	Если НаправлениеОбмена = "Отправка" Тогда
		// ВидыКИ_Отправка.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыКИ_Отправка";
		ПравилоКонвертации.ТипДанных = Метаданные.Справочники.ВидыКонтактнойИнформации;
		ПравилоКонвертации.ТипXDTO   = "ВидыКИ";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EmailПартнера, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EmailПользователя, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица, "АдресЭлектроннойПочты");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица, "ПочтовыйАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица, "ФактическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресНалоговогоОргана, "ЮридическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресПартнера, "ЮридическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица, "ЮридическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.АдресСклада, "ФактическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.МеждународныйАдресКонтрагента, "ПочтовыйАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.МеждународныйАдресОрганизации, "ПочтовыйАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента, "ПочтовыйАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации, "ПочтовыйАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица, "ТелефонДомашний");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонНалоговогоОргана, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, "ТелефонРабочий");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонСклада, "Телефон");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты, "Факс");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации, "Факс");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, "ФактическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, "ФактическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, "ЮридическийАдрес");
		ЗначенияДляОтправки.Вставить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "ЮридическийАдрес");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// ВидыОпераций_ПТиУ.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОпераций_ПТиУ";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийПоступленияТоваров";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту, "ЗакупкаПоИмпорту");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика, "ПокупкаУПоставщика");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет, "ПокупкаУПоставщика");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию, "ПриемНаКомиссию");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// ВидыОперацийВыпускаПродукции.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийВыпускаПродукции";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийВыпускаПродукции";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииВПодразделение, "ВыпускПродукцииВПодразделение");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад, "ВыпускПродукцииНаСклад");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой, "ВыпускПродукцииНаСклад");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства, "ВыпускПродукцииНаСклад");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию, "ВыпускПродукцииНаСклад");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// ВидыОперацийРеализацияТоваров_Отправка.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийРеализацияТоваров_Отправка";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийРеализацияТоваровУслуг";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию, "ПередачаНаКомиссию");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту, "РеализацияКлиенту");
		ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет, "РеализацияКлиенту");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// ВидыЭД_Реализация_Отправка.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыЭД_Реализация_Отправка";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОформленияПродажи;
		ПравилоКонвертации.ТипXDTO   = "ВидыЭД";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОформленияПродажи.АктВыполненныхРабот, "АктНаПередачуПрав");
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав, "АктНаПередачуПрав");
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг, "ТОРГ12");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ВариантОтраженияРасхождений_Излишки.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВариантОтраженияРасхождений_Излишки";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОтраженияРасхождений;
		ПравилоКонвертации.ТипXDTO   = "ВариантыОтраженияИзлишковПриПоступлении";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиВПользуПоставщика, "ВПользуПоставщика");
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиНаПрочиеДоходы, "НаПрочиеДоходы");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ВариантОтраженияРасхождений_Недостачи.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВариантОтраженияРасхождений_Недостачи";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОтраженияРасхождений;
		ПравилоКонвертации.ТипXDTO   = "ВариантыОтраженияНедостачиПриПоступлении";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетПоставщика, "ЗаСчетПоставщика");
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетСтороннейКомпании, "ЗаСчетСтороннейКомпании");
		ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОтраженияРасхождений.НедостачиНаПрочиеРасходы, "НаПрочиеРасходы");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ТипыДоговоров_Отправка.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТипыДоговоров_Отправка";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыДоговоров;
		ПравилоКонвертации.ТипXDTO   = "ВидыДоговоров";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.ВвозИзЕАЭС, "СПоставщиком");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.Импорт, "СПоставщиком");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СДавальцем, "СПокупателем");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СКомиссионером, "СКомиссионером");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СКомитентом, "СКомитентом");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СПереработчиком, "СПоставщиком");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СПоклажедателем, "СПоставщиком");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СПокупателем, "СПокупателем");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СПоставщиком, "СПоставщиком");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоров.СХранителем, "СПокупателем");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ТипыЗапасов.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТипыЗапасов";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыЗапасов;
		ПравилоКонвертации.ТипXDTO   = "ТипыЗапасов";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыЗапасов.КомиссионныйТовар, "КомиссионныеТовары");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыЗапасов.МатериалДавальца, "ДавальческиеСырьеИМатериалы");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыЗапасов.Товар, "СобственныеТовары");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// ТипыСкладов_Отправка.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ТипыСкладов_Отправка";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыСкладов;
		ПравилоКонвертации.ТипXDTO   = "ТипыСкладов";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыСкладов.ОптовыйСклад, "Оптовый");
		ЗначенияДляОтправки.Вставить(Перечисления.ТипыСкладов.РозничныйМагазин, "Розничный");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	КонецЕсли;
	Если НаправлениеОбмена = "Получение" Тогда
		// ВидыОпераций_ПТиУ_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОпераций_ПТиУ_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийПоступленияТоваров";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("ЗакупкаПоИмпорту", Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		ЗначенияДляПолучения.Вставить("ПокупкаУПоставщика", Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		ЗначенияДляПолучения.Вставить("ПриемНаКомиссию", Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ВидыОперацийВыпускаПродукции_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийВыпускаПродукции_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийВыпускаПродукции";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("ВыпускПродукцииВПодразделение", Перечисления.ХозяйственныеОперации.ВыпускПродукцииВПодразделение);
		ЗначенияДляПолучения.Вставить("ВыпускПродукцииНаСклад", Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ВидыОперацийРеализацияТоваров_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийРеализацияТоваров_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийРеализацияТоваровУслуг";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("ПередачаНаКомиссию", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		ЗначенияДляПолучения.Вставить("ОтгрузкаБезПереходаПравСобственности_ВПути", Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
		ЗначенияДляПолучения.Вставить("ОтгрузкаБезПереходаПравСобственности_Реализовано", Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
		ЗначенияДляПолучения.Вставить("РеализацияКлиенту", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ВидыОперацийСБДСПрочее_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийСБДСПрочее_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыОперацийСБДСПрочее";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("ВнутренняяПередача", Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
		ЗначенияДляПолучения.Вставить("ПрочееСписание", Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ВидыЭД_Реализация_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ВидыЭД_Реализация_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОформленияПродажи;
		ПравилоКонвертации.ТипXDTO   = "ВидыЭД";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("АктНаПередачуПрав", Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав);
		ЗначенияДляПолучения.Вставить("ТОРГ12", Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// Перечисление_ТипыДоговоров_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТипыДоговоров_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыДоговоров;
		ПравилоКонвертации.ТипXDTO   = "ВидыДоговоров";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("СКомиссионером", Перечисления.ТипыДоговоров.СКомиссионером);
		ЗначенияДляПолучения.Вставить("СКомиссионеромНаЗакупку", Перечисления.ТипыДоговоров.СКомиссионером);
		ЗначенияДляПолучения.Вставить("СКомитентом", Перечисления.ТипыДоговоров.СКомитентом);
		ЗначенияДляПолучения.Вставить("СКомитентомНаЗакупку", Перечисления.ТипыДоговоров.СКомитентом);
		ЗначенияДляПолучения.Вставить("СПокупателем", Перечисления.ТипыДоговоров.СПокупателем);
		ЗначенияДляПолучения.Вставить("Прочее", Перечисления.ТипыДоговоров.СПоставщиком);
		ЗначенияДляПолучения.Вставить("СПоставщиком", Перечисления.ТипыДоговоров.СПоставщиком);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// Перечисление_ЮрФизЛицо_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ЮрФизЛицо_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ЮрФизЛицо;
		ПравилоКонвертации.ТипXDTO   = "ЮридическоеФизическоеЛицо";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("ФизическоеЛицо", Перечисления.ЮрФизЛицо.ФизЛицо);
		ЗначенияДляПолучения.Вставить("ЮридическоеЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ТипыСкладов_Получение.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ТипыСкладов_Получение";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыСкладов;
		ПравилоКонвертации.ТипXDTO   = "ТипыСкладов";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("Оптовый", Перечисления.ТипыСкладов.ОптовыйСклад);
		ЗначенияДляПолучения.Вставить("НеавтоматизированнаяТорговаяТочка", Перечисления.ТипыСкладов.РозничныйМагазин);
		ЗначенияДляПолучения.Вставить("Розничный", Перечисления.ТипыСкладов.РозничныйМагазин);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ХозОперации_ПБДСРасчетыСКонтрагентами.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ХозОперации_ПБДСРасчетыСКонтрагентами";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыРасчетовСКонтрагентами";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("СПоставщиком", Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
		ЗначенияДляПолучения.Вставить("СПокупателем", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
		ЗначенияДляПолучения.Вставить("КредитыИЗаймы", Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств);
		ЗначенияДляПолучения.Вставить("Прочее", Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	
		// ХозОперации_ПБДСРасчетыССотрудниками.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ХозОперации_ПБДСРасчетыССотрудниками";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
		ПравилоКонвертации.ТипXDTO   = "ВидыРасчетовССотрудниками";
	
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("Подотчет", Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника);
		ЗначенияДляПолучения.Вставить("Займы", Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;
	КонецЕсли;

	// ВидДеятельностиРаздельногоУчетаНДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидДеятельностиРаздельногоУчетаНДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыНалогообложенияНДС;
	ПравилоКонвертации.ТипXDTO   = "ВидДеятельностиРаздельногоУчетаНДС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию, "ПоФактическомуИспользованию");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ОпределяетсяРаспределением, "ОпределяетсяРаспределением");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию, "ПоФактическомуИспользованию");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "НеОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД, "ОблагаетсяЕНВД");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "ОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров, "ЭкспортНеСырьевыхТоваров");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг, "ЭкспортСырьевыхТоваров");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ПоФактическомуИспользованию", Перечисления.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию);
	ЗначенияДляПолучения.Вставить("ОпределяетсяРаспределением", Перечисления.ТипыНалогообложенияНДС.ОпределяетсяРаспределением);
	ЗначенияДляПолучения.Вставить("ПоФактическомуИспользованию", Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию);
	ЗначенияДляПолучения.Вставить("НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ОблагаетсяЕНВД", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД);
	ЗначенияДляПолучения.Вставить("ОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ЭкспортНеСырьевыхТоваров", Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров);
	ЗначенияДляПолучения.Вставить("ЭкспортСырьевыхТоваров", Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ВидыОперацийВозвратОтПокупателя.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийВозвратОтПокупателя";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
	ПравилоКонвертации.ТипXDTO   = "ВидыОперацийВозвратОтПокупателя";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера, "ВозвратОтКомиссионера");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя, "ВозвратОтРозничногоПокупателя");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента, "ВозвратОтКлиента");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ВозвратОтКомиссионера", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
	ЗначенияДляПолучения.Вставить("ВозвратОтРозничногоПокупателя", Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
	ЗначенияДляПолучения.Вставить("ВозвратОтКлиента", Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ВидыОперацийВозвратПоставщику.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийВозвратПоставщику";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
	ПравилоКонвертации.ТипXDTO   = "ВидыОперацийВозвратПоставщику";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратТоваровКомитенту, "ВозвратКомитенту");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику, "ВозвратПоставщику");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ВозвратКомитенту", Перечисления.ХозяйственныеОперации.ВозвратТоваровКомитенту);
	ЗначенияДляПолучения.Вставить("ВозвратПоставщику", Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ВидыОперацийРКОНаБанковскийСчет.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидыОперацийРКОНаБанковскийСчет";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
	ПравилоКонвертации.ТипXDTO   = "ВидыОперацийРКОНаБанковскийСчет";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк, "Инкассация");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк, "ВзносНаличными");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Инкассация", Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк);
	ЗначенияДляПолучения.Вставить("ВзносНаличными", Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ВидыОтветственныхЛиц.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидыОтветственныхЛиц";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ОтветственныеЛицаОрганизаций;
	ПравилоКонвертации.ТипXDTO   = "ВидыОтветственныхЛиц";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, "ГлавныйБухгалтер");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель, "Исполнитель");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.Кассир, "Кассир");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБухгалтерскиеРегистры, "ОтветственныйЗаБухгалтерскиеРегистры");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаНалоговыеРегистры, "ОтветственныйЗаНалоговыеРегистры");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, "Руководитель");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы, "РуководительКадровойСлужбы");
	ЗначенияДляОтправки.Вставить(Перечисления.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель, "УполномоченныйПредставитель");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	ЗначенияДляПолучения.Вставить("Исполнитель", Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель);
	ЗначенияДляПолучения.Вставить("Кассир", Перечисления.ОтветственныеЛицаОрганизаций.Кассир);
	ЗначенияДляПолучения.Вставить("ОтветственныйЗаБухгалтерскиеРегистры", Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБухгалтерскиеРегистры);
	ЗначенияДляПолучения.Вставить("ОтветственныйЗаНалоговыеРегистры", Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаНалоговыеРегистры);
	ЗначенияДляПолучения.Вставить("Руководитель", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ЗначенияДляПолучения.Вставить("РуководительКадровойСлужбы", Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы);
	ЗначенияДляПолучения.Вставить("УполномоченныйПредставитель", Перечисления.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ВидыПродукцииИС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ВидыПродукцииИС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ОсобенностиУчетаНоменклатуры;
	ПравилоКонвертации.ТипXDTO   = "ВидыПродукцииИС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция, "Алкогольная");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Велосипеды, "Велосипеды");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Духи, "Духи");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.КреслаКоляски, "КреслаКоляски");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность, "ЛегкаяПромышленность");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС, "МолочнаяПродукция");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция, "Обувь");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция, "Табак");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Фотоаппараты, "Фотоаппараты");
	ЗначенияДляОтправки.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Шины, "Шины");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Алкогольная", Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция);
	ЗначенияДляПолучения.Вставить("Велосипеды", Перечисления.ОсобенностиУчетаНоменклатуры.Велосипеды);
	ЗначенияДляПолучения.Вставить("Духи", Перечисления.ОсобенностиУчетаНоменклатуры.Духи);
	ЗначенияДляПолучения.Вставить("КреслаКоляски", Перечисления.ОсобенностиУчетаНоменклатуры.КреслаКоляски);
	ЗначенияДляПолучения.Вставить("ЛегкаяПромышленность", Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность);
	ЗначенияДляПолучения.Вставить("МолочнаяПродукция", Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС);
	ЗначенияДляПолучения.Вставить("Обувь", Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция);
	ЗначенияДляПолучения.Вставить("Табак", Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция);
	ЗначенияДляПолучения.Вставить("Фотоаппараты", Перечисления.ОсобенностиУчетаНоменклатуры.Фотоаппараты);
	ЗначенияДляПолучения.Вставить("Шины", Перечисления.ОсобенностиУчетаНоменклатуры.Шины);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// КомпанияЧастноеЛицо_ЮридическоеФизическоеЛицо.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "КомпанияЧастноеЛицо_ЮридическоеФизическоеЛицо";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.КомпанияЧастноеЛицо;
	ПравилоКонвертации.ТипXDTO   = "ЮридическоеФизическоеЛицо";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.КомпанияЧастноеЛицо.Компания, "ЮридическоеЛицо");
	ЗначенияДляОтправки.Вставить(Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо, "ФизическоеЛицо");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ЮридическоеЛицо", Перечисления.КомпанияЧастноеЛицо.Компания);
	ЗначенияДляПолучения.Вставить("ФизическоеЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// НалогообложениеНДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "НалогообложениеНДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыНалогообложенияНДС;
	ПравилоКонвертации.ТипXDTO   = "НалогообложениеНДС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя, "ОблагаетсяНДСУПокупателя");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт, "ПродажаНаЭкспорт");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "ПродажаНеОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД, "ПродажаОблагаетсяЕНВД");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "ПродажаОблагаетсяНДС");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ОблагаетсяНДСУПокупателя", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя);
	ЗначенияДляПолучения.Вставить("ПродажаНаЭкспорт", Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт);
	ЗначенияДляПолучения.Вставить("ПродажаНеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ПродажаОблагаетсяЕНВД", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД);
	ЗначенияДляПолучения.Вставить("ПродажаОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// НалогообложениеНДСПродавца.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "НалогообложениеНДСПродавца";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыНалогообложенияНДС;
	ПравилоКонвертации.ТипXDTO   = "НалогообложениеНДСПродавца";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС, "НалоговыйАгентПоНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя, "НДСИсчисляетсяПокупателем");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "НеОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД, "ОблагаетсяЕНВД");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "ОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ЭлектронныеУслуги, "ЭлектронныеУслуги");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("НалоговыйАгентПоНДС", Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС);
	ЗначенияДляПолучения.Вставить("НДСИсчисляетсяПокупателем", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя);
	ЗначенияДляПолучения.Вставить("НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ОблагаетсяЕНВД", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД);
	ЗначенияДляПолучения.Вставить("ОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ЭлектронныеУслуги", Перечисления.ТипыНалогообложенияНДС.ЭлектронныеУслуги);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ВариантыОплатыКлиентом.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВариантыОплатыКлиентом";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОплатыКлиентом;
	ПравилоКонвертации.ТипXDTO   = "ВариантыОплаты";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения, "Аванс");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки, "Кредит");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыКлиентом.КредитСдвиг, "ОтсрочкаПлатежа");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки, "Предоплата");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Аванс", Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения);
	ЗначенияДляПолучения.Вставить("Кредит", Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки);
	ЗначенияДляПолучения.Вставить("ОтсрочкаПлатежа", Перечисления.ВариантыОплатыКлиентом.КредитСдвиг);
	ЗначенияДляПолучения.Вставить("Предоплата", Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ВариантыОплатыПоставщику.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВариантыОплатыПоставщику";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВариантыОплатыПоставщику;
	ПравилоКонвертации.ТипXDTO   = "ВариантыОплаты";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения, "Аванс");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления, "Кредит");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыПоставщику.КредитСдвиг, "ОтсрочкаПлатежа");
	ЗначенияДляОтправки.Вставить(Перечисления.ВариантыОплатыПоставщику.ПредоплатаДоПоступления, "Предоплата");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Аванс", Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения);
	ЗначенияДляПолучения.Вставить("Кредит", Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления);
	ЗначенияДляПолучения.Вставить("ОтсрочкаПлатежа", Перечисления.ВариантыОплатыПоставщику.КредитСдвиг);
	ЗначенияДляПолучения.Вставить("Предоплата", Перечисления.ВариантыОплатыПоставщику.ПредоплатаДоПоступления);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ВидыЛицензийАлкогольнойПродукции.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ВидыЛицензийАлкогольнойПродукции";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВидыЛицензийАлкогольнойПродукции;
	ПравилоКонвертации.ТипXDTO   = "ВидыЛицензийАлкогольнойПродукции";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция, "АлкогольнаяПродукция");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыЛицензийАлкогольнойПродукции.Пиво, "Пиво");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяНеПищеваяПродукция, "СпиртосодержащаяНеПищеваяПродукция");
	ЗначенияДляОтправки.Вставить(Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяПищеваяПродукция, "СпиртосодержащаяПищеваяПродукция");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("АлкогольнаяПродукция", Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция);
	ЗначенияДляПолучения.Вставить("Пиво", Перечисления.ВидыЛицензийАлкогольнойПродукции.Пиво);
	ЗначенияДляПолучения.Вставить("СпиртосодержащаяНеПищеваяПродукция", Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяНеПищеваяПродукция);
	ЗначенияДляПолучения.Вставить("СпиртосодержащаяПищеваяПродукция", Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяПищеваяПродукция);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_СпособыРасчетаКомиссионногоВознагражд.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_СпособыРасчетаКомиссионногоВознагражд";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СпособыРасчетаКомиссионногоВознаграждения;
	ПравилоКонвертации.ТипXDTO   = "СпособыРасчетаКомиссионногоВознаграждения";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается, "НеРассчитывается");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтРазностиСуммыПродажиИСуммыКомитента, "ПроцентОтРазницыСуммПродажиИПоступления");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи, "ПроцентОтСуммыПродажи");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("НеРассчитывается", Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается);
	ЗначенияДляПолучения.Вставить("ПроцентОтРазницыСуммПродажиИПоступления", Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтРазностиСуммыПродажиИСуммыКомитента);
	ЗначенияДляПолучения.Вставить("ПроцентОтСуммыПродажи", Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_СтавкиНДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_СтавкиНДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СтавкиНДС;
	ПравилоКонвертации.ТипXDTO   = "СтавкиНДС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.БезНДС, "БезНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС0, "НДС0");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС10, "НДС10");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС10_110, "НДС10_110");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС18, "НДС18");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС18_118, "НДС18_118");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС20, "НДС20");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС20_120, "НДС20_120");
	
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС5, "НДС5");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС5_105, "НДС5_105");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС7, "НДС7");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС7_107, "НДС7_107");
	
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("БезНДС", Перечисления.СтавкиНДС.БезНДС);
	ЗначенияДляПолучения.Вставить("НДС0", Перечисления.СтавкиНДС.НДС0);
	ЗначенияДляПолучения.Вставить("НДС10", Перечисления.СтавкиНДС.НДС10);
	ЗначенияДляПолучения.Вставить("НДС10_110", Перечисления.СтавкиНДС.НДС10_110);
	ЗначенияДляПолучения.Вставить("НДС18", Перечисления.СтавкиНДС.НДС18);
	ЗначенияДляПолучения.Вставить("НДС18_118", Перечисления.СтавкиНДС.НДС18_118);
	ЗначенияДляПолучения.Вставить("НДС20", Перечисления.СтавкиНДС.НДС20);
	ЗначенияДляПолучения.Вставить("НДС20_120", Перечисления.СтавкиНДС.НДС20_120);
	
	ЗначенияДляПолучения.Вставить("НДС5", Перечисления.СтавкиНДС.НДС5);
	ЗначенияДляПолучения.Вставить("НДС5_105", Перечисления.СтавкиНДС.НДС5_105);
	ЗначенияДляПолучения.Вставить("НДС7", Перечисления.СтавкиНДС.НДС7);
	ЗначенияДляПолучения.Вставить("НДС7_107", Перечисления.СтавкиНДС.НДС7_107);
	
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ТипыНоменклатуры.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТипыНоменклатуры";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыНоменклатуры;
	ПравилоКонвертации.ТипXDTO   = "ТипыНоменклатуры";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара, "МногооборотнаяТара");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНоменклатуры.Работа, "Работа");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНоменклатуры.Товар, "Товар");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНоменклатуры.Услуга, "Услуга");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("МногооборотнаяТара", Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ЗначенияДляПолучения.Вставить("Работа", Перечисления.ТипыНоменклатуры.Работа);
	ЗначенияДляПолучения.Вставить("Товар", Перечисления.ТипыНоменклатуры.Товар);
	ЗначенияДляПолучения.Вставить("Услуга", Перечисления.ТипыНоменклатуры.Услуга);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ТипыПлатежныхДокументов.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТипыПлатежныхДокументов";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыПлатежныхДокументов;
	ПравилоКонвертации.ТипXDTO   = "ТипыПлатежныхДокументов";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.Аккредитив, "Аккредитив");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер, "БанковскийОрдер");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение, "ИнкассовоеПоручение");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение, "ПлатежноеПоручение");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование, "ПлатежноеТребование");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер, "ПлатежныйОрдер");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Аккредитив", Перечисления.ТипыПлатежныхДокументов.Аккредитив);
	ЗначенияДляПолучения.Вставить("БанковскийОрдер", Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер);
	ЗначенияДляПолучения.Вставить("ИнкассовоеПоручение", Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение);
	ЗначенияДляПолучения.Вставить("ПлатежноеПоручение", Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ЗначенияДляПолучения.Вставить("ПлатежноеТребование", Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование);
	ЗначенияДляПолучения.Вставить("ПлатежныйОрдер", Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ХозОперацииЧерезПлатежнуюСистему.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ХозОперацииЧерезПлатежнуюСистему";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
	ПравилоКонвертации.ТипXDTO   = "ВидыОперацийПоПлатежнойКарте";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту, "ВозвратОтКлиентаЧерезПлатежнуюСистему");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента, "ОплатаОтКлиентаЧерезПлатежнуюСистему");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ВозвратОтКлиентаЧерезПлатежнуюСистему", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	ЗначенияДляПолучения.Вставить("ОплатаОтКлиентаЧерезПлатежнуюСистему", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ЮридическоеФизическоеЛицо.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ЮридическоеФизическоеЛицо";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ЮридическоеФизическоеЛицо;
	ПравилоКонвертации.ТипXDTO   = "ЮридическоеФизическоеЛицо";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо, "ФизическоеЛицо");
	ЗначенияДляОтправки.Вставить(Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, "ЮридическоеЛицо");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ФизическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ЗначенияДляПолучения.Вставить("ЮридическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисления_ТипыНалогообложенияНДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисления_ТипыНалогообложенияНДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыНалогообложенияНДС;
	ПравилоКонвертации.ТипXDTO   = "Налогообложение";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС, "НалоговыйАгентПоНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию, "ПоФактическомуИспользованию");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт, "ПродажаНаЭкспорт");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "ПродажаНеОблагаетсяНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД, "ПродажаОблагаетсяЕНВД");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "ПродажаОблагаетсяНДС");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("НалоговыйАгентПоНДС", Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС);
	ЗначенияДляПолучения.Вставить("ПоФактическомуИспользованию", Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию);
	ЗначенияДляПолучения.Вставить("ПродажаНаЭкспорт", Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт);
	ЗначенияДляПолучения.Вставить("ПродажаНеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	ЗначенияДляПолучения.Вставить("ПродажаОблагаетсяЕНВД", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД);
	ЗначенияДляПолучения.Вставить("ПродажаОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ПолФизическогоЛица.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ПолФизическогоЛица";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ПолФизическогоЛица;
	ПравилоКонвертации.ТипXDTO   = "Пол";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ПолФизическогоЛица.Женский, "Женский");
	ЗначенияДляОтправки.Вставить(Перечисления.ПолФизическогоЛица.Мужской, "Мужской");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Женский", Перечисления.ПолФизическогоЛица.Женский);
	ЗначенияДляПолучения.Вставить("Мужской", Перечисления.ПолФизическогоЛица.Мужской);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// СпособыДоставки.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "СпособыДоставки";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СпособыДоставки;
	ПравилоКонвертации.ТипXDTO   = "СпособыДоставки";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.ДоКлиента, "ДоКлиента");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки, "КПолучателюОпределяетСлужбаДоставки");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя, "НашимиСиламиСАдресаОтправителя");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки, "ОтОтправителяОпределяетСлужбаДоставки");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте, "ПоручениеЭкспедиторуВПункте");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад, "ПоручениеЭкспедиторуНаСклад");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада, "ПоручениеЭкспедиторуСоСклада");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.Самовывоз, "Самовывоз");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчика, "СиламиПеревозчика");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада, "СиламиПеревозчикаДоНашегоСклада");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи, "СиламиПеревозчикаДоПунктаПередачи");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу, "СиламиПеревозчикаПоАдресу");
	ЗначенияДляОтправки.Вставить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада, "СиламиПоставщикаДоНашегоСклада");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ДоКлиента", Перечисления.СпособыДоставки.ДоКлиента);
	ЗначенияДляПолучения.Вставить("КПолучателюОпределяетСлужбаДоставки", Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	ЗначенияДляПолучения.Вставить("НашимиСиламиСАдресаОтправителя", Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	ЗначенияДляПолучения.Вставить("ОтОтправителяОпределяетСлужбаДоставки", Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	ЗначенияДляПолучения.Вставить("ПоручениеЭкспедиторуВПункте", Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	ЗначенияДляПолучения.Вставить("ПоручениеЭкспедиторуНаСклад", Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад);
	ЗначенияДляПолучения.Вставить("ПоручениеЭкспедиторуСоСклада", Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
	ЗначенияДляПолучения.Вставить("Самовывоз", Перечисления.СпособыДоставки.Самовывоз);
	ЗначенияДляПолучения.Вставить("СиламиПеревозчика", Перечисления.СпособыДоставки.СиламиПеревозчика);
	ЗначенияДляПолучения.Вставить("СиламиПеревозчикаДоНашегоСклада", Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	ЗначенияДляПолучения.Вставить("СиламиПеревозчикаДоПунктаПередачи", Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	ЗначенияДляПолучения.Вставить("СиламиПеревозчикаПоАдресу", Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	ЗначенияДляПолучения.Вставить("СиламиПоставщикаДоНашегоСклада", Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// СтатусыЗаявокНаРасходДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "СтатусыЗаявокНаРасходДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств;
	ПравилоКонвертации.ТипXDTO   = "СтатусыЗаявокНаРасходДС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате, "КОплате");
	ЗначенияДляОтправки.Вставить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована, "НеСогласована");
	ЗначенияДляОтправки.Вставить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена, "Отклонена");
	ЗначенияДляОтправки.Вставить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована, "Согласована");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("КОплате", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	ЗначенияДляПолучения.Вставить("НеСогласована", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	ЗначенияДляПолучения.Вставить("Отклонена", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	ЗначенияДляПолучения.Вставить("Согласована", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыДоговоровМеждуОрганизациями.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыДоговоровМеждуОрганизациями";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыДоговоровМеждуОрганизациями;
	ПравилоКонвертации.ТипXDTO   = "ВидыДоговоров";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоровМеждуОрганизациями.Комиссионный, "СКомиссионером");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыДоговоровМеждуОрганизациями.КупляПродажа, "СПокупателем");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("СКомиссионером", Перечисления.ТипыДоговоровМеждуОрганизациями.Комиссионный);
	ЗначенияДляПолучения.Вставить("СПокупателем", Перечисления.ТипыДоговоровМеждуОрганизациями.КупляПродажа);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыРасчетовСПартнерами_ВидыРасчетовСКонтрагентами.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыРасчетовСПартнерами_ВидыРасчетовСКонтрагентами";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыРасчетовСПартнерами;
	ПравилоКонвертации.ТипXDTO   = "ВидыРасчетовСКонтрагентами";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, "СПокупателем");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком, "СПоставщиком");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("СПокупателем", Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ЗначенияДляПолучения.Вставить("СПоставщиком", Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыСостоянийОбменаЭД.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыСостоянийОбменаЭД";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СводныеСостоянияЭД;
	ПравилоКонвертации.ТипXDTO   = "ТипыСостоянийОбменаЭД";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СводныеСостоянияЭД.ВсеВыполнено, "ВсеВыполнено");
	ЗначенияДляОтправки.Вставить(Перечисления.СводныеСостоянияЭД.ДействийНеТребуется, "ДействийНеТребуется");
	ЗначенияДляОтправки.Вставить(Перечисления.СводныеСостоянияЭД.Отклонен, "Отклонен");
	ЗначенияДляОтправки.Вставить(Перечисления.СводныеСостоянияЭД.ТребуютсяДействия, "ТребуютсяДействия");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ВсеВыполнено", Перечисления.СводныеСостоянияЭД.ВсеВыполнено);
	ЗначенияДляПолучения.Вставить("ДействийНеТребуется", Перечисления.СводныеСостоянияЭД.ДействийНеТребуется);
	ЗначенияДляПолучения.Вставить("Отклонен", Перечисления.СводныеСостоянияЭД.Отклонен);
	ЗначенияДляПолучения.Вставить("ТребуютсяДействия", Перечисления.СводныеСостоянияЭД.ТребуютсяДействия);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыСостоянийЭлектронногоДокумента.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыСостоянийЭлектронногоДокумента";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СостоянияВерсийЭД;
	ПравилоКонвертации.ТипXDTO   = "ТипыСостоянийЭлектронногоДокумента";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.Аннулирован, "Аннулирован");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ЗакрытПринудительно, "ЗакрытПринудительно");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ИзвещениеНаПодписи, "ИзвещениеНаПодписи");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.НаПодписи, "НаПодписи");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.НаУтверждении, "НаУтверждении");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.НеПолучен, "НеПолучен");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.НеСформирован, "НеСформирован");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОбменЗавершен, "ОбменЗавершен");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением, "ОбменЗавершенСИсправлениями");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяАннулирование, "ОжидаетсяАннулирование");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяИзвещениеОПолучении, "ОжидаетсяИзвещениеОПолучении");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяИсправление, "ОжидаетсяИсправление");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправка, "ОжидаетсяОтправка");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаИзвещения, "ОжидаетсяОтправкаИзвещения");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаПолучателю, "ОжидаетсяОтправкаПолучателю");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяПередачаОператору, "ОжидаетсяПередачаОператору");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяПодтверждение, "ОжидаетсяПодтверждение");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОжидаетсяПодтверждениеОператора, "ОжидаетсяПодтверждениеОператора");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.Отклонен, "Отклонен");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ОшибкаПередачи, "ОшибкаПередачи");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ТребуетсяАннулировать, "ТребуетсяАннулировать");
	ЗначенияДляОтправки.Вставить(Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент, "ТребуетсяУточнитьДокумент");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Аннулирован", Перечисления.СостоянияВерсийЭД.Аннулирован);
	ЗначенияДляПолучения.Вставить("ЗакрытПринудительно", Перечисления.СостоянияВерсийЭД.ЗакрытПринудительно);
	ЗначенияДляПолучения.Вставить("ИзвещениеНаПодписи", Перечисления.СостоянияВерсийЭД.ИзвещениеНаПодписи);
	ЗначенияДляПолучения.Вставить("НаПодписи", Перечисления.СостоянияВерсийЭД.НаПодписи);
	ЗначенияДляПолучения.Вставить("НаУтверждении", Перечисления.СостоянияВерсийЭД.НаУтверждении);
	ЗначенияДляПолучения.Вставить("НеПолучен", Перечисления.СостоянияВерсийЭД.НеПолучен);
	ЗначенияДляПолучения.Вставить("НеСформирован", Перечисления.СостоянияВерсийЭД.НеСформирован);
	ЗначенияДляПолучения.Вставить("ОбменЗавершен", Перечисления.СостоянияВерсийЭД.ОбменЗавершен);
	ЗначенияДляПолучения.Вставить("ОбменЗавершенСИсправлениями", Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением);
	ЗначенияДляПолучения.Вставить("ОжидаетсяАннулирование", Перечисления.СостоянияВерсийЭД.ОжидаетсяАннулирование);
	ЗначенияДляПолучения.Вставить("ОжидаетсяИзвещениеОПолучении", Перечисления.СостоянияВерсийЭД.ОжидаетсяИзвещениеОПолучении);
	ЗначенияДляПолучения.Вставить("ОжидаетсяИсправление", Перечисления.СостоянияВерсийЭД.ОжидаетсяИсправление);
	ЗначенияДляПолучения.Вставить("ОжидаетсяОтправка", Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправка);
	ЗначенияДляПолучения.Вставить("ОжидаетсяОтправкаИзвещения", Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаИзвещения);
	ЗначенияДляПолучения.Вставить("ОжидаетсяОтправкаПолучателю", Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаПолучателю);
	ЗначенияДляПолучения.Вставить("ОжидаетсяПередачаОператору", Перечисления.СостоянияВерсийЭД.ОжидаетсяПередачаОператору);
	ЗначенияДляПолучения.Вставить("ОжидаетсяПодтверждение", Перечисления.СостоянияВерсийЭД.ОжидаетсяПодтверждение);
	ЗначенияДляПолучения.Вставить("ОжидаетсяПодтверждениеОператора", Перечисления.СостоянияВерсийЭД.ОжидаетсяПодтверждениеОператора);
	ЗначенияДляПолучения.Вставить("Отклонен", Перечисления.СостоянияВерсийЭД.Отклонен);
	ЗначенияДляПолучения.Вставить("ОшибкаПередачи", Перечисления.СостоянияВерсийЭД.ОшибкаПередачи);
	ЗначенияДляПолучения.Вставить("ТребуетсяАннулировать", Перечисления.СостоянияВерсийЭД.ТребуетсяАннулировать);
	ЗначенияДляПолучения.Вставить("ТребуетсяУточнитьДокумент", Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыУпаковок.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыУпаковок";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыУпаковок;
	ПравилоКонвертации.ТипXDTO   = "ТипыУпаковокНоменклатуры";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыУпаковок.МаркированныйТовар, "МаркированныйТовар");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыУпаковок.МонотоварнаяУпаковка, "МонотоварнаяУпаковка");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыУпаковок.МультитоварнаяУпаковка, "МультитоварнаяУпаковка");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("МаркированныйТовар", Перечисления.ТипыУпаковок.МаркированныйТовар);
	ЗначенияДляПолучения.Вставить("МонотоварнаяУпаковка", Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
	ЗначенияДляПолучения.Вставить("МультитоварнаяУпаковка", Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ТипыШтрихкодов.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ТипыШтрихкодов";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ТипыШтрихкодов;
	ПравилоКонвертации.ТипXDTO   = "ТипыШтрихкодов";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.Code128, "Code128");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.Code39, "Code39");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.EAN13, "EAN13");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.EAN8, "EAN8");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.GS1_128, "GS1_128");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.GS1_DataBarExpandedStacked, "GS1_DataBarExpandedStacked");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.ITF14, "ITF14");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.PDF417, "PDF417");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.QR, "QR");
	ЗначенияДляОтправки.Вставить(Перечисления.ТипыШтрихкодов.SSCC, "SSCC");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Code128", Перечисления.ТипыШтрихкодов.Code128);
	ЗначенияДляПолучения.Вставить("Code39", Перечисления.ТипыШтрихкодов.Code39);
	ЗначенияДляПолучения.Вставить("EAN13", Перечисления.ТипыШтрихкодов.EAN13);
	ЗначенияДляПолучения.Вставить("EAN8", Перечисления.ТипыШтрихкодов.EAN8);
	ЗначенияДляПолучения.Вставить("GS1_128", Перечисления.ТипыШтрихкодов.GS1_128);
	ЗначенияДляПолучения.Вставить("GS1_DataBarExpandedStacked", Перечисления.ТипыШтрихкодов.GS1_DataBarExpandedStacked);
	ЗначенияДляПолучения.Вставить("ITF14", Перечисления.ТипыШтрихкодов.ITF14);
	ЗначенияДляПолучения.Вставить("PDF417", Перечисления.ТипыШтрихкодов.PDF417);
	ЗначенияДляПолучения.Вставить("QR", Перечисления.ТипыШтрихкодов.QR);
	ЗначенияДляПолучения.Вставить("SSCC", Перечисления.ТипыШтрихкодов.SSCC);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ФормыОплаты.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ФормыОплаты";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ФормыОплаты;
	ПравилоКонвертации.ТипXDTO   = "ФормыОплаты";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ФормыОплаты.Безналичная, "Безналичная");
	ЗначенияДляОтправки.Вставить(Перечисления.ФормыОплаты.Наличная, "Наличная");
	ЗначенияДляОтправки.Вставить(Перечисления.ФормыОплаты.ПлатежнаяКарта, "ПлатежнаяКарта");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Безналичная", Перечисления.ФормыОплаты.Безналичная);
	ЗначенияДляПолучения.Вставить("Наличная", Перечисления.ФормыОплаты.Наличная);
	ЗначенияДляПолучения.Вставить("ПлатежнаяКарта", Перечисления.ФормыОплаты.ПлатежнаяКарта);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// ХозяйственныеОперацииВВидыОперацийПоПлатежнойКарте.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "ХозяйственныеОперацииВВидыОперацийПоПлатежнойКарте";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ХозяйственныеОперации;
	ПравилоКонвертации.ТипXDTO   = "ВидыОперацийПоПлатежнойКарте";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту, "ВозвратОплатыКлиентуНаПлатежнуюКарту");
	ЗначенияДляОтправки.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента, "ОплатаОтКлиентаПлатежнойКартой");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ВозвратОплатыКлиентуНаПлатежнуюКарту", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	ЗначенияДляПолучения.Вставить("ОплатаОтКлиентаПлатежнойКартой", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры

&Вместо("ОпределитьСтавкуНДС_Отправка")
Процедура алсав_ОпределитьСтавкуНДС_Отправка(ТабличнаяЧасть, НДСПоСтавкам2и4)
	ТабличнаяЧасть.Колонки.Добавить("СтавкаНДССтрокой");
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
			Строка.СтавкаНДССтрокой = "НДС0";
		ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			Строка.СтавкаНДССтрокой = "БезНДС";
		Иначе
			Если НДСПоСтавкам2и4 Тогда
				Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18
					ИЛИ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					Строка.СтавкаНДССтрокой = "НДС4";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
					ИЛИ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
					Строка.СтавкаНДССтрокой = "НДС4_104";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					Строка.СтавкаНДССтрокой = "НДС2";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
					Строка.СтавкаНДССтрокой = "НДС2_102";
				КонецЕсли;
			Иначе
				Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
					Строка.СтавкаНДССтрокой = "НДС18";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					Строка.СтавкаНДССтрокой = "НДС20";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
					Строка.СтавкаНДССтрокой = "НДС18_118";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
					Строка.СтавкаНДССтрокой = "НДС20_120";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					Строка.СтавкаНДССтрокой = "НДС10";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
					Строка.СтавкаНДССтрокой = "НДС10_110";
					
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
					Строка.СтавкаНДССтрокой = "НДС5";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105 Тогда
					Строка.СтавкаНДССтрокой = "НДС5_105";
					
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
					Строка.СтавкаНДССтрокой = "НДС7";
				ИначеЕсли Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107 Тогда
					Строка.СтавкаНДССтрокой = "НДС7_107";
					
					
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	ТабличнаяЧасть.Колонки.Удалить("СтавкаНДС");
	ТабличнаяЧасть.Колонки.СтавкаНДССтрокой.Имя = "СтавкаНДС";КонецПроцедуры
