
&НаКлиенте
Процедура алсав_ИзменитьВыделенныеПосле(Команда)
	МодульГрупповоеИзменениеОбъектовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ГрупповоеИзменениеОбъектовКлиент");
	МодульГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры



&НаКлиенте
Процедура алсав_ОтборПоСпискуАртикуловПосле(Команда)
	// Вставить содержимое обработчика.
	артикулы = "";
	оповещениеПослеВводаСпискаАртикулов = Новый ОписаниеОповещения("ПослеВводаСпискаАртикулов",ЭтаФорма,новый Структура());
	ПоказатьВводСтроки(оповещениеПослеВводаСпискаАртикулов,артикулы,"Отбор по списку артикулов",,Истина);
КонецПроцедуры

&НаКлиенте
Функция ПослеВводаСпискаАртикулов(стрАртикулы,параметры)экспорт
	Если стрАртикулы <> неопределено Тогда
		списокАртикулов = новый СписокЗначений();
		Если ЗначениеЗаполнено(стрАртикулы) Тогда
			Для Счетчик = 1 По СтрЧислоСтрок(стрАртикулы) Цикл
			    артикул = СтрПолучитьСтроку(стрАртикулы, Счетчик);
				списокАртикулов.Добавить(артикул);
			КонецЦикла;
		КонецЕсли;
		УстановитьОтборАртикулы(списокАртикулов);
	КонецЕсли;
КонецФункции


&НаКлиенте 
Функция УстановитьОтборАртикулы(списокАртикулов)
	Если ЛОЖЬ Тогда списокАртикулов = новый СписокЗначений() КонецЕсли;
	
	элементОтбораАртикул = неопределено;
	Для Каждого элОтбора из ЭтаФорма.Список.Отбор.Элементы Цикл
		Если Строка(элОтбора.ЛевоеЗначение) = "Владелец.Артикул" Тогда
			элементОтбораАртикул = элОтбора;
		КонецЕсли;
	КонецЦикла;
	Если элементОтбораАртикул = неопределено Тогда
		элементОтбораАртикул = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		элементОтбораАртикул.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец.Артикул");
	КонецЕсли;
	
	
	элементОтбораАртикул.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	элементОтбораАртикул.Использование = списокАртикулов.Количество() > 0;
	элементОтбораАртикул.ПравоеЗначение = списокАртикулов;
	
КонецФункции


&НаКлиенте
Процедура алсав_ФайлСметыНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru=’Выберите файл сметы (Excel)'"));
	НастройкиДиалога.Вставить("Фильтр", НСтр("*.xls"));
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(ЭтотОбъект, "ФайлСметы", СтандартнаяОбработка, НастройкиДиалога);    
КонецПроцедуры


&НаКлиенте
Процедура алсав_ФайлМоделиНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru=’Выберите файл модели)'"));
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(ЭтотОбъект, "ФайлМодели", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ГенерацияАртикуловДляВсехПосле(Команда)   
	Сообщить("+++++++++");
	Сообщить(ТекущаяДата());
	алсав_алсав_ГенерацияАртикуловДляВсехПослеНаСервере();
	Сообщить(ТекущаяДата());
	Сообщить("----------");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура алсав_алсав_ГенерацияАртикуловДляВсехПослеНаСервере()
	// Вставить содержимое обработчика.  
	выборка = Справочники.ХарактеристикиНоменклатуры.Выбрать();
	Пока выборка.Следующий() Цикл
		об = выборка.Ссылка.ПолучитьОбъект();
		об.ОбменДанными.Загрузка = истина;
		об.Записать();
	КонецЦикла;
КонецПроцедуры
