
	
&НаСервере
&Вместо("ПослеЗаписиНаСервере")
Процедура алсав_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Если ЗначениеЗаполнено(ДанныеФайлаHTML) Или ЗначениеЗаполнено(ДанныеФайлаКартинки) Тогда
		
		Если ЗначениеЗаполнено(ДанныеФайлаКартинки) Тогда
			
			ПараметрыФайлаКартинки = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайлаКартинки.Автор				= Пользователи.АвторизованныйПользователь();
			ПараметрыФайлаКартинки.ВладелецФайлов		= ТекущийОбъект.Ссылка;
			ПараметрыФайлаКартинки.ИмяБезРасширения		= ДанныеФайлаКартинки.ИмяБезРасширения;
			ПараметрыФайлаКартинки.РасширениеБезТочки	= ДанныеФайлаКартинки.Расширение;
			
			ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайлаКартинки, АдресКартинки);
			
			ТекущийОбъект.ФайлКартинки = ПрисоединенныйФайл;
			
			ДанныеФайлаКартинки = Неопределено;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеФайлаHTML) Тогда
			
			ПараметрыФайлаHTML = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайлаHTML.Автор				= Пользователи.АвторизованныйПользователь();
			ПараметрыФайлаHTML.ВладелецФайлов		= ТекущийОбъект.Ссылка;
			ПараметрыФайлаHTML.ИмяБезРасширения		= ДанныеФайлаHTML.ИмяБезРасширения;
			ПараметрыФайлаHTML.РасширениеБезТочки	= ДанныеФайлаHTML.Расширение;
			
			ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайлаHTML, АдресОписанияHTML);
			
			ТекущийОбъект.ФайлОписанияДляСайта = ПрисоединенныйФайл;
			
			ДанныеФайлаHTML = Неопределено;
			
		КонецЕсли;
		
		ТекущийОбъект.Записать();
		
		Прочитать();
		
	КонецЕсли;
	
	Если КопироватьИндивидуальныеУпаковки Тогда
		Справочники.УпаковкиЕдиницыИзмерения.СкопироватьИерархиюУпаковок(ИсточникКопирования, Объект.Ссылка);
		КопироватьИндивидуальныеУпаковки = Ложь;
	КонецЕсли;
	
	УстановитьСвязьСХарактеристикамиПродукцииВЕТИС = КопироватьИндивидуальныеХарактеристики
															И КопироватьСвязьСКлассификаторомПродукцииВЕТИС;
	УстановитьСвязьСХарактеристикамиАлкогольнойПродукции = КопироватьИндивидуальныеХарактеристики
															И КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС;
	
	СоответствиеСоздаваемыхОбъектов = Новый Соответствие;
	
	Если КопироватьИндивидуальныеХарактеристики Тогда
		КопироватьИндивидуальныеХарактеристики = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка,
		|	ХарактеристикиНоменклатуры.Наименование,
		|	ХарактеристикиНоменклатуры.НаименованиеПолное,
		|	ХарактеристикиНоменклатуры.ДополнительныеРеквизиты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Свойство,
		|		Значение,
		|		ТекстоваяСтрока
		|	)
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И (Не ХарактеристикиНоменклатуры.ПометкаУдаления)";
		
		Запрос.УстановитьПараметр("Владелец", ИсточникКопирования);
		
		ВыборкаХарактеристик = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаХарактеристик.Следующий() Цикл
			
			ХарактеристикаОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			
			ХарактеристикаОбъект.Наименование       = ВыборкаХарактеристик.Наименование;
			ХарактеристикаОбъект.НаименованиеПолное = ВыборкаХарактеристик.НаименованиеПолное;
			
			ВыборкаДопРеквизитов = ВыборкаХарактеристик.ДополнительныеРеквизиты.Выбрать();
			
			Пока ВыборкаДопРеквизитов.Следующий() Цикл
				
				СтрокаДопРеквизитов = ХарактеристикаОбъект.ДополнительныеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДопРеквизитов,ВыборкаДопРеквизитов);
				
			КонецЦикла;
			
			ХарактеристикаОбъект.Владелец = Объект.Ссылка;
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(ХарактеристикаОбъект,"ИКТ","");
			ХарактеристикаОбъект.Записать();
			
			СоответствиеСоздаваемыхОбъектов.Вставить(ВыборкаХарактеристик.Ссылка, ХарактеристикаОбъект.Ссылка);
			
		КонецЦикла;
	КонецЕсли;
	
	Если КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС Тогда
		
		ИнтеграцияЕГАИСУТ.КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС(
			ИсточникКопирования,
			Объект.Ссылка,
			УстановитьСвязьСХарактеристикамиАлкогольнойПродукции);
			
		КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС = Ложь;
		УстановитьСвязьСХарактеристикамиАлкогольнойПродукции = Ложь;
		
	ИначеЕсли КопироватьСвязьСКлассификаторомПродукцииВЕТИС Тогда
		
		Если УстановитьСвязьСХарактеристикамиПродукцииВЕТИС Тогда
			ИнтеграцияВЕТИСУТ.КопироватьСвязьСКлассификаторомПродукцииВЕТИС(
				ИсточникКопирования,
				Объект.Ссылка,
				СоответствиеСоздаваемыхОбъектов);
		КонецЕсли;
		
		КопироватьСвязьСКлассификаторомПродукцииВЕТИС  = Ложь;
		УстановитьСвязьСХарактеристикамиПродукцииВЕТИС = Ложь;
		
	КонецЕсли;
	
	Если Не Элементы.СтраницаКарточкаНоменклатуры.Доступность Тогда
		РежимВидимостиПоказатьТолькоВажные = Ложь;
		НастройкаВидимостиФормы = "ПоказатьВсе";
		НастроитьФормуИОбновитьКарточку();
		СкрытьРаскрытьВсеГруппы(Ложь);
	Иначе
		НастроитьФормуИОбновитьКарточку();
	КонецЕсли;
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	НастроитьДоступностьБлокируемыхРеквизитов();
	
	// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	Если ИзображенияИзСервиса.Количество() > 0 Тогда
		РаботаСНоменклатуройУТ.ПрикрепитьИзображения(ТекущийОбъект.Ссылка, ИзображенияИзСервиса);
		Прочитать();
		ИзображенияИзСервиса.Очистить();
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(ШтрихкодыСервис) Тогда
		ШтрихКоды = ПолучитьИзВременногоХранилища(ШтрихкодыСервис);
		
		ШтрихкодыДляЗаписи = Новый ТаблицаЗначений;
		
		ШтрихкодыДляЗаписи.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.НоменклатураРаботаСНоменклатурой.Тип);
		ШтрихкодыДляЗаписи.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаРаботаСНоменклатурой.Тип);
		ШтрихкодыДляЗаписи.Колонки.Добавить("Штрихкод",       Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(200)));
		
		Для каждого Элемент Из ШтрихКоды Цикл
			НоваяСтрока = ШтрихкодыДляЗаписи.Добавить();
			НоваяСтрока.Номенклатура = ТекущийОбъект.Ссылка;
			НоваяСтрока.Штрихкод = Элемент.Штрихкод;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
		КонецЦикла; 
		РаботаСНоменклатуройУТ.ЗаписатьШтрихкоды(ШтрихкодыДляЗаписи);
		Прочитать();
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	
	СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
Конецпроцедуры



&НаСервере
Процедура алсав_СгенерироватьАртикулПослеНаСервере()
	// Вставить содержимое обработчика.
	Объект.Артикул = Справочники.Номенклатура.ПолучитьНовыйАртикул();
КонецПроцедуры

&НаКлиенте
Процедура алсав_СгенерироватьАртикулПосле(Команда)
	алсав_СгенерироватьАртикулПослеНаСервере();
КонецПроцедуры

&НаСервере
&Вместо("ПриЧтенииНаСервере")
Процедура алсав_ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое метода.
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ВидНоменклатурыДоИзменения = Объект.ВидНоменклатуры;
	
	//ФИКС
	Если ЭтотОбъект.Элементы.Найти("ГруппаЗаголовокГруппаВидыУпаковокИСМП") = неопределено Тогда
		ИнтеграцияИСМПУТ.ДобавитьЭлементыНастройкиВидаУпаковокПриСоздании(ЭтотОбъект);
	КонецЕсли;
	ИнтеграцияИСМПУТ.ЗаполнитьЗначениеПолейПоВидамУпаковок(ЭтотОбъект);
	
	ПриСозданииЧтенииНаСервере();
	
	НастроитьФормуИОбновитьКарточку();
	
	НастроитьДоступностьБлокируемыхРеквизитов();
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	РаботаСНоменклатурой.ПерезаполнитьВстроенныеРеквизиты(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой

КонецПроцедуры
