
&После("ЗаполнитьСтавкуНДСВСтрокеТЧ")
Процедура алсав_ЗаполнитьСтавкуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	// Вставить содержимое метода. 
	
	Перем СтруктураПараметровДействия;
	
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДС", СтруктураПараметровДействия) Тогда

		Если СтруктураПараметровДействия.Свойство("Данные_Организация") Тогда
			мОрганизацииИп5 = новый Массив;
			мОрганизацииИп5.Добавить(Справочники.Организации.НайтиПоНаименованию("ИП Ню Екатерина Леонидовна"));
			мОрганизацииИп5.Добавить(Справочники.Организации.НайтиПоНаименованию("ИП Савицкий Александр Григорьевич"));
			
			Если (мОрганизацииИп5.Найти(СтруктураПараметровДействия.Данные_Организация) <> Неопределено) 
				//И (ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22) 
				
				Тогда
				
				ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС5;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
