
&Вместо("СоответствиеСтавокИСуммНДС")
Функция алсав_СоответствиеСтавокИСуммНДС()
	// Вставить содержимое метода.
	СоответствиеСтавокНДС = ПродолжитьВызов();
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС5,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС5_105,      0);
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС7,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС7_107,      0);
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22_122,      0);
	
	Возврат СоответствиеСтавокНДС;
КонецФункции
