
&НаКлиенте
&Вместо("ВыполнитьШагСопоставлениеЗагружаемыхДанныхПослеПроверки")
Процедура алсав_ВыполнитьШагСопоставлениеЗагружаемыхДанныхПослеПроверки()
	// Вставить содержимое метода.
		ДоступностьКнопокКомандойПанели(Ложь);
	
	Если ТипЗагрузки = "ВставкаИзБуфераОбмена" ИЛИ ТипЗагрузки = "ТабличнаяЧасть" Тогда
		СопоставитьЗагружаемыеДанныеНаСервере();
		Если ВсеДанныеСопоставлены() И ТипЗагрузки = "ВставкаИзБуфераОбмена" Тогда
			ЗакрытьФормуИВернутьМассивСсылок();	
		ИначеЕсли ТипЗагрузки = "ВставкаИзБуфераОбмена" Тогда
			ЗакрытьФормуИВернутьМассивСсылок_Неоднозначные();
		Иначе
			ВыполнитьШагСопоставлениеЗагружаемыхДанныхКлиент();
		КонецЕсли;
	Иначе
		ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
		ФоновоеЗадание = СопоставитьЗагружаемыеДанныеНаСервереУниверсальнаяЗагрузка();
		Если ФоновоеЗадание.Статус = "Выполняется" Тогда
			Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.ДлительныеОперации;
		КонецЕсли;
	
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		НастройкиОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
		
		Обработчик = Новый ОписаниеОповещения("ПослеСопоставленияЗагружаемыхДанных", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	КонецЕсли;
КонецПроцедуры    


&НаКлиенте
Процедура ЗакрытьФормуИВернутьМассивСсылок_Неоднозначные()
	ПодтверждениеЗакрытияФормы = Истина;
	МассивСсылок = Новый Массив;
	Для каждого Строка Из ТаблицаСопоставленияДанных Цикл
		Если ЗначениеЗаполнено(Строка.СписокНеоднозначностей) Тогда     
			Для Каждого эл из Строка.СписокНеоднозначностей Цикл
				МассивСсылок.Добавить(эл);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(МассивСсылок);
КонецПроцедуры

