
&НаКлиенте
Процедура ПолучитьДанныеСсайта(Команда)
	ПолучитьДанныеСсайтаНаСервере();
	
	т = 1+ 1;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСсайтаНаСервере()
	данные = ПолучитьДанныеСсайтаНаСервереБезКонтекста();
	Для Каждого стр из данные Цикл                                           
		
		нСтр = ЭтаФорма.Номенклатура.Добавить();
		нСтр.НоменклатураГУИД = стр.item;
		нСтр.ХарактеристикаГУИД = стр.sku;
		
		нСтр.Номенклатура = ПолучитьЭлементСправочникаПоГУИД("Номенклатура",нСтр.НоменклатураГУИД);
		нСтр.Характеристика = ПолучитьЭлементСправочникаПоГУИД("ХарактеристикиНоменклатуры",нСтр.ХарактеристикаГУИД);
	КонецЦикла;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЭлементСправочникаПоГУИД(имяСправочника,гуид)
	уи = Новый УникальныйИдентификатор(гуид);
	эл = Справочники[имяСправочника].ПолучитьСсылку(уи);
	Возврат эл;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСсайтаНаСервереБезКонтекста()
	// Вставить содержимое обработчика.
	данные = Обработки.СайтРаботаСОстатками.ПолучитьДанныеСсайта();	
	Возврат данные;
КонецФункции
