Функция СтруктураВjson(Значение)  ЭКСПОРТ

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли;

	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции



Функция JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата = Неопределено)ЭКСПОРТ
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина, ИменаСвойствСоЗначениямиДата);
	
	// Преобразуем соответствие в структуру для унификации типа возвращаемого значения
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
		СтруктураРезультат = Новый Структура;
		Для Каждого КлючИЗначение Из Результат Цикл
			СтруктураРезультат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		Возврат СтруктураРезультат;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
