
&Вместо("ОбработкаПроведения")
Процедура алсав_ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое метода.
	//ПродолжитьВызов(Отказ, РежимПроведения);
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.РасходныйОрдерНаТовары.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	///////////////////////////////
	этоДляСборки = Ложь;
	Если ЭтотОбъект.ТоварыПоРаспоряжениям.Количество()>0 Тогда
		Если ТипЗнч(ЭтотОбъект.ТоварыПоРаспоряжениям[0].Распоряжение) = Тип("ДокументСсылка.СборкаТоваров")
			ИЛИ  ТипЗнч(ЭтотОбъект.ТоварыПоРаспоряжениям[0].Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку")
			Тогда
			этоДляСборки = Истина;
		КонецЕсли;
	КонецЕсли;
	Если этоДляСборки = ложь Тогда		
		СкладыСервер.ОтразитьТоварыКОтбору(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;	
	//СкладыСервер.ОтразитьТоварыКОтбору(ДополнительныеСвойства, Движения, Отказ);
	///////////////////////////////
	СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда
	иначе
		//ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);


КонецПроцедуры
