
&Вместо("ПолучитьШтрихкодПоКоду")
Функция алсав_ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Код, Диапазон, ПрефиксУзлаШтрихкода);
	//Возврат Результат;
	//Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=6; ЧВН=; ЧГ=");
	Штрихкод = Строка(Диапазон) + Формат(Код, "ЧЦ=6; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;
	
	
КонецФункции

&Вместо("НастройкиДиапазоновШтрихкодов")
Функция алсав_НастройкиДиапазоновШтрихкодов()
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов();
	
	НастройкиДиапазоновШтрихкодов = Новый Массив;
	
	Настройка = Новый Структура("Весовой, Диапазон");
	Настройка.Весовой  = Истина;
	Настройка.Диапазон = "201041";
	НастройкиДиапазоновШтрихкодов.Добавить(Настройка);

	
	Настройка = Новый Структура("Весовой, Диапазон");
	Настройка.Весовой  = Ложь;
	Настройка.Диапазон = "201041";
	НастройкиДиапазоновШтрихкодов.Добавить(Настройка);

	
	Возврат НастройкиДиапазоновШтрихкодов;
КонецФункции

&Вместо("ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов")
Функция алсав_ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов()
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов();
	
	ДиапазоныШтучныхШтрихкодов = ЗначениеНастроекПовтИсп.ДиапазоныШтучныхШтрихкодов();
	
	Если ДиапазоныШтучныхШтрихкодов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПрефиксУзла = Константы.ПрефиксШтрихкодовУзлаРИБ.Получить();
	
	ТекстЗапроса = "";
	Запросы = Новый Массив;
	Для Каждого СтрокаТЧ Из ДиапазоныШтучныхШтрихкодов Цикл
		Запросы.Добавить(
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Диапазон КАК Диапазон,
		|	ШтрихкодыНоменклатуры.КодСтрока КАК КодСтрока
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		""" + СтрокаТЧ.Диапазон + """ КАК Диапазон,
		|		ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 7, 6) КАК КодСтрока
		|	ИЗ
		|		РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|	ГДЕ
		|		ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""201041[0-9][0-9][0-9][0-9][0-9][0-9][0-9]""
		|	УПОРЯДОЧИТЬ ПО
		|		ШтрихкодыНоменклатуры.Штрихкод УБЫВ) КАК ШтрихкодыНоменклатуры
		|");
	КонецЦикла;
	ТекстЗапроса = СтрСоединить(Запросы, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ОписаниеТипаЧисла = ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15, 0);
	МаксимальныйКодШтучногоТовара = МаксимальныйКодШтучногоТовара();
	
	МаксимальныеЗначения = Новый Массив;
	
	Если РезультатЗапроса.Количество() = 0 Тогда 
		СтрокаРезультата = Новый Структура;
		СтрокаРезультата.Вставить("Код", 0);
		СтрокаРезультата.Вставить("Диапазон", "201041");
		
		МаксимальныеЗначения.Добавить(СтрокаРезультата);

	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл
		
		Код = ОписаниеТипаЧисла.ПривестиЗначение(СтрокаТЧ.КодСтрока);
		Если Не Код < МаксимальныйКодШтучногоТовара Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРезультата = Новый Структура;
		СтрокаРезультата.Вставить("Код", Код);
		СтрокаРезультата.Вставить("Диапазон", СтрокаТЧ.Диапазон);
		
		МаксимальныеЗначения.Добавить(СтрокаРезультата);
		
	КонецЦикла;
	
	Возврат МаксимальныеЗначения;
	
	Возврат Результат;
КонецФункции
