Функция ВыполнитьПроверкиПоВсем()ЭКСПОРТ
	ВыполнитьПроверки("ХарактеристикиНоменклатуры","Файл сметы");
	ВыполнитьПроверки("Номенклатура","Файл сметы");
	ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры","Файл сметы");
	
	ВыполнитьПроверки("ХарактеристикиНоменклатуры","Файл модели");
	ВыполнитьПроверки("Номенклатура","Файл модели");
	ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры","Файл модели");
КонецФУнкции


Функция ВыполнитьПроверки(типСправочника ,имяСвойства, объект = неопределено)ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Объект КАК Объект,
	               |	Т.ИмяСвойства КАК ИмяСвойства,
	               |	Т.ЗначениеСвойства КАК ЗначениеСвойства
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		дс.Ссылка.Ссылка КАК Объект,
	               |		дс.Свойство.Заголовок КАК ИмяСвойства,
	               |		дс.Значение КАК ЗначениеСвойства
	               |	ИЗ
	               |		Справочник.Номенклатура.ДополнительныеРеквизиты КАК дс) КАК Т";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.Номенклатура.ДополнительныеРеквизиты","Справочник."+типСправочника+".ДополнительныеРеквизиты");
	Если  типСправочника = "ВариантыКомплектацииНоменклатуры" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Т.Объект КАК Объект,
		               |	Т.ИмяСвойства КАК ИмяСвойства,
		               |	Т.ЗначениеСвойства КАК ЗначениеСвойства
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		дс.Объект КАК Объект,
		               |		дс.Свойство.Заголовок КАК ИмяСвойства,
		               |		дс.Значение КАК ЗначениеСвойства
		               |	ИЗ
		               |		РегистрСведений.ДополнительныеСведения КАК дс) КАК Т";
	КонецЕсли;
	
	
	Запрос.Текст = Запрос.Текст +"
	| ГДЕ Т.ИмяСвойства = &имяСвойства";
	Если (объект <> неопределено) и ЗначениеЗаполнено(объект) Тогда
		Запрос.Текст = Запрос.Текст +"
			| И Т.Объект = &объект";
		Запрос.УстановитьПараметр("объект",объект);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("имяСвойства",имяСвойства);
	
	
	выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		запись = РегистрыСведений.алсав_ПроверкаВнешнихФайлов.СоздатьМенеджерЗаписи();
		
		запись.ТипСправочника = типСправочника;
		запись.Объект = выборка.Объект;
		запись.ИмяСвойства = имяСвойства;
		
		запись.ДатаПроверки = ТекущаяДата();
		запись.ЗначениеСвойства = выборка.ЗначениеСвойства;
		
		данныеОФайле = ПолучитьДанныеФайла(выборка.ЗначениеСвойства);
		ЗаполнитьЗначенияСвойств(запись, данныеОФайле);
		
		запись.Записать(ИСТИНА);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДанныеФайла(_полныйПуть)
	
	полныйПуть = _полныйПуть;
	полныйПуть = СтрЗаменить(полныйПуть,"\\","/mnt/");
	полныйПуть = СтрЗаменить(полныйПуть,"\","/");
	
	ВыбФайл = Новый Файл(полныйПуть);
	
	результ = новый Структура();
	
	результ.Вставить("ФайлНайден",ВыбФайл.Существует());
	размерФайла = 0.0;
	Если результ.ФайлНайден Тогда
		размерФайла = ВыбФайл.Размер() / 1024 / 1024;
	КонецЕсли;	
	результ.Вставить("РазмерФайлаМегаБайты",размерФайла);
	
	Возврат результ;
КонецФункции