
&После("ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами")
Процедура алсав_ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаССайтами(Источник, Отказ)
	// Вставить содержимое метода.
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыКомплектацииНоменклатуры") Тогда		
		УстановитьПривилегированныйРежим(Истина);
		
		
		//Попытка
		//	Справочники.ВариантыКомплектацииНоменклатуры.ОбновитьСоставИзделия(Источник.Ссылка);
		//Исключение
		//КонецПопытки;
			
		
		РегистрыСведений.алсав_СоставИзделий.ОбновитьСостав(Источник.Владелец, Источник.Характеристика);
		РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл сметы", Источник.Ссылка);
		РегистрыСведений.алсав_ПроверкаВнешнихФайлов.ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры", "Файл модели", Источник.Ссылка);
		
		Справочники.Номенклатура.ОбновитьИмеетВариантКомплектации(Источник.Владелец);		
		Справочники.Номенклатура.ОбновитьИмеетВариантКомплектацииМатериалы(Источник.Владелец);
		
		Если (НЕ Источник.Характеристика = неопределено) И (ЗначениеЗаполнено(Источник.Характеристика)) Тогда
			Справочники.ХарактеристикиНоменклатуры.ОбновитьИмеетВариантКомплектации(Источник.Характеристика);		
			Справочники.ХарактеристикиНоменклатуры.ОбновитьИмеетВариантКомплектацииМатериалы(Источник.Характеристика);
		КонецЕсли;
		
	КонецЕсли;     
	
	
	ОтразитьИсторияПроведенияДокументов(Источник)
КонецПроцедуры

Процедура ОтразитьИсторияПроведенияДокументов(Источник)
	мТипы = Новый массив;
	мТипы.Добавить(Тип("ДокументОбъект.РеализацияТоваровУслуг"));
	мТипы.Добавить(Тип("ДокументОбъект.КорректировкаРеализации"));
	мТипы.Добавить(Тип("ДокументОбъект.ВозвратТоваровОтКлиента")); 
	
	Если мТипы.Найти(ТипЗнч(Источник)) <> неопределено Тогда
		МенеджерЗаписи  = РегистрыСведений.алсав_ИсторияПроведенияДокументов.СоздатьМенеджерЗаписи();
		
		Попытка
			МенеджерЗаписиЗаказКлиента = Источник.ЗаказКлиента;
		Исключение
		КонецПопытки;
		
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Документ = Источник.Ссылка;
		
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		
		МенеджерЗаписи.Записать(истина);
	КонецЕсли;
Конецпроцедуры