
&НаКлиенте
Процедура алсав_алсав_ОтчетУпаковачныйЛистПосле(Команда)
	ПроверкаСкладаУЗаказаов();
	
	ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
    ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
    
	
	ф = ПолучитьФорму("Отчет.ВО_УпаковочныеЛисты.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант("ВО_УпаковочныеЛисты");
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	
	списокЗаказов = получитьСписокЗаказов();	
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			
			Если Строка(элемент.Параметр) = "ОтчетПоНаличиюНаСкладе" Тогда
				элемент.Значение = получитьОтчетПоНаличиюНаСкладе();
				элемент.Использование = истина;
			КонецЕсли;
			
			Если Строка(элемент.Параметр) = "Склад" Тогда
				элемент.Значение = получитьСклад();
				элемент.Использование = истина;
			КонецЕсли;
			
			Если Строка(элемент.Параметр) = "ДатаОтгрузки" Тогда
				элемент.Значение = получитьДатаОтгрузки();
				элемент.Использование = истина;
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;  
	ф.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ОтчетЛистыКомплектацииЗоныСборкиПосле(Команда)
	ПроверкаСкладаУЗаказаов();
	
	ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
    ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
    
	
	ф = ПолучитьФорму("Отчет.ВО_ЛистыКомплектацииЗоныСборки.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант("ВО_ЛистыКомплектацииЗоныСборки");
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	
	списокЗаказов = получитьСписокЗаказов();	
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			
			Если Строка(элемент.Параметр) = "ОтчетПоНаличиюНаСкладе" Тогда
				элемент.Значение = получитьОтчетПоНаличиюНаСкладе();
				элемент.Использование = истина;
			КонецЕсли;
			
			Если Строка(элемент.Параметр) = "Склад" Тогда
				элемент.Значение = получитьСклад();
				элемент.Использование = истина;
			КонецЕсли;
			
			Если Строка(элемент.Параметр) = "ДатаОтгрузки" Тогда
				элемент.Значение = получитьДатаОтгрузки();
				элемент.Использование = истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;  
	ф.Открыть();

КонецПроцедуры


Функция получитьОтчетПоНаличиюНаСкладе() 
	Возврат ЭтотОбъект.Объект.Ссылка;
КонецФункции


Функция получитьСклад() 
	результ = ""; 
	Для Каждого стрСклад из Объект.Склады Цикл
		результ = результ + " " + стрСклад.Склад;
	КонецЦикла;			
	Возврат результ;	
КонецФункции
Функция получитьДатаОтгрузки()
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		ВызватьИсключение "Не заполнено поле [Дата отгрузки]" ;
	КонецЕсли;
	
	возврат Объект.ДатаОтгрузки;	
КонецФункции

&НаСервере
Функция ПроверкаСкладаУЗаказаов()
	Если Объект.Склады.Количество() <> 1 Тогда
		возврат 0;//ВызватьИсключение "Склад должен быть один";
	КонецЕсли;
	
	основнойСклад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	основнойСкладЗонаСборки = Справочники.Склады.НайтиПоНаименованию("Зона сборки (Основной слад)");
	
	склад = Объект.Склады[0].Склад;
	Если склад = основнойСкладЗонаСборки Тогда 
		склад = основнойСклад;
	КонецЕсли;
		
		
	инд = 0 ;
	ОшибкаСклад = Ложь;
	
	Для Каждого стр из Объект.Заказы Цикл
		инд = инд + 1;
		
		стр.ОшибкаСклад = Ложь;		
		
		стр.Склад = стр.Заказ.Склад; 		
		
		складВЗаказе = стр.Заказ.Склад;
		Если складВЗаказе = основнойСкладЗонаСборки Тогда 
			складВЗаказе = основнойСклад;
		КонецЕсли;

		Если складВЗаказе <> склад Тогда
			стр.ОшибкаСклад = Истина;
			ОшибкаСклад = Истина;
			Сообщить("Склад в заказе ("+инд+") ["+стр.Заказ+"] не совпадет со складом в документе "+склад);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура алсав_алсав_анализДоступностьЖесткийОтборЗаказовПеред(Команда)
	ПроверкаСкладаУЗаказаов();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура алсав_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	ПроверкаСкладаУЗаказаов();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура алсав_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	ПроверкаСкладаУЗаказаов();
	
	Для Каждого стр из Объект.Заказы Цикл
		стр.Минуса = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Заказ, "Минуса");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура алсав_ЗаказыПриИзмененииПосле(Элемент)
	ПроверкаСкладаУЗаказаов();
КонецПроцедуры

&НаКлиенте
Процедура алсав_СкладыПриИзмененииПосле(Элемент)
	ПроверкаСкладаУЗаказаов();
КонецПроцедуры

&НаКлиенте
Процедура алсав_ПослеЗаписиПосле(ПараметрыЗаписи)
	ПроверкаСкладаУЗаказаов();
КонецПроцедуры

&НаКлиенте
Процедура алсав_ЗаполнитьЗаказНеТрожьПосле(Команда)
	// Вставить содержимое обработчика.
	
	ссылкаЗаказФантом = получитьЗаказФантом();
	формаЗаказа = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта", новый Структура("Ключ",ссылкаЗаказФантом));
	формаЗаказа.Объект.Товары.Очистить();
	
	
	мЗаказы = новый Массив;
	Для Каждого стр из Объект.Заказы Цикл
		мЗаказы.Добавить(стр.Заказ);
	КонецЦикла;
	мНоменклатура = ПолучитьТоварыИзЗаказов(мЗаказы);
	формаЗаказа.ДобавитьПозиции(мНоменклатура);
	
	формаЗаказа.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьЗаказФантом()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	док.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК док
	               |ГДЕ
	               |	док.Комментарий ПОДОБНО ""%#НЕ ТРОЖЬ!#%""";
	
	рез = Запрос.Выполнить().Выбрать();
	Рез.Следующий();
	Возврат рез.Ссылка;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТоварыИзЗаказов(мЗаказы)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,НоменСерия.Свойство,НоменСерия.Значение
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменСерия
	               |		ПО ЗаказКлиентаТовары.Номенклатура = НоменСерия.Ссылка
	               |			И (НоменСерия.Свойство.Заголовок = ""Серия"")
	               |			И (НоменСерия.Значение.Наименование = ""Нестандарт"")
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка В(&мЗаказы) AND НоменСерия.Значение.Наименование IS NOT NULL";
	
	Запрос.УстановитьПараметр("мЗаказы",мЗаказы);
	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	результ = новый Массив;
	
	Пока рез.Следующий() Цикл
		стр = Новый Структура("Номенклатура,Характеристика");
		ЗаполнитьЗначенияСвойств(стр, рез);
		результ.Добавить(стр);
	конецЦикла;
	
	возврат результ;
	
КонецФУнкции