
&После("СформироватьКомплектПечатныхФорм")
Процедура алсав_СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, КомплектПечатныхФорм)
	// Вставить содержимое метода.
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
		КомплектПечатныхФорм,
		МассивОбъектов,
		"УБ_ТранспортнаяНакладная");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		
		//_массивОбъектов = новый Массив;
		//Если Ложь Тогда ОбъектыПечати = Новый СписокЗначений; КонецЕсли;
		//Для каждого эл из ОбъектыПечати Цикл
		//	_массивОбъектов.Добавить(эл.Значение);
		//КонецЦикла;
		
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			КомплектПечати.Имя,
			КомплектПечати.Представление,
			Обработки.УБ_ПечатьТранспортнойНакладной.СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, КомплектыПечатиПоОбъектам));
	КонецЦикла;

КонецПроцедуры
