
Функция ПодготовитьИОтправитьJSON()ЭКСПОРТ  
	//данные = ПолучитьДанные();
	данные = ПолучитьДанныеОтправки();
	
	Если ЛОЖЬ Тогда данные = новый Массив; КонецЕсли;
	лимит = 999;
	колвоПодМассивов = (данные.Количество() / лимит)+1;
	
	массивМассивов = алсав_ВыгрузкаCsvJson.РазбитьМассивНаМассивы(данные, колвоПодМассивов, истина);
	
	
	Для Каждого  мДанные из массивМассивов Цикл
		данныеДляОтправки = Новый Соответствие();
		данныеДляОтправки.Вставить("stocks",мДанные);
		json = алсав_ВыгрузкаCsvJson.СтруктураВjson(данныеДляОтправки); 
		ОтправитьДанные(json);       	
	КонецЦикла;    
	
	данныеДляОтправки = Новый Соответствие();
	данныеДляОтправки.Вставить("stocks",данные); 
	json = алсав_ВыгрузкаCsvJson.СтруктураВjson(данныеДляОтправки);
	ЗагрузитьНаFTP(json);
КонецФункции

Функция ОтправитьДанные(данные)
	//https://www.inmyroom.ru/supplier_api/v1/stocks/bulk_update 
	
	хост = "www.inmyroom.ru";
	
	Соединение = Новый HTTPСоединение(хост,,,,,,Истина);
	
	ЗаголовокHTTP = новый Соответствие;
	ЗаголовокHTTP.Вставить("content-type", "application/json"); 
	ЗаголовокHTTP.Вставить("access-token", алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_inmyroom_access_token"));
    ЗаголовокHTTP.Вставить("supplier-id", алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_inmyroom_supplier_id"));

	
	
	HTTPЗапрос = Новый HTTPЗапрос("/supplier_api/v1/stocks/bulk_update", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(данные);
	
	Результат = Соединение.Записать(HTTPЗапрос);//PUT
	
	Сообщить("Код ответа:" + Результат.КодСостояния);
	Сообщить("Тело ответа:" + Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
КонецФункции	

Функция ПолучитьДанныеОтправки()
	
	данные = новый Массив;
	поляШаблон = "sku,price,old_price,stock,available";
	
	////////////////////////////////////////////////////////////////////
	Запрос = ПолучитьЗапрос();	
	////////////////////////////////////////////////////////////////////
	
	дт1 = ТекущаяДата();
	рез = Запрос.Выполнить().Выбрать();
	дт2 = ТекущаяДата();
	
	Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		
		ЗаполнитьЗначенияСвойств(нСтр, Рез);
		нСтр = алсав_ВыгрузкаCsvJson.СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(нСтр);   
		нСтр.available = "false";
		
		данные.Добавить(нСтр);
	КонецЦикла;
	Возврат данные;
КонецФункции 

/////////////////////////////////////////////////////////////////////////////////////////
///////////////////                      V2 json,csv                /////////////////////     
/////////////////////////////////////////////////////////////////////////////////////////

Функция ЗагрузитьНаFTP(json)
	
	имяФайла = "inmyroom_price";
	
	// Получаем данные для FTP из безопасного хранилища
	СерверFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_ftp");
	ЛогинFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_csv_alsav_login");
	ПарольFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_csv_alsav_password");
	
	ФТПСоединение = Новый FTPСоединение(СерверFTP, 21, ЛогинFTP, ПарольFTP);
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	контент_json = json;
	ВременныйФайл = ПолучитьИмяВременногоФайла("json");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент_json);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".json"); 	
	УдалитьФайлы(ВременныйФайл);  
КонецФункции


Функция ПолучитьСхемуКомпановкиДанных()
	возврат ПолучитьМакет("ЗапросДляВыгрузки");
КонецФункции
                   

Функция ПолучиьтТекстЗапроса()
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпановкиДанных(); 
	Если ЛОЖЬ Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных; КонецЕсли;
	запрос = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	возврат запрос;;
КонецФункции 
              

Функция ПолучитьЗапрос()
	////////////////////////////////////////////////////////////////////
	запросТекст = ПолучиьтТекстЗапроса();
	
	Запрос = Новый Запрос(запросТекст);       
	
	////// базовые параметры 
	ВидыЦен = Новый Массив();
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Розница INMYROOM 10%, 25%"));
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Розница INMYROOM 8%"));
	//ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Розница INMYROOM 10%, 25%"));
	
	Запрос.УстановитьПараметр("ВидыЦен",ВидыЦен);
	
	////// дополнительные параметры
	группыНоманклатуры = Новый Массив;
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("1.1 Продукция стандартная"));
	
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);

	
	Запрос.Текст 
	= "ВЫБРАТЬ
	|	*
	| ИЗ (" + Запрос.Текст + "
	| ) КАК Т
	| WHERE Т.Номенклатура В ИЕРАРХИИ (&группыНоманклатуры) И Т.price > 0 
	//| И Т.sku = ""2010419024670""
	|";
	
	Возврат Запрос;
КонецФункции