
// минимальный набор для описания внешней обработки или отчета
//&НаКлиенте
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Наименование", "ВО_РеализацииСКомплектующимиИПолуфабрикатами");
	РегистрационныеДанные.Вставить("Версия", "0.1");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Реализации с комплектующими и полуфабрикатами");
	ТЗКоманды = Новый ТаблицаЗначений;
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");
	СтрокаКоманды = ТЗКоманды.Добавить();
	СтрокаКоманды.Представление = "Реализации с комплектующими и полуфабрикатами";
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	СтрокаКоманды.Идентификатор = "ВО_РеализацииСКомплектующимиИПолуфабрикатами";
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);
	Возврат РегистрационныеДанные;
КонецФункции

