
&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ограниченныйДоступ = НЕ УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоРедактироватьЭтапыОплаты.Имя);
	полныеПрава = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.ПолныеПрава.Имя);
	Если (ограниченныйДоступ И НЕ полныеПрава) Тогда
		
		//Элементы.ГруппаСправаСлева.ТолькоПросмотр = Истина;
		Элементы.ГруппаГрафикИФормаОплаты.ТолькоПросмотр = Истина;
		//ГруппаИсточникиОплаты
		Элементы.ИдентификаторПлатежа.ТолькоПросмотр = Истина;
		Элементы.Касса.ТолькоПросмотр = Истина;
		Элементы.БанковскийСчет.ТолькоПросмотр = НЕ УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоРедактироватьЭтапыОплаты_БанковскийСчет.Имя);
		
		//Элементы.СтраницаУпрощеннаяСхема.ТолькоПросмотр = Истина;
		
		
		Элементы.РаспределитьСуммуТаблица.Доступность = ЛОЖЬ;
		Элементы.ЭтапыГрафикаОплаты.ТолькоПросмотр = ИСТИНА;
		
		Элементы.ГруппаОтклонениеОплатыМерныхТоваров.ТолькоПросмотр = Истина;
		Элементы.ГруппаПодвал.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
