
&После("ПриПодготовкеСтруктурыДанныхДляПечати")
Процедура алсав_ПриПодготовкеСтруктурыДанныхДляПечати(СтруктураНастроек, Режим, Запрос, ИсходныеДанные)
	// Вставить содержимое метода.
	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст
	//			,"ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
	//			," ИсходныеДанныеПоследнийЗапрос._ШтрихкодВнешний КАК _ШтрихкодВнешний, ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
	//		);
	//		
	//		 Запрос.Текст = СтрЗаменить(Запрос.Текст
	//			,"ИсходныеДанные.Номенклатура КАК Номенклатура,"
	//			," ИсходныеДанные._ШтрихкодВнешний КАК _ШтрихкодВнешний, ИсходныеДанные.Номенклатура КАК Номенклатура,"
	//		);
	Если ИсходныеДанные <> НЕОПРЕДЕЛЕНО Тогда
		Если ИсходныеДанные.Колонки.Найти("_Артикул_HOFF") <> Неопределено Тогда
		    Запрос.Текст = СтрЗаменить(Запрос.Текст
				,"ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
				," ИсходныеДанныеПоследнийЗапрос._Позиция_HOFF КАК _Позиция_HOFF, ИсходныеДанныеПоследнийЗапрос._Артикул_HOFF, ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
			);
			
			 Запрос.Текст = СтрЗаменить(Запрос.Текст
				,"ИсходныеДанные.Номенклатура КАК Номенклатура,"
				," ИсходныеДанные._Позиция_HOFF КАК _Позиция_HOFF, ИсходныеДанные._Артикул_HOFF КАК _Артикул_HOFF, ИсходныеДанные.Номенклатура КАК Номенклатура,"
			);
		КонецЕсли;
	КонецЕсли; 
	
	Если ИсходныеДанные.Колонки.Найти("_ИКТ") <> Неопределено Тогда
		    Запрос.Текст = СтрЗаменить(Запрос.Текст
				,"ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
				," ИсходныеДанныеПоследнийЗапрос._ИКТ КАК _ИКТ, ИсходныеДанныеПоследнийЗапрос.Номенклатура КАК Номенклатура,"
			);
			
			 Запрос.Текст = СтрЗаменить(Запрос.Текст
				,"ИсходныеДанные.Номенклатура КАК Номенклатура,"
				," ИсходныеДанные._ИКТ КАК _ИКТ, ИсходныеДанные.Номенклатура КАК Номенклатура,"
			);
		КонецЕсли;
КонецПроцедуры
