Функция СтруктураВjson(Значение)  ЭКСПОРТ

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли;

	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции

Функция МассивСтруктурВCSV(данные)ЭКСПОРТ
	Если ЛОЖЬ Тогда данные = новый Массив; КонецЕсли;
	
	контент = "";
	Для Каждого стр из данные Цикл
		Если ЛОЖЬ Тогда стр = Новый Структура; КонецЕсли; 
		мКолонки = новый Массив;
		Для Каждого эл из стр цикл              
			
			знч = "";
			Если ТипЗнч(эл.Значение) = Тип("Число") Тогда 
				знч = НормализоватьЧисло(эл.Значение);
			Иначе
				знч = СокрЛП(Строка(эл.Значение));
			КонецЕсли;
			
			мКолонки.Добавить(знч);			
		КонецЦикла;                
		мКолонки.Добавить(Символы.ПС);
		контент = контент + СтрСоединить(мКолонки,";");
	КонецЦикла;   
	
	Возврат контент;
КонецФункции


Функция СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(стр) Экспорт
	Если ЛОЖЬ Тогда стр = Новый Структура; КонецЕсли;
	
	Для Каждого эл из стр цикл
		значение = эл.Значение;
		
		нЗначение = значение;
		Если значение = Неопределено Тогда
			нЗначение = "";
		ИначеЕсли ТипЗнч(значение) = Тип("Число") Тогда
		ИначеЕсли ТипЗнч(значение) = Тип("Строка") Тогда
		ИначеЕсли ТипЗнч(значение) = Тип("Дата") Тогда
		Иначе
			нЗначение = Строка(значение);
		КонецЕсли;
		
		стр[эл.Ключ] = нЗначение;
	КонецЦикла; 
	
	Возврат стр;
КонецФункции


Функция НормализоватьЧисло(ч)
	 Возврат Формат( ч,"ЧГ=0" );
КонецФункции


// Параметры:
//  ВходящийМассив  - Массив - массив значений для заполнения таблицы;
//  КоличествоПодмассивов - Число - Количество подмассивов которые нужно создать;
//  УдалятьПустые - Булево - Признак что нужно возвращать только заполненные массивы.
Функция РазбитьМассивНаМассивы(ВходящийМассив,КоличествоПодмассивов,УдалятьПустые = Истина) Экспорт

	КоличествоПодмассивов = Окр(КоличествоПодмассивов, 0, РежимОкругления.Окр15как20);
   ПулМассивов = Новый Массив;

   // Готовим массивы
   Для НомерМассива = 1 По КоличествоПодмассивов Цикл
       ПулМассивов.Добавить(Новый Массив);
   КонецЦикла;

   // Переносим массивы
   ТекНомерМассива = 0; // индексы, не забываем
   Для Каждого ТекЭл Из ВходящийМассив Цикл
       ПулМассивов[ТекНомерМассива].Добавить(ТекЭл);
       // говорим в какой поток дальше вставлять данные.
       ТекНомерМассива = ?(ТекНомерМассива=(КоличествоПодмассивов-1),0,ТекНомерМассива+1);
   КонецЦикла;

   // Удаляем пустые
   Если УдалятьПустые Тогда
       МассивУдаления = Новый Массив;
       Для Каждого ТекМассив Из ПулМассивов Цикл
           Если ТекМассив.Количество() = 0 Тогда
                МассивУдаления.Добавить(ТекМассив);
           КонецЕсли;
       КонецЦикла;

       Для Каждого ТекУдМассив Из МассивУдаления Цикл
           Инд = ПулМассивов.Найти(ТекУдМассив);
           ПулМассивов.Удалить(Инд);
       КонецЦикла;
   КонецЕсли;

   Возврат ПулМассивов;
КонецФункции