&НаСервере
Процедура алсав_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	ПроверитьЕстьСложныеТовары();
КонецПроцедуры


&НаСервере
Функция ПроверитьЕстьСложныеТовары()
	ЭтаФорма.Элементы.ЕстьСложныйТовар.Видимость = Ложь;
	
	Для каждого стр из Объект.Товары Цикл
		
		вариант = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(стр.Номенклатура, стр.Характеристика);
		Если ЗначениеЗаполнено(вариант) Тогда
			ЭтаФорма.Элементы.ЕстьСложныйТовар.Видимость = Истина;
			break;
		КонецЕсли;
		
	КонецЦикла;
конецФункции

&НаКлиенте
Процедура алсав_ВозвращаемыеТоварыПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	ПроверитьЕстьСложныеТовары();
КонецПроцедуры

