
&Перед("ПриЗаписи")
Процедура алсав_ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;

	//
	//Если Не Отказ И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	УдалитьОрдер(ЭтотОбъект.Ссылка);
	//	УдалитьСборку(ЭтотОбъект.Ссылка);
	//КонецЕсли;
КонецПроцедуры


Функция УдалитьСборку(заказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СборкаТоваров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СборкаТоваров КАК СборкаТоваров
	               |ГДЕ
	               |	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
	               |	И СборкаТоваров.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку",ЗаказНаСборку);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл 	
		Рез.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецФункции
			   
			   
Функция УдалитьОрдер(заказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ордер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК Ордер
	               |ГДЕ
	               |	Ордер.Проведен = ИСТИНА
	               |	И Ордер.Распоряжение = &ЗаказНаСборку";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку",ЗаказНаСборку);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл 	
		Рез.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецФункции