
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Обработка.ЗагрузкаСвойствХарактеристик.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ОткрытьФорму("Обработка.ЗагрузкаСвойствХарактеристик.Форма",
	             ,
	             ПараметрыВыполненияКоманды.Источник,
	             Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000002"),
	             ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
