Функция ПолучитьСхемуКомпановкиДанных()
	возврат ПолучитьМакет("ЗапросДляВыгрузки");
КонецФункции 

Функция ВыполнитьВыгрузку() ЭКСПОРТ 
	
	мДанные = ПолучитьДанные();
	контент = алсав_ВыгрузкаCsvJson.МассивСтруктурВCSV(мДанные);
	
	имяФайла = "ostatki_alsav_price";
	
	// Получаем данные для FTP из безопасного хранилища
	СерверFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_ftp");
	ЛогинFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_csv_alsav_login");
	ПарольFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_csv_alsav_password");
	
	ФТПСоединение = Новый FTPСоединение(СерверFTP, 21, ЛогинFTP, ПарольFTP);
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".csv"); 
	УдалитьФайлы(ВременныйФайл);  
	
	контент_json = алсав_ВыгрузкаCsvJson.СтруктураВjson(мДанные);
	ВременныйФайл = ПолучитьИмяВременногоФайла("json");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент_json);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".json"); 	
	УдалитьФайлы(ВременныйФайл);   
КонецФункции

Функция ПолучиьтТекстЗапроса()
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпановкиДанных(); 
	Если ЛОЖЬ Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных; КонецЕсли;
	запрос = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	возврат запрос;;
КонецФункции


Функция ПолучитьДанные()
	
	//  e1cib/data/Справочник.ВариантыОтчетов?ref=9de90242ac11000411f05d98b2ef5d18
	данные = новый Массив;
	поляШаблон = "Серия,ВидНоменклатуры,Артикул,Номенклатура,Характеристика,Штрихкод,ЕдиницаИзмерения,Остатки,ОтпускнаяЦена";
	////////////////////////////////////////////////////////////////////
	запросТекст = ПолучиьтТекстЗапроса();
	
	Запрос = Новый Запрос(запросТекст);       
	
	////// базовые параметры
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВидЦены",Справочники.ВидыЦен.НайтиПоНаименованию("Отпускная цена (с учетом НДС)")); 
	Запрос.УстановитьПараметр("ПроцентОплаты",1);
	
	
	////// дополнительные параметры
	группыНоманклатуры = Новый Массив;
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("1.1 Продукция стандартная"));
	                                                                                                           	
	
	группыНоманклатурыИсключения = Новый Массив;
	группыНоманклатурыИсключения.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("3 ""ЭКОНОМ"""));
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("группыНоманклатурыИсключения",группыНоманклатурыИсключения); 
	
	
	
	//Продукт номенклатура.Серия
	//Продукт штрихкод
	//Продукт номенклатура.Артикул
	//Продукт номенклатура
	//Продукт характеристика
	//Продукт цена
	//Продукт номенклатура.Вид номенклатуры
	// Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ","ВЫБРАТЬ ");
	Запрос.Текст 
	= "ВЫБРАТЬ Т.Серия.Наименование Серия, Т.ПродуктШтрихкод Штрихкод, Т.ПродуктНоменклатура.Артикул Артикул, ПродуктНоменклатура.ЕдиницаИзмерения.Наименование как ЕдиницаИзмерения, ПродуктНоменклатура.Наименование Номенклатура, ПродуктХарактеристика.Наименование Характеристика, ПродуктЦена ОтпускнаяЦена, ПродуктНоменклатура.ВидНоменклатуры.Наименование ВидНоменклатуры
	| , MIN(ВозможностьСобрать) Остатки
	| ИЗ (" + Запрос.Текст + "
	| ) КАК Т 
	| WHERE Т.ПродуктНоменклатура В ИЕРАРХИИ (&группыНоманклатуры) И Т.ПродуктНоменклатура НЕ В ИЕРАРХИИ (&группыНоманклатурыИсключения)
	| GROUP BY Т.Серия, Т.ПродуктШтрихкод, Т.ПродуктНоменклатура.Артикул, ПродуктНоменклатура, ПродуктХарактеристика, ПродуктЦена, ПродуктНоменклатура.ВидНоменклатуры
	//| HAVING MIN(ВозможностьСобрать) >= 1
	| ORDER BY Т.Серия";
	
	дт1 = ТекущаяДата();
	рез = Запрос.Выполнить().Выбрать();
	дт2 = ТекущаяДата();
	
	Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		
		ЗаполнитьЗначенияСвойств(нСтр, Рез);
		
		Если нСтр.Остатки < 0 Тогда
			нСтр.Остатки = 0;
		КонецЕсли;
		нСтр = алсав_ВыгрузкаCsvJson.СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(нСтр);
		
		данные.Добавить(нСтр);
	КонецЦикла;
	Возврат данные;
КонецФункции  



