
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СписокСборок.Видимость = Истина;
	Элементы.СписокСформированныхЗаказов.Видимость = Ложь;
	
	ЭтаФорма.Заказы = Параметры.Заказы;
	
	ЭтаФорма.Сборки.Очистить();
		
	массивЗаказов = ЭтаФорма.Заказы.ВыгрузитьЗначения();
	тчСборки = Обработки.ПомошникСозданияСборок.ЗаполнитьСписокСборок(массивЗаказов);
	Обработки.ПомошникСозданияСборок.ЗаполнитьВариантыКомплектации(тчСборки);
	Обработки.ПомошникСозданияСборок.НайтиСозданныеЗаказыНаСборку(тчСборки);
	
	ЭтаФорма.Сборки.Загрузить(тчСборки);
КонецПроцедуры




&НаСервере 
Функция СформироватьЗаказыНаСборкуСервер()
	сформированныеЗаказы = Обработки.ПомошникСозданияСборок.СоздатьЗаказыНаСборку(ЭтаФорма.Сборки.Выгрузить());
	Если(сформированныеЗаказы <> неопределено) Тогда
		ЭтаФорма.СформированныеЗаказы.ЗагрузитьЗначения(сформированныеЗаказы);
		Элементы.СписокСборок.Видимость = Ложь;
		Элементы.СписокСформированныхЗаказов.Видимость = Истина;		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СформироватьЗаказыНаСборку(Команда)ЭКСПОРТ
	// Вставить содержимое обработчика.
	СформироватьЗаказыНаСборкуСервер();
КонецПроцедуры

&НаКлиенте
Функция ИсполнитьЗаказыНаСборку(Команда) ЭКСПОРТ
	Возврат ИсполнитьЗаказыНаСборкуСервер();
КонецФункции

&НаСервере 
Функция ИсполнитьЗаказыНаСборкуСервер()
	Для Каждого Заказ Из СформированныеЗаказы Цикл
		докСборка = Обработки.ПомошникСозданияСборок.СоздатьСборку(Заказ.Значение);		
		ЭтаФорма.СформированныеСборки.Добавить(докСборка);
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура СформированныеЗаказыЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ОткрытьЗначение( ВыбранноеЗначение);
КонецПроцедуры

