Функция ПолучитьСхемуКомпановкиДанных()
	возврат обработки.алсав_ВыгрузкаФайла__ЭО_Распродажа.ПолучитьМакет("ЗапросДляВыгрузки");
КонецФункции 

Функция ВыполнитьВыгрузку() ЭКСПОРТ 
	
	данные = ПолучитьДанные();
	контент = алсав_ВыгрузкаCsvJson.МассивСтруктурВCSV(данные);

	// Получаем данные для FTP из безопасного хранилища
	СерверFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_ftp");
	ЛогинFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_express_office_login");
	ПарольFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_express_office_password");
	
	ФТПСоединение = Новый FTPСоединение(СерверFTP, 21, ЛогинFTP, ПарольFTP);
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,"alsav_discount_express_office.csv"); 
	УдалитьФайлы(ВременныйФайл);
КонецФункции

Функция ПолучиьтТекстЗапроса()
	
	//Настройки =    КомпоновщикНастроек.Настройки;
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;  
	
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпановкиДанных(); 
	Если ЛОЖЬ Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных; КонецЕсли;
	запрос = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	возврат запрос;
	//
	//     
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки); 
	//запрос = МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;   
	//
	//возврат запрос;
КонецФункции


Функция ПолучитьДанные()
	
	данные = новый Массив;
	поляШаблон = "Штрихкод,Артикул,Номенклатура,Характеристика,Остаток";
	////////////////////////////////////////////////////////////////////
	запросТекст = ПолучиьтТекстЗапроса();
	
	Запрос = Новый Запрос(запросТекст);       
	
	группыНоманклатуры = Новый Массив;
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("1.1 Продукция стандартная"));
	
	
	группыНоманклатуры4650 = Новый Массив;
	группыНоманклатуры4650.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стулья деревянные HORECA"));
	группыНоманклатуры4650.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стулья металлические HORECA"));
	группыНоманклатуры4650.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Кресла ALSAV"));
	
	
	группыНоманклатурыИсключения = Новый Массив;
	группыНоманклатурыИсключения.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("3 ""ЭКОНОМ"""));
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("группыНоманклатуры4650",группыНоманклатуры4650);
	Запрос.УстановитьПараметр("группыНоманклатурыИсключения",группыНоманклатурыИсключения);
	
	рез = Запрос.Выполнить().Выбрать();
	
		Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		ЗаполнитьЗначенияСвойств(нСтр, Рез);
		данные.Добавить(нСтр);
	КонецЦикла;
	Возврат данные;
КонецФункции  



