
&Вместо("НомерНаПечать")
Функция алсав_НомерНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс)
	// Вставить содержимое метода.
	Возврат ПродолжитьВызов(НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
//	
//	лимит = ?(Лев(НомерОбъекта,4) = "ВМУТ", 200, 1000 );
//	
//	_НомерОбъекта = НомерОбъекта;
//	_НомерОбъекта = СтрЗаменить(_НомерОбъекта,"ПКУТ-60","ПКУТ-00");
//	_НомерОбъекта = СтрЗаменить(_НомерОбъекта,"ТОУТ-20","ТОУТ-00");
//	_НомерОбъекта = СтрЗаменить(_НомерОбъекта,"АВУТ-10","АВУТ-00");
//	
//	Попытка
//		Если Число(УдалитьПрефиксыИзНомераОбъекта(_НомерОбъекта, истина, истина))<лимит Тогда
//		//Если ТекущаяДата() > Дата(2019,12,01) Тогда
//			Возврат ПродолжитьВызов(НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
//		КонецЕсли;
//	Исключение
//	Конецпопытки;

//	
//	
//	//НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Ложь, ИСТИНА);
//	НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Ложь, Ложь);
////УБ_Груздов(
//	К=Найти(НомерОбъекта, "-");
//	Если К>0 Тогда
//		Если Врег(лев(НомерОбъекта,К))="ВСУТ-" Тогда
//			//НомерОбъекта="ВМ-"+Прав(НомерОбъекта,СтрДлина(НомерОбъекта)-к);
//		КонецЕсли;
//	КонецЕсли;
////УБ_Груздов)

//	Возврат НомерОбъекта;
//	//Возврат Результат;
КонецФункции
