
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьЗначениеСекретаНаСервере(КлючСекрета) Экспорт 
	ЗначениеСекрета = алсав_ВыгрузкаCsvJson.ПолучитьСекрет(КлючСекрета)	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверяем заполненность обязательных полей
	Если ПустаяСтрока(Запись.Ключ) Тогда
		ПоказатьПредупреждение(, "Необходимо указать ключ секрета!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
// Проверяем значение секрета на сервере
	ПроверитьЗначениеСекретаПередЗаписью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПослеЗаписи()
	
	ПоказатьОповещениеПользователя("Сохранение", , "Секрет '" + Запись.Ключ + "' успешно сохранен!", БиблиотекаКартинок.Информация32);
	
	// После сохранения скрываем значение для безопасности
	ЗначениеСекрета = "******";
	
КонецПроцедуры



&НаСервере
Процедура ПроверитьЗначениеСекретаПередЗаписью()
	алсав_ВыгрузкаCsvJson.СохранитьСекрет(Запись.Ключ, ЗначениеСекрета, Запись.Используется);
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЗначениеСекрета()
	ЗначениеСекрета = алсав_ВыгрузкаCsvJson.ПолучитьСекрет(Запись.Ключ); 
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое обработчика.
	ЗагрузитьЗначениеСекрета();
КонецПроцедуры
