&НаКлиенте
Функция ТоварыНоменклатураПриИзменении_Э() ЭКСПОРТ
	ТоварыНоменклатураПриИзменении(Элементы.Товары);
КонецФункции

&НаКлиенте
Процедура алсав_алсав_ЗаполнитьПоОстаткамПосле(Команда)
	// Вставить содержимое обработчика.             
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РежимВыбора",Истина);
	//ПараметрыФормы.Вставить("МножественныйВыбор",ложь); ///Если хотим несколько значений

	ОбработкаВыбора = Новый ОписаниеОповещения("алсав_алсав_ЗаполнитьПоОстаткамПослеПриЗакрытииФормыВыбора", ЭтаФорма,"ПодборРеализации");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры     

&НаКлиенте
Процедура алсав_алсав_ЗаполнитьПоОстаткамПослеПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

   //Дополнительные условия если необходимо
   //Если ДопПараметры = "ПодборРеализации" тогда

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
    КонецЕсли;
     
    алсав_алсав_ЗаполнитьПоОстаткамСерверПосле(Значение)
    

    //КонецЕсли;
КонецПроцедуры

&НаСервере
Функция алсав_алсав_ЗаполнитьПоОстаткамСерверПосле(группаНоменклатуры)
	Сообщить(группаНоменклатуры);	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	//               |	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	//               |	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	//               |ИЗ
	//               |	РегистрНакопления.ТоварыОрганизаций.Остатки КАК ТоварыОрганизацийОстатки
	//               |ГДЕ
	//               |	ТоварыОрганизацийОстатки.Организация = &Организация
	//               |	И ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&НоменклатураГруппа)
	//               |	И ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения.Ссылка = &МестоХранения";     
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			,
	               |			Склад = &МестоХранения
	               |				И Номенклатура В ИЕРАРХИИ (&НоменклатураГруппа)) КАК ТоварыНаСкладахОстатки";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Объект.Организация);
	Запрос.УстановитьПараметр("МестоХранения", ЭтаФорма.Объект.СкладОтправитель);
	Запрос.УстановитьПараметр("НоменклатураГруппа", группаНоменклатуры);  
	
	рез = Запрос.Выполнить().Выбрать();
	
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	
	
	Пока рез.Следующий() Цикл   
		ТекущаяСтрока = Объект.Товары.Добавить();
		
		ТекущаяСтрока.Номенклатура = рез.Номенклатура;
		ТекущаяСтрока.Характеристика = рез.Характеристика;
		ТекущаяСтрока.ХарактеристикиИспользуются = ЗначениеЗаполнено(рез.Характеристика);
		//ТекущаяСтрока.Упаковка = ;
		ТекущаяСтрока.КоличествоУпаковок = рез.КоличествоОстаток;
		
		ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.ПеремещениеПоЗаказам);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ТекущаяСтрока.ЗаказНаПеремещение = ЗаказВСтрокеСверхЗаказа(Объект.ПеремещениеПоЗаказам, Объект.ЗаказНаПеремещение);
		
	КонецЦикла;
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
КонецФункции


&НаКлиенте
Процедура алсав_алсав_СкопироватьМинМаксОстатокПосле(Команда)     
	
	ПараметрыФормы = Новый Структура;
	
	Если не ЗначениеЗаполнено(Объект.СкладОтправитель) или не ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
		ВызватьИсключение "Не заполнен склад отпровитель/получатель";
	КонецЕсли;

	ОбработкаВыбора = Новый ОписаниеОповещения("алсав_алсав_СкопироватьМинМаксОстатокПослеПриЗакрытииФормыВыбора", ЭтаФорма,"ПодборРеализации");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СкопироватьМинМаксОстатокПослеПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
    КонецЕсли;
    алсав_алсав_СкопироватьМинМаксОстатокПослеПриЗакрытииФормыВыбораСервер(Объект.СкладОтправитель,Объект.СкладПолучатель,Значение);
КонецПроцедуры         

&НаСервереБезКонтекста
Процедура алсав_алсав_СкопироватьМинМаксОстатокПослеПриЗакрытииФормыВыбораСервер(СкладОтправитель, СкладПолучатель, группаНоменклатуры)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&группаНоменклатуры)";
	
	Запрос.УстановитьПараметр("группаНоменклатуры",группаНоменклатуры);
	
	рез = запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		алсав_СкопироватьДляПозиции(
			СкладОтправитель,
			СкладПолучатель,
			рез.Номенклатура);
	КонецЦикла;
		
КонецПроцедуры


&НаСервереБезКонтекста
Функция алсав_СкопироватьДляПозиции(складОтправитель, складПолучатель, номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварныеОграничения.Склад КАК Склад,
	               |	ТоварныеОграничения.Номенклатура КАК Номенклатура,
	               |	ТоварныеОграничения.Характеристика КАК Характеристика,
	               |	ТоварныеОграничения.Группировка КАК Группировка,
	               |	ТоварныеОграничения.СтраховоеКоличествоЗапаса КАК СтраховоеКоличествоЗапаса,
	               |	ТоварныеОграничения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса,
	               |	ТоварныеОграничения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса,
	               |	ТоварныеОграничения.НормаПотребления КАК НормаПотребления,
	               |	ТоварныеОграничения.МетодОбеспеченияПотребностей КАК МетодОбеспеченияПотребностей,
	               |	ТоварныеОграничения.УпаковкаЗаказа КАК УпаковкаЗаказа,
	               |	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса КАК ОбеспечениеЗаказовПриПоддержанииЗапаса,
	               |	ТоварныеОграничения.СреднедневноеПотребление КАК СреднедневноеПотребление,
	               |	ТоварныеОграничения.СреднееОтклонениеПотребления КАК СреднееОтклонениеПотребления,
	               |	ТоварныеОграничения.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	ТоварныеОграничения.ДатаРасчетаРекомендаций КАК ДатаРасчетаРекомендаций,
	               |	ТоварныеОграничения.ЭтоДействующийПараметр КАК ЭтоДействующийПараметр,
	               |	ТоварныеОграничения.ЕстьРекомендацияПоИзменению КАК ЕстьРекомендацияПоИзменению,
	               |	ТоварныеОграничения.ЭтоГруппировка КАК ЭтоГруппировка
	               |ИЗ
	               |	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	               |ГДЕ
	               |	ТоварныеОграничения.Склад = &Склад
	               |	И ТоварныеОграничения.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Склад", складОтправитель);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		запись = РегистрыСведений.ТоварныеОграничения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(запись, рез);
		запись.Склад = складПолучатель;
		запись.Записать(истина);
	КонецЦикла;
	
КонецФункции

