Функция ОбновитьСостав(ПродуктНоменклатура, ПродуктХарактеристика) ЭКСПОРТ
	//комплектация = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(номенклатура, характеристика);
	//Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьКомплектующиеНоменклатуры(комплектация,,1);
	
	состав = ПолучитьКомплектующиеНоменклатурыПолный(ПродуктНоменклатура, ПродуктХарактеристика, 1);
	
	нз = РегистрыСведений.алсав_СоставИзделий.СоздатьНаборЗаписей();
	нз.Отбор.ПродуктНоменклатура.Установить(ПродуктНоменклатура);
	нз.Отбор.ПродуктХарактеристика.Установить(ПродуктХарактеристика);
	
	Для Каждого стр из состав Цикл
		запись = нз.Добавить();
		ЗаполнитьЗначенияСвойств(запись,стр);
		запись.Количество = стр.Количество;
			
		запись.ПродуктНоменклатура = ПродуктНоменклатура;
		запись.ПродуктХарактеристика = ПродуктХарактеристика;
		
	КонецЦикла;
	
	нз.Записать(ИСТИНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Владелец,
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК Характеристика
	               |ИЗ
	               |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	               |ГДЕ
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА
				   |	И ВариантыКомплектацииНоменклатурыТовары.Номенклатура = &Номенклатура
	               |	И ВариантыКомплектацииНоменклатурыТовары.Характеристика = &Характеристика";
	
	ЗАпрос.УстановитьПараметр("Номенклатура",ПродуктНоменклатура);
	ЗАпрос.УстановитьПараметр("Характеристика",ПродуктХарактеристика);
	
	рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ПолучитьКомплектующиеНоменклатурыПолный(рез.Владелец, рез.Характеристика);
	КонецЦикла;

КонецФункции




Функция ПолучитьКомплектующиеНоменклатурыПолный(номенклатура, характеристика, Количество = 1, ПутьВСборке = "", ПутьВСборкеНоменклатура = "") Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК ВариантКомплектацииНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	Товары.Упаковка КАК Упаковка,
	|	СУММА(&КоличествоКомплектов * Товары.КоличествоУпаковок / Товары.Ссылка.Количество) КАК КоличествоУпаковок,
	|	СУММА(&КоличествоКомплектов * Товары.Количество / Товары.Ссылка.Количество) КАК Количество,
	|	СУММА(Товары.ДоляСтоимости) КАК ДоляСтоимости,
	|	ВЫБОР
	|		КОГДА НЕ Товары.Ссылка.ЭтоМатериалы
	|			ТОГДА Товары.Ссылка.Основной
	|		ИНАЧЕ Товары.Ссылка.ОсобенностиКомплектацииПроект В (&мПроектПустой)
	|	КОНЕЦ КАК Основной,
	|	Товары.Ссылка.ЭтоМатериалы КАК ЭтоМатериалы,
	|	Товары.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	Товары.Ссылка.Владелец КАК УзелНоменклатура,
	|	Товары.Ссылка.Характеристика КАК УзелХарактеристика
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка.Владелец = &номенклатура
	|	И Товары.Ссылка.Характеристика = &характеристика
	|	И (Товары.Ссылка.Основной
	|			ИЛИ Товары.Ссылка.ЭтоМатериалы)
	|	И НЕ Товары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Упаковка,
	|	Товары.Характеристика,
	|	Товары.ЭтоПолуфабрикат,
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	Товары.Ссылка.ЭтоМатериалы,
	|	Товары.Ссылка.Владелец,
	|	Товары.Ссылка.Характеристика,
	|	ВЫБОР
	|		КОГДА НЕ Товары.Ссылка.ЭтоМатериалы
	|			ТОГДА Товары.Ссылка.Основной
	|		ИНАЧЕ Товары.Ссылка.ОсобенностиКомплектацииПроект В (&мПроектПустой)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НЕ Товары.Ссылка.Основной,
	|	Товары.Ссылка.ПометкаУдаления";
	
	
	мПроектПустой = новый Массив;
	мПроектПустой.Добавить(неопределено);
	мПроектПустой.Добавить(Справочники.Проекты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("номенклатура", номенклатура);
	Запрос.УстановитьПараметр("характеристика", характеристика);
	Запрос.УстановитьПараметр("КоличествоКомплектов", Количество);
	Запрос.УстановитьПараметр("мПроектПустой", мПроектПустой);
	
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	ТаблицаКомплектующих.Колонки.Добавить("ПутьВСборке");
	ТаблицаКомплектующих.Колонки.Добавить("ПутьВСборкеНоменклатура");
	
	мСтрУдалить = новый Массив;	
	тчСоставПодСборок = ТаблицаКомплектующих.СкопироватьКолонки();
	
	Для Каждого Стр из ТаблицаКомплектующих Цикл		
		//мСтрУдалить.Добавить(стр);
		путьНаУзле = ПутьВСборке + ?(ЗначениеЗаполнено(ПутьВСборке), ".","") + Прав(1000+Стр.НомерСтроки, 3); 
		путьНаУзлеНоменклатура =  ПутьВСборкеНоменклатура + ?(ЗначениеЗаполнено(ПутьВСборкеНоменклатура), " \ ","") + Строка(Стр.УзелНоменклатура); 
		стр.ПутьВСборке = путьНаУзле;
		стр.ПутьВСборкеНоменклатура = путьНаУзлеНоменклатура;
		
		тчСостав = ПолучитьКомплектующиеНоменклатурыПолный(Стр.Номенклатура, Стр.Характеристика, стр.Количество, путьНаУзле, путьНаУзлеНоменклатура);
		Если тчСостав.Количество() > 0 Тогда
			АЛСАВ_Сборка.ЗагрузитьДанныеВТЧ(тчСоставПодСборок,тчСостав);
		КонецЕсли;		
	КонецЦикла;
	
	//Для Каждого СтрУдалить из мСтрУдалить Цикл
	//	ТаблицаКомплектующих.Удалить(СтрУдалить);
	//КонецЦикла;
	АЛСАВ_Сборка.ЗагрузитьДанныеВТЧ(ТаблицаКомплектующих,тчСоставПодСборок);
	
	//Если РаскрыватьПодСборки = Ложь Тогда
	//	ТаблицаКомплектующих.Колонки.Добавить("НомерСтроки");
	//	инд = 0;
	//	Для Каждого Стр из ТаблицаКомплектующих Цикл
	//		инд = инд + 1;
	//		Стр.НомерСтроки = инд;
	//	КонецЦИкла;
	//КонецЕсли;
	
	Возврат ТаблицаКомплектующих;

КонецФункции