Функция УстановитьЗначениеДопРеквизита(объект, имяРеквизита, значение) ЭКСПОРТ
	
	нСтр = неопределено;
	
	Для Каждого стр из объект.ДополнительныеРеквизиты Цикл
		Если стр.Свойство.Заголовок = ИмяРеквизита Тогда
			нСтр = стр;
		КонецЕсли;
	КонецЦикла;
	
	Если нСтр = неопределено Тогда
		нСтр = объект.ДополнительныеРеквизиты.Добавить();
		нСтр.Свойство = НайтиДопРеквизит(имяРеквизита);
	КонецЕсли;
	
	Если значение = неопределено Тогда
		объект.ДополнительныеРеквизиты.Удалить(нСтр);
	Иначе
		нСтр.Значение = значение;
	КонецЕсли;
КонецФункции


Функция УстановитьЗначениеДопСведения(объект, имяРеквизита, значение) ЭКСПОРТ
	допСведение = НайтиДопСведение(имяРеквизита);
	
	запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	
	запись.Объект = объект; 
	запись.Свойство = допСведение;
	запись.Значение = значение;
	
	запись.Записать(истина);
КонецФункции


Функция ПолучитьДопРеквизит(Ссылка, ИмяРеквизита)ЭКСПОРТ
	Если 1=2 Тогда Ссылка = Справочники.Партнеры.ПустаяСсылка(); КонецЕсли;
	
	Для Каждого стр из Ссылка.ДополнительныеРеквизиты Цикл
		Если стр.Свойство.Заголовок = ИмяРеквизита Тогда
			Возврат стр.Значение;
		КонецЕсли;
	КонецЦикла;
КонецФункции


Функция ПолучитьДопСведение(Ссылка, ИмяСведения)ЭКСПОРТ
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект = &Ссылка
	               |	И ДополнительныеСведения.Свойство.Заголовок = &ИмяСведения";
	Запрос.УстановитьПараметр("ИмяСведения",ИмяСведения);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Значение;
	КонецЕсли;
	
КонецФункции

Функция НайтиДопРеквизит(имяРеквизита) ЭКСПОРТ
	Результ = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	               |	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = Ложь";
	Запрос.УстановитьПараметр("Заголовок", имяРеквизита);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Результ = рез.Ссылка;
	КонецЕсли;
	
	Возврат Результ;
КонецФункции

Функция НайтиДопСведение(имяСведения)  ЭКСПОРТ
	Результ = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	               |	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	Запрос.УстановитьПараметр("Заголовок", имяСведения);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Результ = рез.Ссылка;
	КонецЕсли;
	
	Возврат Результ;
КонецФункции