
Функция ПолучитьОсновнуюКомплектацию(Номенклатура) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Владелец = &Номенклатура
	|	И Таблица.Основной
	|	И НЕ Таблица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Штрихкод(Номенклатура, характеристика)ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	MIN(Штрихкоды.Штрихкод) КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Номенклатура = &Номенклатура";
	
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Если ЗначениеЗаполнено(характеристика) Тогда
		Запрос.УстановитьПараметр("Характеристика",характеристика);
		ЗАпрос.Текст = ЗАпрос.Текст +" 
		|		И (Штрихкоды.Характеристика = &Характеристика) ";
	КонецЕсли;
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат Рез.Штрихкод;
	Конецесли;
		
КонецФункции

Функция ШтрихкодВнешний(Номенклатура, характеристика)ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	MAX(Штрихкоды.Штрихкод) КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Номенклатура = &Номенклатура";
	
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Если ЗначениеЗаполнено(характеристика) Тогда
		Запрос.УстановитьПараметр("Характеристика",характеристика);
		ЗАпрос.Текст = ЗАпрос.Текст +" 
		|		И (Штрихкоды.Характеристика = &Характеристика) ";
	КонецЕсли;
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат Рез.Штрихкод;
	Конецесли;
		
КонецФункции

Функция ПолучитьАртикул(Номенклатура, характеристика, контрагент)ЭКСПОРТ
	
	Если контрагент = неопределено или контрагент.ИНН = "7722753969" Тогда	
		наименованиеДопРеквизита = "ИКТ";
		допАртикул = алсав_ДопРеквизиты.ПолучитьДопРеквизит(характеристика, наименованиеДопРеквизита);
		возврат допАртикул;
	Иначе     
		возврат Номенклатура.Артикул;
	КонецЕсли;
КонецФункции



Функция Вес(Номенклатура, дажеДляСложного = ложь)Экспорт
	Если дажеДляСложного = Ложь Тогда
		компл = ПолучитьОсновнуюКомплектацию(Номенклатура);
		Если ЗначениеЗаполнено(компл) Тогда
			Возврат 0;	
		КонецЕсли;
	КонецЕсли;
	Возврат Справочники.Номенклатура.Вес(Номенклатура);
КонецФункции

Функция Объем(Номенклатура, дажеДлясложного = ложь)Экспорт
	Если дажеДляСложного = Ложь Тогда
		компл = ПолучитьОсновнуюКомплектацию(Номенклатура);
		Если ЗначениеЗаполнено(компл) Тогда
			Возврат 0;	
		КонецЕсли;
	КонецЕсли;
	Возврат Справочники.Номенклатура.Объем(Номенклатура);
КонецФункции


Функция ПолучитьТекстЗапросаДляСчета() ЭКСПОРТ
	Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ЗаказКлиента.Организация.Префикс КАК Префикс,
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
		|	ЗаказКлиента.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
		|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЗаказКлиента.Валюта КАК Валюта,
		|	ЗаказКлиента.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
		|	ЗаказКлиента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ЗаказКлиента.ЭтапыГрафикаОплаты.(
		|		НомерСтроки КАК НомерСтроки,
		|		ВариантОплаты КАК ВариантОплаты,
		|		ДатаПлатежа КАК ДатаПлатежа,
		|		ПроцентПлатежа КАК ПроцентПлатежа,
		|		СуммаПлатежа КАК СуммаПлатежа
		|	) КАК ЭтапыГрафикаОплаты,
		|	ЗаказКлиента.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.Код КАК Код,
		|		Номенклатура.Артикул КАК Артикул,
		|		ВЫБОР
		|			КОГДА ЗаказКлиента.Товары.Характеристика = """"
		|				ТОГДА ЗаказКлиента.Товары.Номенклатура.НаименованиеПолное
		|			ИНАЧЕ ЗаказКлиента.Товары.Номенклатура.НаименованиеПолное + "", "" + ЗаказКлиента.Товары.Характеристика.НаименованиеПолное
		|		КОНЕЦ КАК НаименованиеПолное,
		|		Цена КАК Цена,
		|		ЗаказКлиента.Товары.СуммаРучнойСкидки + ЗаказКлиента.Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
		|		ЗаказКлиента.Товары.Сумма + ЗаказКлиента.Товары.СуммаРучнойСкидки + ЗаказКлиента.Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
		|		Сумма КАК Сумма,
		|		СтавкаНДС КАК СтавкаНДС,
		|		СуммаНДС КАК СуммаНДС,
		|		ДатаОтгрузки КАК ДатаОтгрузки,
		|		Характеристика КАК Характеристика,
		|		Отменено КАК Отменено,
		|		ВЫБОР
		|			КОГДА ЗаказКлиента.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.Товары.Номенклатура.ЕдиницаИзмерения)
		|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.Товары.Упаковка.ЕдиницаИзмерения)
		|		КОНЕЦ КАК ЕдиницаИзмерения,
		|		Количество
		|	),
		|	ЗаказКлиента.Руководитель,
		|	ЗаказКлиента.ГлавныйБухгалтер,
		|	ЗаказКлиента.НалогообложениеНДС,
		|	ВЫБОР
		|		КОГДА ЗаказКлиента.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УчитыватьНДС
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента 
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
		
		
	Возврат Текст;
КонецФункции


////////////////////////////////////		V2		////////////////////////////////////////////////////

Функция СформироватьПечатнуюФормуСчетаСКомплектацией(Тип, МассивОбъектов, ОбъектыПечати, Макет, этоНекст = ЛОЖЬ, этоСчетДоговор = Ложь, выводитьШтрихКоды = ложь) ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = алсав_ПечатьСчет.ПолучитьТекстЗапросаДляСчета();

	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();	
	
	Пока ДанныеПечати.Следующий() Цикл
		
		//Макет = ПолучитьМакет("СчетНаОплату");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказКлиента_СчетНаОплату";
		
		ТаблицаЭтапыОплаты = ДанныеПечати.ЭтапыГрафикаОплаты.Выгрузить();
		ТаблицаТовары      = ДанныеПечати.Товары.Выгрузить();
		

		Если  ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
		ТОГДА НДС = Истина;	 
		ИНАЧЕ НДС=Ложь;
		КОНЕЦЕсли;
			
		СК = ?(ИспользоватьРучныеСкидки, Истина, ?(ИспользоватьАвтоматическиеСкидки, Истина, Ложь));
//		(ИспользоватьРучныеСкидки = ИСТИНА Или ИспользоватьАвтоматическиеСкидки = ИСТИНА)
		
	    ЕС  = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);	
		ЕстьСкидки  = ИСТИНА;//ЕС.ЕстьСкидки;
		ВыводитьКоды  = ЗначениеЗаполнено(КолонкаКодов);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДССоСкидкой");
		ИначеЕсли ЕстьСкидки Или (НДС И (НЕ этоНекст)) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДСИлиСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
			
		Если Не ВыводитьКоды Тогда
			
			//Если ЕстьСкидки И НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //*2
			//ИначеЕсли ЕстьСкидки Или НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //2;
			//Иначе
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //2;
			//КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
			
		ЗаполнитьРеквизитыШапкиСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, этоСчетДоговор);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			
			ОбластьКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
			
		КонецЕсли;
		
		ОбластьТовар.Параметры.Товар = НСтр("ru='Товары (работы, услуги)'");
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкойШтрихкод|ТоварСНДССоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ТоварСНДССоСкидкой");
			
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой2|ТоварСНДССоСкидкой");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ТоварСНДССоСкидкой");
			КонецПопытки;
			
			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкойШтрихкод|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварК2 = Макет.ПолучитьОбласть("КомплектацияСоСкидкой2|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварК2 = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;

			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДСШтрихкод|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСНДС|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСНДС|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСНДС|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДС2|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДС|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыШтрихкод|Товар");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("Комплектация|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("Комплектация|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("Комплектация|Товар");
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("Комплектация2|Товар");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("Комплектация|Товар");
			КонецПопытки;
			ОбластьДанныхК = Макет.ПолучитьОбласть("Комплектация|Данные");
			
		КонецЕсли;

		
		Сумма             = 0;
		СуммаНДС          = 0;
		ВсегоСкидок       = 0;
		ВсегоБезСкидок    = 0;
		ВсегоВес          = 0;
		ВсегоОбъем        = 0;
		НомерСтроки = 0;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			Если СтрокаТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				
				//ОбластьКодов.Параметры.Артикул = СтрокаТовары[КолонкаКодов];  
				ОбластьКодов.Параметры.Артикул = ПолучитьАртикул(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика, ДанныеПечати.Контрагент);
				ТабличныйДокумент.Присоединить(ОбластьКодов);
				
			КонецЕсли;
		
			
			Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное 
				+ ", " + СтрокаТовары.Характеристика.НаименованиеПолное; 
			Иначе
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное; 	
			КонецЕсли;	
			
			//НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			//СтрокаТовары.НаименованиеПолное,
			//СтрокаТовары.Характеристика); //СтрокаТовары.НаименованиеПолное; //ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаТовары.НаименованиеПолное, СтрокаТовары.Характеристика);
			
			
			
			Вар = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика);
			Если ЗначениеЗаполнено(Вар) Тогда
				ВесЧисло = 0;
				ОбъёмЧисло = 0;
			Иначе
				ВесЧисло = (алсав_ПечатьСчет.Вес(СтрокаТовары.Номенклатура) * (СтрокаТовары.Количество));
				ОбъёмЧисло = (алсав_ПечатьСчет.Объем(СтрокаТовары.Номенклатура) * (СтрокаТовары.Количество));
			КонецЕсли;
			
			параметрыОбласти = Новый Структура("Вес,Объем,Штрихкод, СуммаБезНДС");
			параметрыОбласти.Вес   = ВесЧисло;
			параметрыОбласти.Объем = ОбъёмЧисло;  
			параметрыОбласти.Штрихкод = Штрихкод(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика); 
			параметрыОбласти.СуммаБезНДС = СтрокаТовары.Сумма - СтрокаТовары.СуммаНДС;  
			
			ОбластьТовар.Параметры.Заполнить(параметрыОбласти);
			
			ОбластьДанных.Параметры.Заполнить(СтрокаТовары);
			ОбластьДанных.Параметры.Заполнить(параметрыОбласти);
			ОбластьДанных.Параметры.Количество = СтрокаТовары.Количество;
			ОбластьДанных.Параметры.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
			
			Если (выводитьШтрихКоды=истина) И (НЕ ЗначениеЗаполнено(Вар)) Тогда
				//ОбластьТовар.Параметры.Товар = "" + параметрыОбласти.Штрихкод + "   " +  ОбластьТовар.Параметры.Товар;
				ЗаполнитьЗначенияСвойств(ОбластьТоварШтрихкод.Параметры,ОбластьТовар.Параметры);
				ОбластьТоварШтрихкод.Параметры.Заполнить(параметрыОбласти);
				ТабличныйДокумент.Присоединить(ОбластьТоварШтрихкод);
			Иначе
				ТабличныйДокумент.Присоединить(ОбластьТовар);				
			Конецесли;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + СтрокаТовары.Сумма;
			СуммаНДС       = СуммаНДС       + СтрокаТовары.СуммаНДС;
			ВсегоВес          = ВсегоВес    + ВесЧисло ;
		    ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + СтрокаТовары.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
			КонецЕсли;
			

			вариантКомплектации = Вар;
			Если ЗначениеЗаполнено(вариантКомплектации) Тогда
				тчСостав = АЛСАВ_Сборка.ПолучитьКомплектующиеНоменклатуры(
					вариантКомплектации,
					,
					строкаТовары.Количество,
					Ложь
				);
				кк = 0;
				уровень = 1;
				Для Каждого стр из тчСостав Цикл
					//итогоКоличество = итогоКоличество + вывестиСтрокуТовары(стр,тд, текНомерСтроки, уровень + 1)
					//кк = кк + 1;        
					//текНомерСтроки = ""+НомерСтроки+"."+кк;
					текНомерСтроки = ""+НомерСтроки;
					весОбъем = вывестиСтрокуТовары(стр, ТабличныйДокумент, текНомерСтроки, уровень, ДанныеПечати, ВыводитьКоды, выводитьШтрихКоды, ОбластьНомераК, ОбластьТоварК2, ОбластьДанныхК, ОбластьКодовК);
					
					ВсегоВес          = ВсегоВес    + весОбъем.Вес ;
		    		ВсегоОбъем        = ВсегоОбъем  + весОбъем.Объем;
				КонецЦикла;			
			КонецЕсли;	
				
				
		КонецЦикла;
			
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		параметрыОбласти = Новый Структура("ВсегоВес,ВсегоОбъем");
		параметрыОбласти.ВсегоВес   = ВсегоВес;
		параметрыОбласти.ВсегоОбъем = ВсегоОбъем;  
		ОбластьТовар.Параметры.Заполнить(параметрыОбласти);
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		
		параметрыОбласти = Новый Структура("ВсегоСкидок,ВсегоСуммаНДС,ВсегоБезСкидок,ВсегоСуммаСНДС",ВсегоСкидок,СуммаНДС,ВсегоБезСкидок, Сумма - СуммаНДС);
		ОбластьДанных.Параметры.Заполнить(параметрыОбласти);		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		СоответствиеСтавокНДС = ФормированиеПечатныхФорм.СоответствиеСтавокИСуммНДС(); 
		
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
		
		Если НДС Тогда
			
			Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("СтавкаНДС", ТекСтавкаНДС.Ключ);
				ПараметрыОтбора.Вставить("Отменено",  Ложь);
				НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТаблицаТоварыНДС = ТаблицаТовары.Скопировать(НайденныеСтроки, "СуммаНДС");
					ТаблицаТоварыНДС.Свернуть(,"СуммаНДС");
					СоответствиеСтавокНДС.Вставить(ТекСтавкаНДС.Ключ, ТаблицаТоварыНДС[0].СуммаНДС);
					
					ТабличныйДокумент.Вывести(ОбластьНомера);
					
					Если ВыводитьКоды Тогда
						ТабличныйДокумент.Присоединить(ОбластьКодов);
					КонецЕсли;
					
					ТабличныйДокумент.Присоединить(ОбластьТовар);
					
					ОбластьДанных.Параметры.Заполнить(Новый Структура(
						"НДС,ВсегоНДС",
						ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС),
						ФормированиеПечатныхФорм.ФорматСумм(ТаблицаТоварыНДС[0].СуммаНДС, ,"-")
					));
					
					ТабличныйДокумент.Присоединить(ОбластьДанных);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ТабличныйДокумент.Вывести(ОбластьНомера);
			Если ВыводитьКоды Тогда
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			Попытка
				ОбластьДанных.Параметры.НДС = НСтр("ru='Без налога (НДС)'");
			Исключение
				ОбластьДанных.Параметры.ВсегоНДС = НСтр("ru='Без налога (НДС)'");
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьДанных);
		КонецЕсли;
		
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		Если Тип = "СчетКВозврату" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюКВозврату");
			СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
			СуммаИтого = СуммаКПрописи-СуммаКВозврату;
			Если СуммаИтого < 0 Тогда
				СуммаИтого = 0;
			КонецЕсли;
			ОбластьМакета.Параметры.СуммаВозврата = ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта);
			ОбластьМакета.Параметры.СуммаИтогоКОплате = ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ЗаполнитьРеквизитыПодвалаСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС,этоСчетДоговор);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 


Функция вывестиСтрокуТовары(строкаТовары, ТабличныйДокумент, НомерСтроки, уровень, ДанныеПечати, ВыводитьКоды, выводитьШтрихКоды, ОбластьНомераК, ОбластьТоварК2, ОбластьДанныхК, ОбластьКодовК)
	резалт = новый Структура("Вес, Объем", 0.0, 0.0);
	стрК1 = строкаТовары;  
	
	текНомерСтроки = ?(ЗначениеЗаполнено(номерСтроки),
		номерСтроки+"."+строкаТовары.НомерСтроки,
		Строка(строкаТовары.НомерСтроки)
	);
                           	
	ОбластьНомераК.Параметры.НомерСтроки = текНомерСтроки;
	ТабличныйДокумент.Вывести(ОбластьНомераК);
	
	Если ВыводитьКоды Тогда
		
		//ОбластьКодовК.Параметры.Артикул = СтрК1.Номенклатура.Артикул;;
		ОбластьКодовК.Параметры.Артикул = ПолучитьАртикул(СтрК1.Номенклатура,СтрК1.Характеристика, ДанныеПечати.Контрагент);
		ТабличныйДокумент.Присоединить(ОбластьКодовК);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрК1.Характеристика) Тогда
		ОбластьТоварК2.Параметры.Товар = стрК1.Номенклатура.НаименованиеПолное 
		+ ", " + стрК1.Характеристика.НаименованиеПолное; 
	Иначе
		ОбластьТоварК2.Параметры.Товар = стрК1.Номенклатура.НаименованиеПолное; 	
	КонецЕсли;								НоменклатураСсылка = стрК1.Номенклатура;
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		//ВесЧисло = (алсав_ПечатьСчет.Вес(НоменклатураСсылка) * (СтрК1.Количество * СтрК.Количество * СтрокаТовары.Количество));
		//ОбъёмЧисло = (алсав_ПечатьСчет.Объем(НоменклатураСсылка) * (СтрК1.Количество * СтрК.Количество * СтрокаТовары.Количество));		
		//ВсегоВес          = ВсегоВес    + ВесЧисло ;
		//ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;
		
		ВесЧисло = (алсав_ПечатьСчет.Вес(НоменклатураСсылка) * (СтрК1.Количество) );
		ОбъёмЧисло = (алсав_ПечатьСчет.Объем(НоменклатураСсылка) * (СтрК1.Количество) );
		
		резалт.Вес = ВесЧисло;
		резалт.Объем = ОбъёмЧисло;
		
		параметрыОбласти = Новый Структура("Вес,Объем,Штрихкод");
		параметрыОбласти.Вес   = ВесЧисло;
		параметрыОбласти.Объем = ОбъёмЧисло;  
		параметрыОбласти.Штрихкод = Штрихкод(стрК1.Номенклатура,стрК1.Характеристика);
		ОбластьТоварК2.Параметры.Заполнить(параметрыОбласти);

		Если выводитьШтрихКоды=истина Тогда
			//ОбластьТоварК2.Параметры.Товар = "" + параметрыОбласти.Штрихкод + "   " +  ОбластьТоварК2.Параметры.Товар;
		Конецесли;
	КонецЕсли;
	
	ТабличныйДокумент.Присоединить(ОбластьТоварК2);
	
	ОбластьДанныхК.Параметры.Количество = СтрК1.Количество;
	ОбластьДанныхК.Параметры.ЕдиницаИзмерения = СтрК1.Номенклатура.ЕдиницаИзмерения;
	ТабличныйДокумент.Присоединить(ОбластьДанныхК); 
	
	////////////////////////////
	вариантКомплектации=Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(строкаТовары.Номенклатура, строкаТовары.Характеристика);
	
	Если ЗначениеЗаполнено(вариантКомплектации) Тогда
		тчСостав = АЛСАВ_Сборка.ПолучитьКомплектующиеНоменклатуры(
			вариантКомплектации,
			,
			строкаТовары.Количество,
			Ложь
		);
		Для Каждого стр из тчСостав Цикл
			//итогоКоличество = итогоКоличество + вывестиСтрокуТовары(стр,тд, текНомерСтроки, уровень + 1)
			промРезалт = вывестиСтрокуТовары(стр, ТабличныйДокумент, текНомерСтроки, уровень, ДанныеПечати, ВыводитьКоды, выводитьШтрихКоды, ОбластьНомераК, ОбластьТоварК2, ОбластьДанныхК, ОбластьКодовК);
			
			резалт.Вес = резалт.Вес + промРезалт.Вес;
			резалт.Объем = резалт.Объем + промРезалт.Объем;
		КонецЦикла;
	КонецЕсли;
	////////////////////////////
	Возврат резалт;
КонецФункции


////////////////////////////////////		V2		////////////////////////////////////////////////////


Функция СформироватьПечатнуюФормуСчетаСКомплектацией_OLD(Тип, МассивОбъектов, ОбъектыПечати, Макет, этоНекст = ЛОЖЬ, этоСчетДоговор = Ложь, выводитьШтрихКоды = ложь) ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = алсав_ПечатьСчет.ПолучитьТекстЗапросаДляСчета();

	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();	
	
	Пока ДанныеПечати.Следующий() Цикл
		
		//Макет = ПолучитьМакет("СчетНаОплату");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказКлиента_СчетНаОплату";
		
		ТаблицаЭтапыОплаты = ДанныеПечати.ЭтапыГрафикаОплаты.Выгрузить();
		ТаблицаТовары      = ДанныеПечати.Товары.Выгрузить();
		

		Если  ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
		ТОГДА НДС = Истина;	 
		ИНАЧЕ НДС=Ложь;
		КОНЕЦЕсли;
			
		СК = ?(ИспользоватьРучныеСкидки, Истина, ?(ИспользоватьАвтоматическиеСкидки, Истина, Ложь));
//		(ИспользоватьРучныеСкидки = ИСТИНА Или ИспользоватьАвтоматическиеСкидки = ИСТИНА)
		
	    ЕС  = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);	
		ЕстьСкидки  = ИСТИНА;//ЕС.ЕстьСкидки;
		ВыводитьКоды  = ЗначениеЗаполнено(КолонкаКодов);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДССоСкидкой");
		ИначеЕсли ЕстьСкидки Или (НДС И (НЕ этоНекст)) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДСИлиСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
			
		Если Не ВыводитьКоды Тогда
			
			//Если ЕстьСкидки И НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //*2
			//ИначеЕсли ЕстьСкидки Или НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //2;
			//Иначе
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки +12; //2;
			//КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
			
		ЗаполнитьРеквизитыШапкиСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, этоСчетДоговор);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			
			ОбластьКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
			
		КонецЕсли;
		
		ОбластьТовар.Параметры.Товар = НСтр("ru='Товары (работы, услуги)'");
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкойШтрихкод|ТоварСНДССоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ТоварСНДССоСкидкой");
			
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой2|ТоварСНДССоСкидкой");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ТоварСНДССоСкидкой");
			КонецПопытки;
			
			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкойШтрихкод|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварК2 = Макет.ПолучитьОбласть("КомплектацияСоСкидкой2|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварК2 = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;

			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДСШтрихкод|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("КомплектацияСНДС|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("КомплектацияСНДС|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("КомплектацияСНДС|ТоварСНДСИлиСоСкидкой");
			
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДС2|ТоварСНДСИлиСоСкидкой");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("КомплектацияСНДС|ТоварСНДСИлиСоСкидкой");
			КонецПопытки;
			
			ОбластьДанныхК = Макет.ПолучитьОбласть("КомплектацияСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			
			Попытка
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицыШтрихкод|Товар");
			Исключение
				ОбластьТоварШтрихкод  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			КонецПопытки;
			
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
			ОбластьНомераК = Макет.ПолучитьОбласть("Комплектация|НомерСтроки");
			ОбластьКодовК  = Макет.ПолучитьОбласть("Комплектация|КолонкаКодов");
			ОбластьТоварК  = Макет.ПолучитьОбласть("Комплектация|Товар");
			Попытка
				ОбластьТоварК2  = Макет.ПолучитьОбласть("Комплектация2|Товар");
			Исключение
				ОбластьТоварК2  = Макет.ПолучитьОбласть("Комплектация|Товар");
			КонецПопытки;
			ОбластьДанныхК = Макет.ПолучитьОбласть("Комплектация|Данные");
			
		КонецЕсли;

		
		Сумма             = 0;
		СуммаНДС          = 0;
		ВсегоСкидок       = 0;
		ВсегоБезСкидок    = 0;
		ВсегоВес          = 0;
		ВсегоОбъем        = 0;
		НомерСтроки = 0;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			Если СтрокаТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				
				//ОбластьКодов.Параметры.Артикул = СтрокаТовары[КолонкаКодов];  
				ОбластьКодов.Параметры.Артикул = ПолучитьАртикул(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика, ДанныеПечати.Контрагент);
				ТабличныйДокумент.Присоединить(ОбластьКодов);
				
			КонецЕсли;
		
			
			Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное 
				+ ", " + СтрокаТовары.Характеристика.НаименованиеПолное; 
			Иначе
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное; 	
			КонецЕсли;	
			
			//НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			//СтрокаТовары.НаименованиеПолное,
			//СтрокаТовары.Характеристика); //СтрокаТовары.НаименованиеПолное; //ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаТовары.НаименованиеПолное, СтрокаТовары.Характеристика);
			
			
			
			Вар = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика);
			Если ЗначениеЗаполнено(Вар) Тогда
				ВесЧисло = 0;
				ОбъёмЧисло = 0;
			Иначе
				ВесЧисло = (алсав_ПечатьСчет.Вес(СтрокаТовары.Номенклатура) * (СтрокаТовары.Количество));
				ОбъёмЧисло = (алсав_ПечатьСчет.Объем(СтрокаТовары.Номенклатура) * (СтрокаТовары.Количество));
			КонецЕсли;
			
			параметрыОбласти = Новый Структура("Вес,Объем,Штрихкод, СуммаБезНДС");
			параметрыОбласти.Вес   = ВесЧисло;
			параметрыОбласти.Объем = ОбъёмЧисло;  
			параметрыОбласти.Штрихкод = Штрихкод(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика); 
			параметрыОбласти.СуммаБезНДС = СтрокаТовары.Сумма - СтрокаТовары.СуммаНДС;  
			
			ОбластьТовар.Параметры.Заполнить(параметрыОбласти);
			
			ОбластьДанных.Параметры.Заполнить(СтрокаТовары);
			ОбластьДанных.Параметры.Заполнить(параметрыОбласти);
			ОбластьДанных.Параметры.Количество = СтрокаТовары.Количество;
			ОбластьДанных.Параметры.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
			
			Если (выводитьШтрихКоды=истина) И (НЕ ЗначениеЗаполнено(Вар)) Тогда
				//ОбластьТовар.Параметры.Товар = "" + параметрыОбласти.Штрихкод + "   " +  ОбластьТовар.Параметры.Товар;
				ЗаполнитьЗначенияСвойств(ОбластьТоварШтрихкод.Параметры,ОбластьТовар.Параметры);
				ОбластьТоварШтрихкод.Параметры.Заполнить(параметрыОбласти);
				ТабличныйДокумент.Присоединить(ОбластьТоварШтрихкод);
			Иначе
				ТабличныйДокумент.Присоединить(ОбластьТовар);				
			Конецесли;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + СтрокаТовары.Сумма;
			СуммаНДС       = СуммаНДС       + СтрокаТовары.СуммаНДС;
			ВсегоВес          = ВсегоВес    + ВесЧисло ;
		    ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + СтрокаТовары.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
			КонецЕсли;
			

			Если ЗначениеЗаполнено(Вар) Тогда			
				
				кк=0;
				Для каждого стрК из Вар.Товары Цикл
					
					кк=кк+1;
					ОбластьНомераК.Параметры.НомерСтроки = ""+НомерСтроки+"."+кк;
					ТабличныйДокумент.Вывести(ОбластьНомераК);
					
					Если ВыводитьКоды Тогда
						
						//ОбластьКодовК.Параметры.Артикул = СтрК.Номенклатура.Артикул;;
						ОбластьКодовК.Параметры.Артикул = ПолучитьАртикул(СтрК.Номенклатура,СтрК.Характеристика, ДанныеПечати.Контрагент);
						ТабличныйДокумент.Присоединить(ОбластьКодовК);
						
					КонецЕсли;
				
					Если ЗначениеЗаполнено(стрК.Характеристика) Тогда
						ОбластьТоварК.Параметры.Товар = стрК.Номенклатура.НаименованиеПолное 
						+ ", " + стрК.Характеристика.НаименованиеПолное; 
					Иначе
						ОбластьТоварК.Параметры.Товар = стрК.Номенклатура.НаименованиеПолное; 	
					КонецЕсли;					
					НоменклатураСсылка = стрК.Номенклатура;
					
					Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
						ВесЧисло = (алсав_ПечатьСчет.Вес(НоменклатураСсылка) * (СтрК.Количество * СтрокаТовары.Количество));
						ОбъёмЧисло = (алсав_ПечатьСчет.Объем(НоменклатураСсылка) * (СтрК.Количество * СтрокаТовары.Количество));
						
						ВсегоВес          = ВсегоВес    + ВесЧисло ;
		    			ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;

						параметрыОбласти = Новый Структура("Вес,Объем,Штрихкод");
						параметрыОбласти.Вес   = ВесЧисло;
						параметрыОбласти.Объем = ОбъёмЧисло;  
						параметрыОбласти.Штрихкод = Штрихкод(стрК.Номенклатура,стрК.Характеристика); 
						ОбластьТоварК.Параметры.Заполнить(параметрыОбласти); 
					КонецЕсли; 			
					 					
					
					
					ОбластьДанныхК.Параметры.Количество = СтрК.Количество*СтрокаТовары.Количество;
					ОбластьДанныхК.Параметры.ЕдиницаИзмерения = СтрК.Номенклатура.ЕдиницаИзмерения;
					
					//КОМПЛЕКТАЦИЯ_2
					Вар1=Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(СтрК.ВариантКомлектации.Владелец,СтрК.ВариантКомлектации.Характеристика);
					
					Если (выводитьШтрихКоды=истина) И (НЕ ЗначениеЗаполнено(Вар1))И (ЗначениеЗаполнено(НоменклатураСсылка)) Тогда
						//ОбластьТоварК.Параметры.Товар = "" + параметрыОбласти.Штрихкод + "   " +  ОбластьТоварК.Параметры.Товар;
						ЗаполнитьЗначенияСвойств(ОбластьТоварК2.Параметры,ОбластьТоварК.Параметры);
						ОбластьТоварК2.Параметры.Заполнить(параметрыОбласти);
						ТабличныйДокумент.Присоединить(ОбластьТоварК2);
					Иначе
						ТабличныйДокумент.Присоединить(ОбластьТоварК);
					Конецесли;
					
					ТабличныйДокумент.Присоединить(ОбластьДанныхК);
					
					Если ЗначениеЗаполнено(Вар1) Тогда
						
						кк2=0;
						Для каждого стрК1 из Вар1.Товары Цикл
							кк2=кк2+1;
							ОбластьНомераК.Параметры.НомерСтроки = ""+НомерСтроки+"."+кк+"."+кк2;
							ТабличныйДокумент.Вывести(ОбластьНомераК);
							
							Если ВыводитьКоды Тогда
								
								//ОбластьКодовК.Параметры.Артикул = СтрК1.Номенклатура.Артикул;;
								ОбластьКодовК.Параметры.Артикул = ПолучитьАртикул(СтрК1.Номенклатура,СтрК1.Характеристика, ДанныеПечати.Контрагент);
								ТабличныйДокумент.Присоединить(ОбластьКодовК);
								
							КонецЕсли;
							
							Если ЗначениеЗаполнено(стрК1.Характеристика) Тогда
								ОбластьТоварК2.Параметры.Товар = стрК1.Номенклатура.НаименованиеПолное 
								+ ", " + стрК1.Характеристика.НаименованиеПолное; 
							Иначе
								ОбластьТоварК2.Параметры.Товар = стрК1.Номенклатура.НаименованиеПолное; 	
							КонецЕсли;								НоменклатураСсылка = стрК1.Номенклатура;
							Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
								ВесЧисло = (алсав_ПечатьСчет.Вес(НоменклатураСсылка) * (СтрК1.Количество * СтрК.Количество * СтрокаТовары.Количество));
								ОбъёмЧисло = (алсав_ПечатьСчет.Объем(НоменклатураСсылка) * (СтрК1.Количество * СтрК.Количество * СтрокаТовары.Количество));
								
								ВсегоВес          = ВсегоВес    + ВесЧисло ;
				    			ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;

								параметрыОбласти = Новый Структура("Вес,Объем,Штрихкод");
								параметрыОбласти.Вес   = ВесЧисло;
								параметрыОбласти.Объем = ОбъёмЧисло;  
								параметрыОбласти.Штрихкод = Штрихкод(стрК1.Номенклатура,стрК1.Характеристика);
								ОбластьТоварК2.Параметры.Заполнить(параметрыОбласти);

								Если выводитьШтрихКоды=истина Тогда
									//ОбластьТоварК2.Параметры.Товар = "" + параметрыОбласти.Штрихкод + "   " +  ОбластьТоварК2.Параметры.Товар;
								Конецесли;
							КонецЕсли;
							
							ТабличныйДокумент.Присоединить(ОбластьТоварК2);
							
							ОбластьДанныхК.Параметры.Количество = СтрК1.Количество*СтрК.Количество*СтрокаТовары.Количество;
							ОбластьДанныхК.Параметры.ЕдиницаИзмерения = СтрК1.Номенклатура.ЕдиницаИзмерения;
							ТабличныйДокумент.Присоединить(ОбластьДанныхК);
							
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;	

		КонецЦикла;
			
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		параметрыОбласти = Новый Структура("ВсегоВес,ВсегоОбъем");
		параметрыОбласти.ВсегоВес   = ВсегоВес;
		параметрыОбласти.ВсегоОбъем = ВсегоОбъем;  
		ОбластьТовар.Параметры.Заполнить(параметрыОбласти);
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		
		параметрыОбласти = Новый Структура("ВсегоСкидок,ВсегоСуммаНДС,ВсегоБезСкидок,ВсегоСуммаСНДС",ВсегоСкидок,СуммаНДС,ВсегоБезСкидок, Сумма - СуммаНДС);
		ОбластьДанных.Параметры.Заполнить(параметрыОбласти);		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		СоответствиеСтавокНДС = ФормированиеПечатныхФорм.СоответствиеСтавокИСуммНДС(); 
		
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
		
		Если НДС Тогда
			
			Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("СтавкаНДС", ТекСтавкаНДС.Ключ);
				ПараметрыОтбора.Вставить("Отменено",  Ложь);
				НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТаблицаТоварыНДС = ТаблицаТовары.Скопировать(НайденныеСтроки, "СуммаНДС");
					ТаблицаТоварыНДС.Свернуть(,"СуммаНДС");
					СоответствиеСтавокНДС.Вставить(ТекСтавкаНДС.Ключ, ТаблицаТоварыНДС[0].СуммаНДС);
					
					ТабличныйДокумент.Вывести(ОбластьНомера);
					
					Если ВыводитьКоды Тогда
						ТабличныйДокумент.Присоединить(ОбластьКодов);
					КонецЕсли;
					
					ТабличныйДокумент.Присоединить(ОбластьТовар);
					
					ОбластьДанных.Параметры.Заполнить(Новый Структура(
						"НДС,ВсегоНДС",
						ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС),
						ФормированиеПечатныхФорм.ФорматСумм(ТаблицаТоварыНДС[0].СуммаНДС, ,"-")
					));
					
					ТабличныйДокумент.Присоединить(ОбластьДанных);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ТабличныйДокумент.Вывести(ОбластьНомера);
			Если ВыводитьКоды Тогда
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			Попытка
				ОбластьДанных.Параметры.НДС = НСтр("ru='Без налога (НДС)'");
			Исключение
				ОбластьДанных.Параметры.ВсегоНДС = НСтр("ru='Без налога (НДС)'");
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьДанных);
		КонецЕсли;
		
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		Если Тип = "СчетКВозврату" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюКВозврату");
			СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
			СуммаИтого = СуммаКПрописи-СуммаКВозврату;
			Если СуммаИтого < 0 Тогда
				СуммаИтого = 0;
			КонецЕсли;
			ОбластьМакета.Параметры.СуммаВозврата = ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта);
			ОбластьМакета.Параметры.СуммаИтогоКОплате = ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ЗаполнитьРеквизитыПодвалаСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС,этоСчетДоговор);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 




Функция СформироватьПечатнуюФормуСчета(Тип, МассивОбъектов, ОбъектыПечати, Макет, этоНекст = ЛОЖЬ, этоСчетДоговор = Ложь ) ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = алсав_ПечатьСчет.ПолучитьТекстЗапросаДляСчета();
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	Пока ДанныеПечати.Следующий() Цикл
		
		//Макет = ПолучитьМакет("СчетНаОплату");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказКлиента_СчетНаОплату";
		
		ТаблицаЭтапыОплаты = ДанныеПечати.ЭтапыГрафикаОплаты.Выгрузить();
		ТаблицаТовары      = ДанныеПечати.Товары.Выгрузить();
		

		Если  ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
		ТОГДА НДС = Истина;	 
		ИНАЧЕ НДС=Ложь;
		КОНЕЦЕсли;		
		
	
		СК = ?(ИспользоватьРучныеСкидки, Истина, ?(ИспользоватьАвтоматическиеСкидки, Истина, Ложь));
//		(ИспользоватьРучныеСкидки = ИСТИНА Или ИспользоватьАвтоматическиеСкидки = ИСТИНА)
		
	    ЕС  = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);	
		ЕстьСкидки  =ЕС.ЕстьСкидки;
		ВыводитьКоды  = ЗначениеЗаполнено(КолонкаКодов);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДССоСкидкой");
		ИначеЕсли ЕстьСкидки Или (НДС И (НЕ этоНекст)) Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСНДСИлиСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
			
		Если Не ВыводитьКоды Тогда
			
			//Если ЕстьСкидки И НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.30*4/3; //*2
			//ИначеЕсли ЕстьСкидки Или НДС Тогда
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.10*4/3; //2;
			//Иначе
			//	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 2; //2;
			//КонецЕсли;

			
		КонецЕсли;
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
			
		ЗаполнитьРеквизитыШапкиСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, этоСчетДоговор);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			
			ОбластьКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
			
		КонецЕсли;
		
		ОбластьТовар.Параметры.Товар = НСтр("ru='Товары (работы, услуги)'");
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
		КонецЕсли;
		
		Сумма             = 0;
		СуммаНДС          = 0;
		ВсегоСкидок       = 0;
		ВсегоБезСкидок    = 0;
		ВсегоВес          = 0;
		ВсегоОбъем        = 0;
		НомерСтроки = 0;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			Если СтрокаТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				
				//ОбластьКодов.Параметры.Артикул = СтрокаТовары[КолонкаКодов];
				ОбластьКодов.Параметры.Артикул = ПолучитьАртикул(СтрокаТовары.Номенклатура,СтрокаТовары.Характеристика, ДанныеПечати.Контрагент);
				ТабличныйДокумент.Присоединить(ОбластьКодов);
				
			КонецЕсли;
		
			
			Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное 
				+ ", " + СтрокаТовары.Характеристика.НаименованиеПолное; 
			Иначе
				ОбластьТовар.Параметры.Товар = СтрокаТовары.Номенклатура.НаименованиеПолное; 	
			КонецЕсли;	
			
			НоменклатураСсылка = СтрокаТовары.Номенклатура;
			ВесЧисло = (алсав_ПечатьСчет.Вес(НоменклатураСсылка, истина)*(СтрокаТовары.Количество));
			ОбъёмЧисло = (алсав_ПечатьСчет.Объем(НоменклатураСсылка, истина)*(СтрокаТовары.Количество));
			структураВесОбъем = Новый Структура("Вес,Объем",ВесЧисло,ОбъёмЧисло);
			
			//ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаТовары.НаименованиеПолное, СтрокаТовары.Характеристика);
			ЗаполнитьЗначенияСвойств(ОбластьТовар.Параметры,структураВесОбъем);
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(СтрокаТовары);
			//ОбластьДанных.Параметры.Количество = СтрокаТовары.Количество;
			//ОбластьДанных.Параметры.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
			ЗаполнитьЗначенияСвойств( ОбластьДанных.Параметры, структураВесОбъем );
			ЗаполнитьЗначенияСвойств( ОбластьДанных.Параметры, Новый Структура("СуммаБезНДС", СтрокаТовары.Сумма - СтрокаТовары.СуммаНДС));
			            
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + СтрокаТовары.Сумма;
			СуммаНДС       = СуммаНДС       + СтрокаТовары.СуммаНДС;
			ВсегоВес          = ВсегоВес    + ВесЧисло;
			ВсегоОбъем        = ВсегоОбъем  + ОбъёмЧисло;

			ВсегоСкидок    = ВсегоСкидок    + СтрокаТовары.СуммаСкидки;
			ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
			
		
		КонецЦикла;
		
		Если ЕстьСкидки И НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ТоварСНДССоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДССоСкидкой|ДанныеСНДССоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
		
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСНДСИлиСоСкидкой");
			
		ИначеЕсли НДС И (НЕ этоНекст) Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ТоварСНДСИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСНДС|ДанныеСНДСИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		структураВесОбъем = Новый Структура( "ВсегоВес,ВсегоОбъем", ВсегоВес,ВсегоОбъем );
		структураСуммы = Новый Структура( "ВсегоСкидок,ВсегоБезСкидок,СуммаНДС, ВсегоСуммаБезНДС", ВсегоСкидок,ВсегоБезСкидок,СуммаНДС, Сумма - СуммаНДС );


		ОбластьТовар.Параметры.Заполнить(структураВесОбъем);		
		ОбластьТовар.Параметры.Заполнить(структураСуммы);
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		
		ОбластьДанных.Параметры.Заполнить(структураВесОбъем);
		ОбластьДанных.Параметры.Заполнить(структураСуммы);
		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		СоответствиеСтавокНДС = ФормированиеПечатныхФорм.СоответствиеСтавокИСуммНДС();
		
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
		
		Если НДС Тогда

			
			Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("СтавкаНДС", ТекСтавкаНДС.Ключ);
				ПараметрыОтбора.Вставить("Отменено",  Ложь);
				НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТаблицаТоварыНДС = ТаблицаТовары.Скопировать(НайденныеСтроки, "СуммаНДС");
					ТаблицаТоварыНДС.Свернуть(,"СуммаНДС");
					СоответствиеСтавокНДС.Вставить(ТекСтавкаНДС.Ключ, ТаблицаТоварыНДС[0].СуммаНДС);
					
					ТабличныйДокумент.Вывести(ОбластьНомера);
					
					Если ВыводитьКоды Тогда
						ТабличныйДокумент.Присоединить(ОбластьКодов);
					КонецЕсли;
					
					ТабличныйДокумент.Присоединить(ОбластьТовар);
					
					ОбластьДанных.Параметры.Заполнить( Новый Структура(
						"НДС,ВсегоНДС",
						ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС),
						ФормированиеПечатныхФорм.ФорматСумм(ТаблицаТоварыНДС[0].СуммаНДС, ,"-")
					)); 
					
					ТабличныйДокумент.Присоединить(ОбластьДанных);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ТабличныйДокумент.Вывести(ОбластьНомера);
			Если ВыводитьКоды Тогда
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			Попытка
				ОбластьДанных.Параметры.НДС = НСтр("ru='Без налога (НДС)'");
			Исключение
				ОбластьДанных.Параметры.ВсегоНДС = НСтр("ru='Без налога (НДС)'");
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьДанных);
		КонецЕсли;
		
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		Если Тип = "СчетКВозврату" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюКВозврату");
			СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
			СуммаИтого = СуммаКПрописи-СуммаКВозврату;
			Если СуммаИтого < 0 Тогда
				СуммаИтого = 0;
			КонецЕсли;
			ОбластьМакета.Параметры.СуммаВозврата = ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта);
			ОбластьМакета.Параметры.СуммаИтогоКОплате = ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ЗаполнитьРеквизитыПодвалаСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС,этоСчетДоговор);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьРеквизитыШапкиСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, этоСчетДоговор)
	
	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	Если Тип = "Счет" ИЛИ Тип = "СчетКВозврату" Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
		
		//Если ТаблицаЭтапыОплаты.Количество() = 0 Тогда
		//	ДатаПлатежа = '00010101';
		//ИначеЕсли ТаблицаЭтапыОплаты.Количество() = 1 Тогда
		//	ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
		//Иначе
		//	ТаблицаЭтапыОплаты.Сортировать("ДатаПлатежа Убыв");
		//	ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
		//КонецЕсли;
		//	
		//Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
		//	
		//	НадписьСрокДействия = НСтр("ru='Счет действителен до %СрокДействия%. '");
		//	НадписьСрокДействия = СтрЗаменить(НадписьСрокДействия, "%СрокДействия%", Формат(ДатаПлатежа, "ДЛФ=D"));
		//	ОбластьМакета.Параметры.СрокДействия = НадписьСрокДействия;
		//	
		//КонецЕсли;
		
		ОбластьМакета.Параметры.ИНН             = СведенияОПоставщике.ИНН;
		ОбластьМакета.Параметры.КПП             = СведенияОПоставщике.КПП;
		ПредставлениеПоставщикаДляПлатПоручения = "";
		
		//Если ЗначениеЗаполнено(СведенияОПоставщике.Банк) Тогда
		//	
		//	Банк = ?(ЗначениеЗаполнено(СведенияОПоставщике.Банк.БанкДляРасчетов),
		//		СведенияОПоставщике.Банк.БанкДляРасчетов,
		//		СведенияОПоставщике.Банк.Банк
		//	);
		//	БИК        = Банк.Код;
		//	КоррСчет   = Банк.КоррСчет;
		//	ГородБанка = Банк.Город;
		//	НомерСчета = ?(ЗначениеЗаполнено(СведенияОПоставщике.Банк.БанкДляРасчетов),
		//		СведенияОПоставщике.Банк.КоррСчет,
		//		СведенияОПоставщике.Банк.НомерСчета
		//	);
		//	
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = СведенияОПоставщике.БИК;
			ОбластьМакета.Параметры.БанкПолучателя                   = СведенияОПоставщике.Банк;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(СведенияОПоставщике.Банк);
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = СведенияОПоставщике.КоррСчет;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = СведенияОПоставщике.КоррСчет;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = СведенияОПоставщике.НомерСчета;
			ОбластьМакета.Параметры.СчетПолучателя                   = СведенияОПоставщике.НомерСчета;
			
			Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
				реквизитыСчета = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ДанныеПечати.БанковскийСчет);
				
				ОбластьМакета.Параметры.БИКБанкаПолучателя               = реквизитыСчета.БИК;
				ОбластьМакета.Параметры.БанкПолучателя                   = реквизитыСчета.Банк;
				ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(реквизитыСчета.Банк);
				ОбластьМакета.Параметры.СчетБанкаПолучателя              = реквизитыСчета.КоррСчет;
				ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = реквизитыСчета.КоррСчет;
				ОбластьМакета.Параметры.СчетПолучателяПредставление      = реквизитыСчета.НомерСчета;
				ОбластьМакета.Параметры.СчетПолучателя                   = реквизитыСчета.НомерСчета;


			Конецесли;
			
			//ПредставлениеПоставщикаДляПлатПоручения                  = СведенияОПоставщике.Банк.БанковскийСчетТекстКорреспондента;
			
		//КонецЕсли;

		
		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
			ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
		КонецЕсли;
		
		ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ПредставлениеПоставщикаДляПлатПоручения;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	
	КонецЕсли;
	
	Попытка
		
		Если СокрЛП(СведенияОПоставщике.Банк) = "ООО ""Банк Точка""" ИЛИ СокрЛП(реквизитыСчета.Банк) = "ООО ""Банк Точка""" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИзменилисьРекв");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
	Исключение
	конецпопытки;
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	//УБИл
	КоличествоДней = 0;
	ДнейРезерваРасчитываемПоНоменклатура = ЛОЖЬ;
	Если ДнейРезерваРасчитываемПоНоменклатура Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Ссылка КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика,
			|	ЗаказКлиентаТовары.Номенклатура.Родитель КАК Родитель
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		КоличествоДней = 5;
		Пока Выборка.Следующий() Цикл
			Если Найти(Выборка.Родитель.Наименование, "Нестан") ИЛИ  Выборка.Характеристика.Наименование = "Серый" ИЛИ Выборка.Характеристика.Наименование = "серый" Тогда 
				КоличествоДней = 10;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
	Иначе
		КоличествоДней = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ДанныеПечати.Контрагент,"Резерв дней");
		Если КоличествоДней = неопределено Тогда
			КоличествоДней = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ДанныеПечати.Организация,"Резерв дней");
		КонецЕсли;
		
		Если КоличествоДней = неопределено Тогда
			КоличествоДней = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	НужнаяДата = НайтиДату(ДанныеПечати.Дата, КоличествоДней);
	Текст1 = "Уведомление об оплате обязательно.";
	Если КоличествоДней > 0 Тогда
		Текст1 = Текст1 + " Товар по счету находится в резерве "+КоличествоДней+" рабочих дня, до ";
		Текст1 = Текст1 + Формат(НужнаяДата,"ДЛФ=DD");
	КонецЕсли;
		  
		 
		
	   
	//   Сообщить(""+ДанныеПечати.Дата+"  + "+КоличествоДней+"   "+НужнаяДата);
	//УБИл
	
	параметрыОбласти = Новый Структура("ТекстЗаголовка,ДатаСнятияСРезерва");
	Если Тип = "Счет" ИЛИ Тип = "СчетКВозврату" Тогда
		
		параметрыОбласти.ТекстЗаголовка = СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(?(этоСчетДоговор,"ru='Счет-договор на поставку товара'", "ru='Счет'")));
		параметрыОбласти.ДатаСнятияСРезерва = Текст1;

	ИначеЕсли Тип = "Заказ" Тогда
		
		параметрыОбласти.ТекстЗаголовка = СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(?(этоСчетДоговор,"ru='Счет-договор на поставку товара'", "ru='Заказ клиента'")));
		параметрыОбласти.ДатаСнятияСРезерва = Текст1;

	ИначеЕсли Тип = "ЗаявкаНаЗамену" Тогда
		
		параметрыОбласти.ТекстЗаголовка = СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(?(этоСчетДоговор,"ru='Счет-договор на поставку товара'", "ru='Заявка на замену'")));
		параметрыОбласти.ДатаСнятияСРезерва = Текст1;

	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(параметрыОбласти);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	
	ОбластьМакета.Параметры.ТекстПоставщик = ?(Тип = "Счет" ИЛИ Тип = "СчетКВозврату", НСтр("ru='Поставщик:'"), НСтр("ru='Исполнитель:'"));
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ТекстПокупатель         = ?(Тип = "Счет" ИЛИ Тип = "СчетКВозврату", НСтр("ru='Покупатель:'"), НСтр("ru='Заказчик:'"));
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры


Процедура ЗаполнитьРеквизитыПодвалаСчетЗаказ(ДанныеПечати, Макет, ТабличныйДокумент, Тип, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, этоСчетДоговор)
	
	Если ТаблицаЭтапыОплаты.Количество() > 1 Тогда
		
		ТаблицаЭтапыОплаты.Сортировать("НомерСтроки Возр");
		
		ИмяКолонкиДатыОплаты = ?(Тип="СчетКВозврату", НСтр("ru='Дата оплаты или возврата'"), НСтр("ru='Дата оплаты'"));
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты|НомерСтрокиТаблицаЭтапыОплаты");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Тип = "Заказ" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты|ВариантОплатыТаблицаЭтапыОплаты");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты|ДанныеТаблицаЭтапыОплаты");
		ОбластьМакета.Параметры.ИмяКолонкиДатыОплаты = ИмяКолонкиДатыОплаты;
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты|НДСТаблицаЭтапыОплаты");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		ОбластьНомерСтроки = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты|НомерСтрокиТаблицаЭтапыОплаты");
		ОбластьДанные      = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты|ДанныеТаблицаЭтапыОплаты");
		ОбластьНДС         = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты|НДСТаблицаЭтапыОплаты");
		
		Для Каждого ТекЭтап Из ТаблицаЭтапыОплаты Цикл
			
			ОбластьНомерСтроки.Параметры.Заполнить(ТекЭтап);
			ТабличныйДокумент.Вывести(ОбластьНомерСтроки);
			
			Если Тип = "Заказ" Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты|ВариантОплатыТаблицаЭтапыОплаты");
				ОбластьМакета.Параметры.Заполнить(ТекЭтап);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьДанные.Параметры.Заполнить(ТекЭтап);
			ТабличныйДокумент.Присоединить(ОбластьДанные);
			
			ТекстНДС = СформироватьТекстНДСЭтапаОплаты(СоответствиеСтавокНДС, ТекЭтап.ПроцентПлатежа);
			
			ОбластьНДС.Параметры.ТекстНДС = ТекстНДС;
			ТабличныйДокумент.Присоединить(ОбластьНДС);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты|НомерСтрокиТаблицаЭтапыОплаты");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Тип = "Заказ" Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты|ВариантОплатыТаблицаЭтапыОплаты");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты|ДанныеТаблицаЭтапыОплаты");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты|НДСТаблицаЭтапыОплаты");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда
		
		ОбластьМакета                                    = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
		ОбластьМакета.Параметры.ДополнительнаяИнформация = ДанныеПечати.ДополнительнаяИнформация;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	параметрыОбласти = Новый Структура("ФИОРуководителя,ФИОБухгалтера,ФИОМенеджер");		
	Если Тип = "Счет" ИЛИ Тип = "СчетКВозврату" Тогда
			
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		параметрыОбласти.ФИОРуководителя = ДанныеПечати.Руководитель; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.Руководитель);
		параметрыОбласти.ФИОБухгалтера   = ДанныеПечати.ГлавныйБухгалтер;// ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
		параметрыОбласти.ФИОМенеджер     = ДанныеПечати.Менеджер; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер);
		
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалЗаказа");
		параметрыОбласти.ФИОМенеджер = ДанныеПечати.Менеджер; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер);
		
	КонецЕсли;	
	ОбластьМакета.Параметры.Заполнить(параметрыОбласти);
	
	Если этоСчетДоговор Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Функция НайтиДату(Дата, КоличествоДней)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь,
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	               |	ДанныеПроизводственногоКалендаря.Год,
	               |	ДанныеПроизводственногоКалендаря.ВидДня,
	               |	ДанныеПроизводственногоКалендаря.ДатаПереноса
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.Дата > &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("Дата", Дата(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
	//	Сообщить(""+Выборка.Дата);
		Если Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если Счетчик = КоличествоДней Тогда
			НужнаяДата = Выборка.Дата; 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НужнаяДата;
					   
КонецФункции


Функция СформироватьЗаголовокДокумента(Шапка, НазваниеДокумента = "") Экспорт
	
	Если НазваниеДокумента = ""
		И Шапка.Свойство("Представление")
		И ЗначениеЗаполнено(Шапка.Представление) Тогда
		
		ПоложениеНомера = Найти(Шапка.Представление,Шапка.Номер);
		
		Если ПоложениеНомера > 0 Тогда
			НазваниеДокумента = СокрЛП(Лев(Шапка.Представление,ПоложениеНомера-1));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НазваниеДокумента + " № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Ложь, Истина)
	+ " от " + Формат(Шапка.Дата, "ДФ='дд ММММ гггг'") + " г.";
	
КонецФункции

Функция СформироватьТекстНДСЭтапаОплаты(СоответствиеСтавокНДС, ПроцентПлатежа) Экспорт
	
	ТекстНДС = "";
	
	Если СоответствиеСтавокНДС.Количество() > 0 Тогда
		
		Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
			
			Если ТекСтавкаНДС.Значение <> 0 Тогда
				
				ТекстНДС = ТекстНДС + ?(ПустаяСтрока(ТекстНДС), НСтр("ru='НДС(%СтавкаНДС%) %СуммаНДС%'"), НСтр("ru=', НДС(%СтавкаНДС%) %СуммаНДС%'"));
				ТекстНДС = СтрЗаменить(ТекстНДС, "%СтавкаНДС%", ТекСтавкаНДС.Ключ);
				ТекстНДС = СтрЗаменить(ТекстНДС, "%СуммаНДС%",  Формат(ТекСтавкаНДС.Значение / 100 * ПроцентПлатежа, "ЧЦ=15; ЧДЦ=2"));
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстНДС) Тогда
		ТекстНДС = НСтр("ru='В т.ч. '") + ТекстНДС;
	Иначе
		ТекстНДС = НСтр("ru='Без налога (НДС)'");
	КонецЕсли;
	
	Возврат ТекстНДС;
	
КонецФункции
