
&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	ЕстьПолныеПрава = РольДоступна("ПолныеПрава");
	Если ЕстьПолныеПрава Тогда
		ЭтаФорма.Элементы.Товары.ТолькоПросмотр = ЛОЖЬ;
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура алсав_РедактированиеТоваровПосле(Команда)
	// Вставить содержимое обработчика
	//ЭтаФорма.Элементы.Товары.Доступность = Истина;

	ЭтаФорма.Элементы.Товары.ТолькоПросмотр = НЕ ЭтаФорма.Элементы.Товары.ТолькоПросмотр;
КонецПроцедуры
