
&Вместо("СоздатьНовоеПисьмо")
Процедура алсав_СоздатьНовоеПисьмо(ПараметрыОтправкиПисьма, ОповещениеОЗакрытииФормы)
	// Вставить содержимое метода.
	//ПродолжитьВызов(ПараметрыОтправкиПисьма, ОповещениеОЗакрытииФормы);
	
	
	ПараметрыОтправки = ПараметрыОтправкиПисьма();
	Если ПараметрыОтправкиПисьма <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыОтправки, ПараметрыОтправкиПисьма, Истина);
	КонецЕсли;
	
	СведенияДляОтправки = РаботаСПочтовымиСообщениямиВызовСервера.СведенияДляОтправки(ПараметрыОтправки);
	ПараметрыОтправки.Вставить("ПоказыватьДиалогВыбораФорматаСохраненияВложений", СведенияДляОтправки.ПоказыватьДиалогВыбораФорматаСохраненияВложений);
	ПараметрыОтправки.Вставить("ОповещениеОЗакрытииФормы", ОповещениеОЗакрытииФормы);
	
	ГенерироватьФайлаПисьма(ПараметрыОтправкиПисьма);
	
	//Почта = Новый Почта;
	//Почта.Подключиться(,); 
	//
	//Сообщение = Новый ПочтовоеСообщение(); 
	//
	//Сообщение.Тема = ПараметрыОтправки.Тема;
	//Почта.Послать(Сообщение);
КонецПроцедуры


Функция ГенерироватьФайлаПисьма(ПараметрыОтправки)
	
	ПутьМозиллы = "C:/Program Files/Mozilla Thunderbird/thunderbird.exe";
	КаталогМозиллы = """C:/Program Files/Mozilla Thunderbird""";
	Мозилла = Новый Файл(ПутьМозиллы);
	Если Не Мозилла.Существует() Тогда
		ПутьМозиллы = "C:/Program Files (x86)/Mozilla Thunderbird/thunderbird.exe";
		КаталогМозиллы = """C:/Program Files (x86)/Mozilla Thunderbird""";
		Мозилла = Новый Файл(ПутьМозиллы);
	КонецЕсли;
	Если Мозилла.Существует() Тогда	
		каталогОтправки = РабочийКаталогДанныхПользователя();
		полноеИмяФайла = каталогОтправки + "sendfile"+".bat";
		Текст = Новый ЗаписьТекста(полноеИмяФайла, КодировкаТекста.OEM);
		
		строкаАдресаты = "";
		Если ТипЗнч(ПараметрыОтправки.Получатель) = Тип("Массив") Тогда
			Для Каждого получатель из ПараметрыОтправки.Получатель Цикл
				строкаАдресаты = строкаАдресаты + ?(ЗначениеЗаполнено(строкаАдресаты),",","")+получатель.Адрес;
			КонецЦикла;
		КонецЕсли;
		
		темаПисьма = ПараметрыОтправки.Тема;
		текстПисьма = ПараметрыОтправки.Текст; 
		прикреплёнИмяФайла = "";
		
		Если ТипЗнч(ПараметрыОтправки.Вложения) = Тип("Массив") Тогда
			Для Каждого вложение из ПараметрыОтправки.Вложения Цикл
				
				ФайлПриемник = каталогОтправки+вложение.Представление; 
				ДанныеХранилища = ПолучитьИзВременногоХранилища(вложение.АдресВоВременномХранилище);
    			ДанныеХранилища.Записать(ФайлПриемник);
				прикреплёнИмяФайла = прикреплёнИмяФайла + ?(ЗначениеЗаполнено(прикреплёнИмяФайла),",","")+ФайлПриемник;
				
			КонецЦикла;
		КонецЕсли;
		
		Текст.ЗаписатьСтроку("@echo off");
		Текст.ЗаписатьСтроку("@echo Отправка почты");
		Текст.ЗаписатьСтроку("cd " + КаталогМозиллы);
		СтрокаЗапуска = "format=1,to='"+строкаАдресаты+"',subject='"+темаПисьма+"',body='"+ПреобразоватьТекстВХТМЛ(текстПисьма)+"',attachment='"+прикреплёнИмяФайла+"'";
		СтрокаЗапуска = """" + СтрокаЗапуска + """";
		СтрокаЗапуска = " -compose " + СтрокаЗапуска;
		Текст.ЗаписатьСтроку("thunderbird.exe"+СтрокаЗапуска);
		Текст.ЗаписатьСтроку("del " + полноеИмяФайла);
		Текст.ЗаписатьСтроку("del " + СтрЗаменить(прикреплёнИмяФайла,","," "));
		Текст.Закрыть();
		ЗапуститьПриложение(полноеИмяФайла,КаталогВременныхФайлов());
	иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПреобразоватьТекстВХТМЛ(текст)
	результ = текст;
	
	результ = СтрЗаменить(результ,Символы.ПС,"<br>");
	
	Результ = "<html><body>"+результ+"</html></body>";
	
	Возврат Результ;
КонецФункции