
&Вместо("ПроверитьНаличиеДублейСтрокТЧ")
Процедура алсав_ПроверитьНаличиеДублейСтрокТЧ(Объект, ИмяТЧ, КлючевыеРеквизитыТЧ, Отказ, ПредставлениеТЧ, УказыватьНомераСтрок)
	// Вставить содержимое метода.
	
	Если ТипЗнч(КлючевыеРеквизитыТЧ) = Тип("Массив") Тогда
		Если ЛОЖЬ Тогда
			КлючевыеРеквизитыТЧ = новый Массив;	
		КонецЕсли;
		
		Если КлючевыеРеквизитыТЧ.Найти("ДатаСчетаФактурыКомиссионера") <> неопределено Тогда 
			Если КлючевыеРеквизитыТЧ.Найти("НомерСчетаФактурыКомиссионера") = неопределено Тогда   
				КлючевыеРеквизитыТЧ.Добавить("НомерСчетаФактурыКомиссионера");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ПродолжитьВызов(Объект, ИмяТЧ, КлючевыеРеквизитыТЧ, Отказ, ПредставлениеТЧ, УказыватьНомераСтрок);
КонецПроцедуры
