Функция КорректировкаТекстЗапросаОстаткиНоменклатуры(ТекстЗапроса) Экспорт
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтОстатки","ПОМЕСТИТЬ ОригиналВтОстатки");
	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Временная таблица ""ВтОстатки""","
	|// Временная таблица ""ВтОстатки""
	|ВЫБРАТЬ
	|	Т.ПродуктНоменклатура Номенклатура,
	|	Т.ПродуктХарактеристика Характеристика,
	|	Т.Склад КАК Склад,
	|	MIN(Т.ВозможностьСобрать) ВНаличии,
	|	0 КАК ПриходПлановый,
	|	0 КАК ВРезерве,
	|	0 КАК Котгрузке,
	|	0 КАК ПланОтгрузки    
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|(	ВЫБРАТЬ
	|		ТОсновнаяВыборка.Доступно КАК Доступно,
	|		ТОсновнаяВыборка.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|		ТОсновнаяВыборка.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|		ТОсновнаяВыборка.Склад,
	|		ВЫБОР
	|			КОГДА (ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено) < ТОсновнаяВыборка.КоличествоУпаковок ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено) / ТОсновнаяВыборка.КоличествоУпаковок - 0.5 КАК ЧИСЛО(10, 0))
	|		КОНЕЦ КАК ВозможностьСобрать
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЕСТЬNULL(ОстаткиИРезерв.ВНаличииОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеПодЗаказОстаток, 0) КАК Доступно,
	|			ТСпецификация.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|			ТСпецификация.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|			ТСпецификация.Номенклатура КАК Номенклатура,
	|			ТСпецификация.Характеристика КАК Характеристика,
	|			ТСпецификация.КоличествоУпаковок КАК КоличествоУпаковок,
	|			ТСпецификация.Склад,
	|			ISNULL(ОстаткиИРезерв.ВНаличииОстаток,0) КАК ВНаличииОстаток,
	|			ISNULL(Заказы.КОтгрузке,0) КОтгрузке,
	|			ISNULL(Заказы.НеОбеспечено,0) НеОбеспечено,
	|			ISNULL(Заказы.ВЗаказеВсе,0) ВЗаказеВсе,
	|			ISNULL(Заказы.ВЗаказе,0) ВЗаказе,
	|			ISNULL(Заказы.ВРезерве,0) ВРезерве,
	|			ISNULL(Заказы.ВЗаказеОплачено,0) ВЗаказеОплачено,
	|			ISNULL(Заказы.ВЗаказеОплаченоНеОбеспечено,0) ВЗаказеОплаченоНеОбеспечено,
	|			ISNULL(Заказы.ВЗаказеНЕОплачено,0) ВЗаказеНЕОплачено
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Т.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|				Т.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|				Т.Номенклатура КАК Номенклатура,
	|				Т.Характеристика КАК Характеристика,
	|				Склад.Ссылка КАК Склад,
	|				СУММА(Т.КоличествоУпаковок) КАК КоличествоУпаковок
	|			ИЗ
	|				(ВЫБРАТЬ
	|					алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|					алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|					алсав_СоставИзделий.Номенклатура КАК Номенклатура,
	|					алсав_СоставИзделий.Характеристика КАК Характеристика,
	|					алсав_СоставИзделий.Количество КАК КоличествоУпаковок
	|				ИЗ
	|					РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	|				ГДЕ
	|					алсав_СоставИзделий.ЭтоМатериалы = ЛОЖЬ
	|					И алсав_СоставИзделий.ЭтоПолуфабрикат = ЛОЖЬ
	|			UNION ALL
	|			ВЫБРАТЬ DISTINCT
	|				Номенклатура.Ссылка КАК ПродуктНоменклатура,
	|				ХарактеристикиНоменклатуры.Ссылка КАК ПродуктХарактеристика,
	|				Номенклатура.Ссылка КАК Номенклатура,
	|				ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|				1 КАК КоличествоУпаковок
	|			ИЗ
	|				Справочник.Номенклатура	КАК Номенклатура
	|				LEFT JOIN Справочник.ХарактеристикиНоменклатуры КАК	ХарактеристикиНоменклатуры
	|					ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|
	|				INNER JOIN Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Активен
	|		        	ПО ДР_Активен.Ссылка = Номенклатура.Ссылка
	|		        		И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	|		        		И (ДР_Активен.Значение.Наименование = ""Да"")
	|
	|		        INNER JOIN Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_ТипСкладскогоУчета
	|		        	ПО ДР_ТипСкладскогоУчета.Ссылка = Номенклатура.Ссылка
	|		        		И (ДР_ТипСкладскогоУчета.Свойство.Заголовок = ""Тип складского учета"")
	|		        		И (ДР_ТипСкладскогоУчета.Значение.Наименование = ""Одна упаковка"")
	|
	|			) КАК Т
	|
	|			LEFT JOIN Справочник.Склады КАК Склад ПО Склад.Ссылка В(&Склады)
	|
	|			СГРУППИРОВАТЬ ПО
	|				Т.ПродуктНоменклатура,
	|				Т.ПродуктХарактеристика,
	|				Т.Номенклатура,
	|				Т.Характеристика,
	|				Склад.Ссылка
	|		) КАК ТСпецификация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				ВТ_Заказы.Номенклатура КАК Номенклатура,
	|				ВТ_Заказы.Характеристика КАК Характеристика,
	|				ВТ_Заказы.Склад КАК Склад,
	|				СУММА(ВТ_Заказы.КОтгрузке) КАК КОтгрузке,
	|				СУММА(ВТ_Заказы.НеОбеспечено) КАК НеОбеспечено,
	|				СУММА(ВТ_Заказы.ВРезерве) + СУММА(ВТ_Заказы.КОтгрузке) + СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказеВсе,
	|				СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказе,
	|
	|				СУММА(ЕСТЬNULL(ВТ_Заказы.ВРезерве, 0) + ЕСТЬNULL(ВТ_Заказы.КОтгрузке, 0)) КАК ВРезерве,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА ISNULL(ВТ_Заказы.ВРезерве,0) + ISNULL(ВТ_Заказы.КОтгрузке,0) + ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВЗаказеОплачено,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВЗаказеОплаченоНеОбеспечено,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА 0
	|					ИНАЧЕ ISNULL(ВТ_Заказы.ВРезерве,0) + ISNULL(ВТ_Заказы.КОтгрузке,0) + ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|				КОНЕЦ) КАК ВЗаказеНЕОплачено
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ВТ_Заказы.Номенклатура) КАК Номенклатура,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ВТ_Заказы.Характеристика) КАК Характеристика,
	|					ВТ_Заказы.Склад КАК Склад,
	|					ВТ_Заказы.Заказ КАК Заказ,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.ВРезерве КАК ВРезерве,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.КОтгрузке КАК КОтгрузке,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.НеОбеспечено КАК НеОбеспечено
	|				ИЗ
	|					(
	|					ВЫБРАТЬ
	|						ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|						ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|						ТоварыКОтгрузке.Склад КАК Склад,
	|						ТоварыКОтгрузке.ДокументОтгрузки КАК Заказ,
	|						ТоварыКОтгрузке.ВРезервеОстаток КАК ВРезерве,
	|						ТоварыКОтгрузке.КОтгрузкеОстаток КАК КОтгрузке,
	|						0 КАК НеОбеспечено
	|					ИЗ
	|						РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.Ссылка В(&Склады) И NOT (ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку)) КАК ТоварыКОтгрузке
	|
	|					ОБЪЕДИНИТЬ ВСЕ
	|
	|					ВЫБРАТЬ
	|						ГрафикОтгрузкиТоваров.Номенклатура,
	|						ГрафикОтгрузкиТоваров.Характеристика,
	|						ГрафикОтгрузкиТоваров.Склад,
	|						ГрафикОтгрузкиТоваров.Регистратор  КАК Заказ,
	|						0 КАК ВРезерве,
	|						0 КАК КОтгрузке,
	|						ГрафикОтгрузкиТоваров.КоличествоНеобеспечено КАК НеОбеспечено
	|					ИЗ
	|						РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикОтгрузкиТоваров) КАК ВТ_Заказы
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (	ВЫБРАТЬ
	|								состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	|								состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	|								состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	|								состав.ПутьВСборке КАК НоменклатураПутьСборки,
	|								состав.Номенклатура КАК Номенклатура,
	|								состав.Характеристика КАК Характеристика,
	|								состав.Количество КАК Количество,
	|								состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	|
	|							ИЗ
	|								РегистрСведений.алсав_СоставИзделий КАК состав
	|							ГДЕ
	|								состав.ЭтоПолуфабрикат = ЛОЖЬ
	|								И состав.ЭтоМатериалы = ЛОЖЬ
	|					) КАК ВТ_ВариантыКомплектацииНоменклатуры
	|					ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ВТ_Заказы.Номенклатура)
	|						И (ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ВТ_Заказы.Характеристика)) КАК ВТ_Заказы
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (
	|							ВЫБРАТЬ
	|								СостоянияЗаказов.Заказ КАК ЗаказКлиента,
	|								ВЫБОР
	|									КОГДА СостоянияЗаказов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки))
	|										ТОГДА ЛОЖЬ
	|									ИНАЧЕ ИСТИНА
	|								КОНЕЦ КАК ОплаченПоУсловиюСоглашения,
	|								ВЫБОР
	|									КОГДА ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) >= 10
	|										ТОГДА ИСТИНА
	|									ИНАЧЕ ЛОЖЬ
	|								КОНЕЦ КАК ЕстьОплата,
	|								СостоянияЗаказов.ПроцентОплаты КАК ПроцентОплаты
	|							ИЗ
	|								РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов) КАК СостоянияЗаказов
	|					ПО (СостоянияЗаказов.ЗаказКлиента = ВТ_Заказы.Заказ)
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (
	|						ВЫБРАТЬ
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|							СУММА(ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа) КАК ПроцентКредита
	|						ИЗ
	|							Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	|						ГДЕ
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка.Проведен = ИСТИНА
	|							И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
	|
	|						СГРУППИРОВАТЬ ПО
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка) КАК ГрафикОплаты
	|					ПО (ГрафикОплаты.Ссылка = ВТ_Заказы.Заказ)
	|					
	|					GROUP BY
	|						ВТ_Заказы.Номенклатура,
	|						ВТ_Заказы.Характеристика,
	|						ВТ_Заказы.Склад
	|					) КАК Заказы
	|			ПО ТСпецификация.Номенклатура = ТСпецификация.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Заказы.Характеристика)
	|				И ТСпецификация.Склад = Заказы.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ (
	|					ВЫБРАТЬ
	|						Номенклатура,
	|						Характеристика,
	|						Ссылка.Склад КАК Склад,
	|						SUM(Количество) AS Количество
	|					ИЗ Документ.РеализацияТоваровУслуг.Товары
	|					ГДЕ Ссылка.Дата > НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период,ДЕНЬ,-120),ДЕНЬ)
	|					GROUP BY Номенклатура,Характеристика,Ссылка.Склад
	|				) КАК Продажи
	|			ПО ТСпецификация.Номенклатура = Продажи.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Продажи.Характеристика)
	|				И ТСпецификация.Склад = Продажи.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|			ПО ТСпецификация.Номенклатура = ТоварныеОграничения.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ТоварныеОграничения.Характеристика)
	|				И ТСпецификация.Склад = ТоварныеОграничения.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, Склад.Ссылка В(&Склады)) КАК ГрафикПоступления
	|			ПО ТСпецификация.Номенклатура = ГрафикПоступления.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ГрафикПоступления.Характеристика)
	|				И ТСпецификация.Склад = ГрафикПоступления.Склад
	|
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(,Склад.Ссылка В(&Склады) ) КАК ОстаткиИРезерв
	|			ПО ТСпецификация.Номенклатура = ОстаткиИРезерв.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ОстаткиИРезерв.Характеристика)
	|				И ТСпецификация.Склад = ОстаткиИРезерв.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.Ссылка В(&Склады) И NOT (ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку)) КАК Т_КОтгрузке
	|			ПО ТСпецификация.Номенклатура = Т_КОтгрузке.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Т_КОтгрузке.Характеристика)
	|				И ТСпецификация.Склад = Т_КОтгрузке.Склад
	|
	|		) КАК ТОсновнаяВыборка
	|	) AS Т
	|	//WHERE ПродуктНоменклатура.Наименование
	|	//= ""AL 768 Кресло офисное, ткань/сетка""
	|	//LIKE ""6МБК%""
	|GROUP BY
	|	Т.ПродуктНоменклатура,
	|	Т.ПродуктХарактеристика,
	|	Т.Склад
	|
	|
	|;
	|");

	Возврат ТекстЗапроса;
КонецФункции