
&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Параметры.Свойство("ФизическоеЛицо") Тогда
		Если ЗначениеЗаполнено(Параметры.ФизическоеЛицо) Тогда
			лФизЛицо = Параметры.ФизическоеЛицо;
			Если 1=2 Тогда лФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() КонецЕсли;
			ТСУФизЛица = лФизЛицо.УБ_ТранспортныеСредства.ВыгрузитьКолонку("ТранспортноеСредство");
			списокТС = Новый СписокЗначений();
			списокТС.ЗагрузитьЗначения(ТСУФизЛица);			
			//ТСУФизЛица
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, 
				"Ссылка", 
				списокТС, 
				ВидСравненияКомпоновкиДанных.ВСписке,
				,
				Истина);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
