
&После("ЗаполнитьДополнительныеРеквизитыВФорме")
Процедура алсав_ЗаполнитьДополнительныеРеквизитыВФорме(Форма, Объект, ПоляНадписей, СкрытьУдаленные)
	// Вставить содержимое метода.
	РеквизитыФормы =  Форма.ПолучитьРеквизиты();
	Для Каждого реквизит из РеквизитыФормы Цикл 
		Реквизит_ЗапретОтгрузки(Форма,реквизит);
		Реквизит_ЗапретАвтоматПометкиНаУдалениеДо(Форма,реквизит);
	КонецЦикла;
КонецПроцедуры


Функция Реквизит_ЗапретОтгрузки(Форма, Реквизит)
	Если Реквизит.Заголовок = "Запрет отгрузки" И СтрНачинаетсяС(Реквизит.Имя, "ДополнительныйРеквизитЗначение") Тогда
		полныеПрава = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.ПолныеПрава.Имя);
		Форма.Элементы[Реквизит.Имя].ТолькоПросмотр = НЕ(полныеПрава ИЛИ
			УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоРедактироватьЗапретОтгрузки.Имя));
	КонецЕсли
КонецФункции


Функция Реквизит_ЗапретАвтоматПометкиНаУдалениеДо(Форма, Реквизит)
	Если Реквизит.Заголовок = "Запрет автомат. пометки на удаление до" И СтрНачинаетсяС(Реквизит.Имя, "ДополнительныйРеквизитЗначение") Тогда
		полныеПрава = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.ПолныеПрава.Имя);
		Форма.Элементы[Реквизит.Имя].ТолькоПросмотр = НЕ(полныеПрава ИЛИ
			УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоРедактироватьЗапретАвтоматическойПометкиУдаления.Имя));
	КонецЕсли
КонецФункции
