
&НаКлиенте
Процедура алсав_ФактическиОтгруженДаПосле(Команда)  
	
	мРеализации = Новый Массив;
	ВыделенныеСтроки = ЭтаФорма.Элементы.СписокДокументыПродажи.ВыделенныеСтроки;
	
	Для Каждого ТекВыд Из ВыделенныеСтроки Цикл
		стр = ЭтаФорма.Элементы.СписокДокументыПродажи.ДанныеСтроки(ТекВыд);
		мРеализации.Добавить(стр.Ссылка);
	КонецЦикла;
	
	алсав_ФактическиОтгруженДаПослеНаСервере(мРеализации);
	
	ЭтаФорма.Элементы.СписокДокументыПродажи.Обновить()
КонецПроцедуры

&НаСервереБезКонтекста
Процедура алсав_ФактическиОтгруженДаПослеНаСервере(мРеализации)
	// Вставить содержимое обработчика.              
	
	Для Каждого стр из мРеализации Цикл 
		Документы.РеализацияТоваровУслуг.УстановитьЗначениеФактическиОтгружен(стр, ИСТИНА);	
	КонецЦикла;
КонецПроцедуры
