/////////////////////////////////////////////////////////////////////////////////////////
///////////////////                      json,csv                /////////////////////     
/////////////////////////////////////////////////////////////////////////////////////////


Функция ПолучитьСхемуКомпановкиДанных()
	возврат ПолучитьМакет("ЗапросДляВыгрузки");
КонецФункции

Функция ВыполнитьВыгрузку() ЭКСПОРТ 
	
	мДанные = ПолучитьДанныеДляФайловНаFTP();
	контент = алсав_ВыгрузкаCsvJson.МассивСтруктурВCSV(мДанные);
	

	///
	имяФайла = "alsav_express_office";                                                   
	
	// Получаем данные для FTP из безопасного хранилища
	СерверFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_ftp");
	ЛогинFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_express_office_login");
	ПарольFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_express_office_password");
	
	ФТПСоединение = Новый FTPСоединение(СерверFTP, 21, ЛогинFTP, ПарольFTP);
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".csv"); 
	УдалитьФайлы(ВременныйФайл);  
	
	контент_json = алсав_ВыгрузкаCsvJson.СтруктураВjson(мДанные);
	ВременныйФайл = ПолучитьИмяВременногоФайла("json");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент_json);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".json"); 	
	УдалитьФайлы(ВременныйФайл);   
КонецФункции


Функция ПолучиьтТекстЗапроса()
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпановкиДанных(); 
	Если ЛОЖЬ Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных; КонецЕсли;
	запрос = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	возврат запрос;;
КонецФункции 


Функция ПолучитьДанныеДляФайловНаFTP()
	
	
	данные = новый Массив;
	поляШаблон = "Штрихкод,Артикул,Номенклатура,Характеристика,Остаток";
	
	////////////////////////////////////////////////////////////////////
	Запрос = ПолучитьЗапрос();	
	////////////////////////////////////////////////////////////////////
	
	дт1 = ТекущаяДата();
	рез = Запрос.Выполнить().Выбрать();
	дт2 = ТекущаяДата();
	
	Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		
		ЗаполнитьЗначенияСвойств(нСтр, Рез);
		
		Если нСтр.Остаток < 0 Тогда
			нСтр.Остаток = 0;
		КонецЕсли;
		нСтр = алсав_ВыгрузкаCsvJson.СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(нСтр);
		
		данные.Добавить(нСтр);
	КонецЦикла;
	Возврат данные;
КонецФункции  


Функция ПолучитьЗапрос()    
	//  e1cib/data/Справочник.ВариантыОтчетов?ref=9de90242ac11000411f05d98b2ef5d18
	////////////////////////////////////////////////////////////////////
	запросТекст = ПолучиьтТекстЗапроса();
	
	Запрос = Новый Запрос(запросТекст);       
	
	////// базовые параметры
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВидЦены",Справочники.ВидыЦен.НайтиПоНаименованию("Отпускная цена (с учетом НДС)")); 
	Запрос.УстановитьПараметр("ПроцентОплаты",1);
	
	
	////// дополнительные параметры
	группыНоманклатуры = Новый Массив;
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("1.1 Продукция стандартная"));
	                                                                                                           	
	
	группыНоманклатурыИсключения = Новый Массив;
	группыНоманклатурыИсключения.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("3 ""ЭКОНОМ"""));
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("группыНоманклатурыИсключения",группыНоманклатурыИсключения); 
	
	Запрос.Текст 
	= "ВЫБРАТЬ Т.ПродуктШтрихкод Штрихкод, Т.ПродуктНоменклатура.Артикул Артикул, ПродуктНоменклатура.Наименование Номенклатура, ПродуктХарактеристика.Наименование Характеристика
	| , MIN(ВозможностьСобрать) Остаток
	| ИЗ (" + Запрос.Текст + "
	| ) КАК Т 
	| WHERE Т.ПродуктНоменклатура В ИЕРАРХИИ (&группыНоманклатуры) И Т.ПродуктНоменклатура НЕ В ИЕРАРХИИ (&группыНоманклатурыИсключения)
	| GROUP BY Т.ПродуктШтрихкод, Т.ПродуктНоменклатура.Артикул, ПродуктНоменклатура, ПродуктХарактеристика
	| HAVING MIN(ВозможностьСобрать) >= 1
	| //ORDER BY Т.Серия";
	
	Возврат Запрос;
КонецФункции

