
&НаКлиенте
Процедура алсав_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	//Вставить содержимое обработчика
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Упаковка = ПолучитьЕдИзм(ТекущаяСтрока.Номенклатура)
КонецПроцедуры




&НаСервереБезконтекста
Функция ПолучитьЕдИзм(номенклатура)  
	Если номенклатура = неопределено тогда
		Возврат Неопределено;
	Иначе
		Возврат номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	
	Для Каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.Номенклатура) Тогда
			стр.Упаковка = стр.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
