
&Перед("ЗаписатьНаборыЗаписей")
Процедура алсав_ЗаписатьНаборыЗаписей(Объект)
	// Вставить содержимое метода.
	ст = Новый Структура("НеВыполнятьДвиженияПоСкладу",ложь);
	ЗаполнитьЗначенияСвойств(ст,Объект);
	Если ст.НеВыполнятьДвиженияПоСкладу Тогда
		Если НЕ УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_НеВыполнятьДвиженияПоСкладу.Имя) Тогда
			ВызватьИсключение "Не достаточно прав для проведения документа с отметкой [НеВыполнятьДвиженияПоСкладу]";
		Иначе
			Для каждого рег из Объект.Движения Цикл
				Если строка(Рег) = "РегистрНакопленияНаборЗаписей.ТоварыОрганизаций" Тогда
				Иначе
					Если рег.Количество() > 0 Тогда
						Рег.Очистить();
					КонецЕсли;
				конецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
