
&Вместо("ПроверитьОрдераНаВозможностьИзмененияСтатуса")
Функция алсав_ПроверитьОрдераНаВозможностьИзмененияСтатуса(Ордера)
	// Вставить содержимое метода.   
	этоДляСборки = Ложь;
	Если Ордера.ТоварыПоРаспоряжениям.Количество()>0 Тогда
		Если ТипЗнч(Ордера.ТоварыПоРаспоряжениям[0].Распоряжение) = Тип("ДокументСсылка.СборкаТоваров") Тогда
			этоДляСборки = Истина;      
			
			МассивОрдеров = Новый Массив;
	
			Если ТипЗнч(Ордера) <> Тип("Массив") Тогда
				МассивОрдеров.Добавить(Ордера);
			Иначе
				МассивОрдеров = Ордера;
			КонецЕсли;

			возврат МассивОрдеров;
		КонецЕсли;
	КонецЕсли;
	Результат = ПродолжитьВызов(Ордера);
	Возврат Результат;
КонецФункции
