



&НаКлиенте
Процедура алсав_СформироватьЗаказыНаСборкуПеред(Команда)
	Если Модифицированность Или Не Объект.Проведен Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(
		Новый ОписаниеОповещения("СформироватьЗаказыНаСборкуЗавершение", ЭтотОбъект),
		НСтр("ru = 'Необходимо провести документ для выполнения операции. Провести документ?'"), 
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	СформироватьЗаказыНаСборку();
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьЗаказыНаСборкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьЗаказыНаСборку();
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьЗаказыНаСборку()
		//СписокЗаказовКЗакрытию = Новый СписокЗначений;
	//СписокЗаказовКЗакрытию.Добавить(Объект.Ссылка);
	//
	//СтруктураЗакрытия = Новый Структура;
	//СтруктураЗакрытия.Вставить("Заказы",                       СписокЗаказовКЗакрытию);
	//СтруктураЗакрытия.Вставить("ДокументИнициатор",            Объект.Ссылка);
	//
	//ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("алсав_ФормаСозданияЗаказовНаСборокуОбработкаЗакрытия", ЭтотОбъект);
	//
	//ОткрытьФорму("Обработка.ПомошникСозданияСборок.Форма.алсав_ФормаСозданияЗаказовНаСбороку",
	//СтруктураЗакрытия, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	мЗаказыСборки = СформироватьЗаказыНаСборкуСервер();

	мСборки = Новый Массив;
	Для Каждого заказНаСборку из мЗаказыСборки Цикл
		
		//ОткрытьИЗаписатьДокумент(заказНаСборку, "ЗаказНаСборку");
		сборка = СоздатьСборку(заказНаСборку);
		
		//ОткрытьИЗаписатьДокумент(сборка, "СборкаТоваров");
		мСборки.Добавить(сборка);
	КонецЦикла;
	
	Для Каждого сборка из мСборки Цикл
		ордер = СоздатьОрдерДляСборки(сборка);
		Если ордер <> неопределено Тогда
			//ОткрытьИЗаписатьДокумент(ордер, "ПриходныйОрдерНаТовары");
		КонецЕсли;
		
		ордер = СоздатьОрдерДляСборкиРасходный(сборка);
	КонецЦикла;

	
	
	алсав_ФормаСозданияЗаказовНаСборокуОбработкаЗакрытия();
КонецПроцедуры

&НаКлиенте
Функция ОткрытьИЗаписатьДокумент(ссылка, типДокумента)
	
	ПараметрыФормы = Новый Структура("Ключ", ссылка);
    нФорма = ПолучитьФорму("Документ."+типДокумента+".Форма.ФормаДокумента", ПараметрыФормы);
	нФорма.Открыть();
	
	Пауза(1);
	
	нФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	нФорма.Закрыть();

	
КонецФункции

&НаСервереБезКонтекста
Функция Пауза(Секунды)
	ОбщегоНазначенияБТС.Пауза(Секунды);
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьСборку(ЗаказНаСборку)
	докСборка = Обработки.ПомошникСозданияСборок.СоздатьСборку(ЗаказНаСборку);
	Возврат  докСборка;
КонецФункции 

&НаСервереБезКонтекста
Функция СоздатьОрдерДляСборки(сборка)
	Возврат Обработки.ПомошникСозданияСборок.СоздатьОрдерДляСборки(сборка);
КонецФункции   

&НаСервереБезКонтекста
Функция СоздатьОрдерДляСборкиРасходный(сборка)
	Возврат Обработки.ПомошникСозданияСборок.СоздатьОрдерДляСборкиРасходный(сборка);
КонецФункции


&НаСервере
Функция СформироватьЗаказыНаСборкуСервер()
	массивЗаказов = Новый Массив;
	массивЗаказов.Добавить(Объект.Ссылка);
	тчСборки = Обработки.ПомошникСозданияСборок.ЗаполнитьСписокСборок(массивЗаказов);
	тчСборки = Обработки.ПомошникСозданияСборок.НайтиСозданныеЗаказыНаСборку(тчСборки);
	Обработки.ПомошникСозданияСборок.ЗаполнитьВариантыКомплектации(тчСборки);
	Обработки.ПомошникСозданияСборок.НайтиСозданныеЗаказыНаСборку(тчСборки);
	
	сформированныеЗаказы = Обработки.ПомошникСозданияСборок.СоздатьЗаказыНаСборку(тчСборки);
	возврат сформированныеЗаказы; 
	
	//реззульт = Новый Массив;
	//Для Каждого Заказ Из сформированныеЗаказы Цикл
	//	
	//	реззульт.Добавить(докСборка);
	//КонецЦикла;
	
	
КонецФункции


&НаКлиенте
Функция алсав_ФормаСозданияЗаказовНаСборокуОбработкаЗакрытия(парам1 = неопределено, парам2  = неопределено) ЭКСПОРТ
	Пауза(1);
	алсав_ФормаСозданияЗаказовНаСборокуОбработкаЗакрытияСервер();
	Пауза(1);
	ОчиститьСообщения();
	ЭтаФорма.Записать();
КонецФункции

&НаСервере
Функция алсав_ФормаСозданияЗаказовНаСборокуОбработкаЗакрытияСервер()
	
	массивВариантовОбоеспечения = ПолучитьСписокВариантовОбоеспеченияДляОбработки();
	
	//вариантОтгрузить = ПолучитьВариантОбоеспечения_Отгрузить();
	вариантОтгрузить  = ПолучитьВариантОбоеспечения_СоСклада();
	
	Для Каждого Стр из Этаформа.Объект.Товары Цикл
		Если массивВариантовОбоеспечения.Найти(Стр.ВариантОбеспечения) <> Неопределено Тогда
			Стр.ВариантОбеспечения = вариантОтгрузить;
		КонецЕсли;		
	КонецЦикла;
	
КонецФункции



&НаКлиенте
Процедура алсав_алсав_ПроверитьВозможнлстьСборкиПосле(Команда)
	алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВариантовОбоеспеченияДляОбработки()
	массивВариантовОбоеспечения = Новый Массив;
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);	
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.Требуется);
	Возврат массивВариантовОбоеспечения;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВариантОбоеспечения_СоСклада()
	Возврат Перечисления.ВариантыОбеспечения.СоСклада;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВариантОбоеспечения_Отгрузить()
	Возврат Перечисления.ВариантыОбеспечения.Отгрузить;
КонецФункции 


&НаСервереБезКонтекста
Функция ПолучитьВариантОбоеспечения_Требуется()
	Возврат Перечисления.ВариантыОбеспечения.Требуется;
КонецФункции


&НаСервере
Функция ПолучитьРаскрытуюПотребность(массивВариантовОбоеспечения = неопределено)
	тчПотребность = неопределено;
	мПроверкаПострочно = Новый Массив;
	Для Каждого Стр из Этаформа.Объект.Товары Цикл
		Если (массивВариантовОбоеспечения = неопределено) 
			ИЛИ (массивВариантовОбоеспечения.Найти(Стр.ВариантОбеспечения) <> Неопределено) 
			Тогда
			
			тчПотребностьПозиции = алсав_НоменклатураОстатки.ПолучитьПотребность(
				стр.Номенклатура,
				стр.Характеристика,
				стр.Количество
			);
			
			мПроверкаПострочно.Добавить(новый Структура("стр,тчПотребность", стр, тчПотребностьПозиции));
			
			тчПотребность = СложитьТаблицы(тчПотребность, тчПотребностьПозиции);
		КонецЕсли;		
	КонецЦикла;
	
	Если тчПотребность = неопределено Тогда
		Возврат неопределено;
	КонецЕсли;
	
	тчПотребность.Свернуть("Номенклатура, Характеристика, ПервичнаяПотребность","Количество");
	
	результ = Новый Массив;
	Для Каждого Стр из тчПотребность Цикл
		нстр = Новый Структура("Номенклатура, Характеристика, ПервичнаяПотребность, Количество");
		ЗаполнитьЗначенияСвойств(нстр,Стр);
		результ.Добавить(нстр);
	КонецЦикла;
	
	Возврат результ;
КонецФункции

&НаСервере
Процедура алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере()
	// Вставить содержимое обработчика.
	ЭтаФорма.алса_Дефицит.Очистить();
	тчПотребность = новый ТаблицаЗначений;
	тчПотребность.Колонки.Добавить("Номенклатура");
	тчПотребность.Колонки.Добавить("Характеристика");
	тчПотребность.Колонки.Добавить("Количество");
	тчПотребность.Колонки.Добавить("ПервичнаяПотребность");
	тчПотребность.Колонки.Добавить("Дефицит");
	тчПотребность.Колонки.Добавить("ОстаткиОбуховоОсновной");
	тчПотребность.Колонки.Добавить("ОстаткиОбуховоПроизводство");
	
	массивВариантовОбоеспечения = ПолучитьСписокВариантовОбоеспеченияДляОбработки();

	мПроверкаПострочно = Новый Массив;
	Для Каждого Стр из Этаформа.Объект.Товары Цикл		
		Если массивВариантовОбоеспечения.Найти(Стр.ВариантОбеспечения) <> Неопределено Тогда
			тчПотребностьПозиции = алсав_НоменклатураОстатки.ПолучитьПотребность(
				стр.Номенклатура,
				стр.Характеристика,
				стр.Количество
			);		
			
			мПроверкаПострочно.Добавить(новый Структура("стр,тчПотребность", стр, тчПотребностьПозиции));
			
			тчПотребностьПозиции.Колонки.Добавить("Дефицит");
			Для Каждого стрПотребность из тчПотребностьПозиции Цикл
				стрПотребность.Дефицит = стрПотребность.Количество;
			КонецЦикла; 
			
			тчПотребность = СложитьТаблицы(тчПотребность, тчПотребностьПозиции);
			
		//иначе
			//тчПотребностьПозиции.ЗаполнитьЗначения(0,"Дефицит")
		КонецЕсли;

		//нСтр = тчПотребность.Добавить();
		//ЗаполнитьЗначенияСвойств(нСтр,Стр);
		//нСтр.ПервичнаяПотребность = Истина;
		//нСтр.Дефицит = нСтр.Количество;
	КонецЦикла;
	
	Если тчПотребность = неопределено Тогда
		Возврат;
	КонецЕсли;

	тчПотребность.Свернуть("Номенклатура, Характеристика, ПервичнаяПотребность","Количество, Дефицит, ОстаткиОбуховоПроизводство, ОстаткиОбуховоОсновной");
	
	тчДоступныеОстатки = алсав_НоменклатураОстатки.ПолучитьДоступныйОстаток(тчПотребность.ВыгрузитьКолонку("Номенклатура"),ЭтаФорма.Объект.Склад);
	//Для Каждого стр из тчПотребность Цикл
	//	Если стр.Дефицит = 0 Тогда
	//		нСтр = тчДоступныеОстатки.Добавить();
	//		ЗаполнитьЗначенияСвойств(нСтр,стр);
	//		нСтр.ВРезерве = стр.Количество;
	//		нСтр.ДоступныйОстаток = (-1)*стр.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	
	тчДоступныеОстатки.Свернуть("Номенклатура, Характеристика","ВНаличииОстаток, ВРезерве, КОтгрузке, ДоступныйОстаток");
	
	складПроизводства = ПолучитьСклад_Производство();
	остаткиПроизводства = алсав_НоменклатураОстатки.ПолучитьДоступныйОстаток(тчПотребность.ВыгрузитьКолонку("Номенклатура"),складПроизводства);
	остаткиПроизводства.Свернуть("Номенклатура, Характеристика","ВНаличииОстаток, ВРезерве, КОтгрузке, ДоступныйОстаток");
	
	
	складОбуховоОсновной = ПолучитьСклад_ОбуховоОсновной();
	остаткиОстаткиОбуховоОсновной =  алсав_НоменклатураОстатки.ПолучитьДоступныйОстаток(тчПотребность.ВыгрузитьКолонку("Номенклатура"),складОбуховоОсновной);
	остаткиОстаткиОбуховоОсновной.Свернуть("Номенклатура, Характеристика","ВНаличииОстаток, ВРезерве, КОтгрузке, ДоступныйОстаток");
	
	Если Ложь Тогда тчПотребность = Новый ТаблицаЗначений; КонецЕсли;
	Если Ложь Тогда тчДоступныеОстатки = Новый ТаблицаЗначений; КонецЕсли;
	
	тчПотребность.Колонки.Добавить("ДоступныйОстаток");
	
	Для Каждого стрПотребность из тчПотребность Цикл
		стрПотребность.ДоступныйОстаток = 0;
		стрПотребность.Дефицит = стрПотребность.Количество;
		стрОстаток = тчДоступныеОстатки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стрПотребность.Номенклатура, стрПотребность.Характеристика));
		Если стрОстаток.Количество() = 1 Тогда
			стрПотребность.ДоступныйОстаток = стрОстаток[0].ДоступныйОстаток;
		Иначе
			стрПотребность.ДоступныйОстаток = 0;
		КонецЕсли;	
		
		стрПотребность.Дефицит = ?(
			стрПотребность.ДоступныйОстаток >= стрПотребность.Количество,
			0,
			стрПотребность.Количество - стрПотребность.ДоступныйОстаток
		);
		
		Если стрПотребность.Дефицит > 0 Тогда
			стрОстаток = остаткиПроизводства.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стрПотребность.Номенклатура, стрПотребность.Характеристика));
			Если стрОстаток.Количество() = 1 Тогда
				стрПотребность.ОстаткиОбуховоПроизводство = стрОстаток[0].ДоступныйОстаток;
			Иначе
				стрПотребность.ОстаткиОбуховоПроизводство = 0;
			КонецЕсли;
			
			стрОстаток = остаткиОстаткиОбуховоОсновной.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стрПотребность.Номенклатура, стрПотребность.Характеристика));
			Если стрОстаток.Количество() = 1 Тогда
				стрПотребность.ОстаткиОбуховоОсновной = стрОстаток[0].ДоступныйОстаток;
			Иначе
				стрПотребность.ОстаткиОбуховоОсновной = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.алсав_ВозможностьСборки = ?(тчПотребность.Итог("Дефицит") > 0, -1, 1);
	ЭтаФорма.алсав_ВозможностьПеремещения = ?(тчПотребность.Итог("ОстаткиОбуховоПроизводство")+тчПотребность.Итог("ОстаткиОбуховоОсновной") > 0, -1, 1); 
	ЭтаФорма.алса_Дефицит.Загрузить(тчПотребность);	
	
	алсав_УстановитьВидимость();
	
	Для Каждого потребностьПозиции Из мПроверкаПострочно Цикл
		
		стр = потребностьПозиции.стр;
		тчПотребность = потребностьПозиции.тчПотребность;
		
		покаХватает = Истина;
		Для Каждого стрПотребность из тчПотребность Цикл;
			Если стрПотребность.ПервичнаяПотребность Тогда
				покаХватает = Ложь;
			КонецЕсли;
			
			Если покаХватает Тогда
				стрОстаток = тчДоступныеОстатки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стрПотребность.Номенклатура, стрПотребность.Характеристика));
				Если стрОстаток.Количество() = 1 Тогда
					покаХватает = (покаХватает) И (стрПотребность.Количество <= стрОстаток[0].ДоступныйОстаток);
				Иначе
					покаХватает = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		стр.ВозможностьСборки = покаХватает;
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСклад_Производство()
	Возврат Справочники.Склады.НайтиПоНаименованию("Обухово Производство");
КонецФункции
Функция ПолучитьСклад_ОбуховоОсновной()
	Возврат Справочники.Склады.НайтиПоНаименованию("Обухово Основной");
КонецФункции

&НаСервере
Функция алсав_УстановитьВидимость()
	
	
	Если Этаформа.алсав_ВозможностьПеремещения = -1 Тогда
		ЭтаФорма.Элементы.алса_Дефициталсав_СоздатьПеремещениеСПроизводства.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.алса_Дефициталсав_СоздатьПеремещениеСПроизводства.Видимость = ЛОЖЬ;		
	КонецЕсли;
	ЭтаФорма.Элементы.алса_Дефициталсав_СоздатьПеремещениеСОбуховоОсновной.Видимость = ЭтаФорма.Элементы.алса_Дефициталсав_СоздатьПеремещениеСПроизводства.Видимость;
	
	Если Этаформа.алсав_ВозможностьСборки = -1 Тогда
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Заголовок = "Дефицит";
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Картинка = БиблиотекаКартинок.Предупреждение;
	ИначеЕсли Этаформа.алсав_ВозможностьСборки = 0 Тогда
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Заголовок = "...";
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
	ИначеЕсли Этаформа.алсав_ВозможностьСборки = 1 Тогда
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Заголовок = "Готов к сборке (сформировать)";
		ЭтаФорма.Элементы.алсав_СформироватьСборки.Картинка = БиблиотекаКартинок.ВыполненоУспешно;
	КонецЕсли;
	
	//ЭтаФорма.Элементы.алсав_СформироватьСборки.Доступность = Этаформа.алсав_ВозможностьСборки = 1;
	ЭтаФорма.Элементы.ГруппаДефицит.Видимость = Истина;//Этаформа.алсав_ВозможностьСборки = -1; 
	
	Этаформа.Элементы.ВниманиеЕстьПроведеннаяСборка.Видимость = Проверить_ЕстьПроведеннаяСборка();
КонецФункции

&НаСервере
Функция Проверить_ЕстьПроведеннаяСборка()
	результ = ложь;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат результ;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаСборку.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаСборку КАК ЗаказНаСборку
	               |ГДЕ
	               |	ЗаказНаСборку.Проведен
	               |	И ЗаказНаСборку.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		результ = Истина;
	КонецЕсли;
	Возврат результ;
КонецФункции

&НаСервереБезКонтекста
Функция СложитьТаблицы(тчПриемник, тч)
	Если тчПриемник = неопределено Тогда
		тчПриемник = тч.Скопировать();
	Иначе
		Для Каждого стр из тч Цикл
			ЗаполнитьЗначенияСвойств(тчПриемник.Добавить(),стр);
		КонецЦикла                   
	КонецЕсли;
	
	Возврат тчПриемник;
КонецФункции

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура алсав_УстановитьУсловноеОформление()
	алсав_УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура алсав_алсав_СформироватьСборкиПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СформироватьСборкиПосле(Команда)
	Если ЭтаФорма.алсав_ВозможностьСборки = 1 Тогда
		//алсав_алсав_СформироватьСборкиПослеНаСервере();
		СформироватьЗаказыНаСборку();
		//алсав_СформироватьЗакаазыНаСборкуПеред(Команда);
	ИначеЕсли ЭтаФорма.алсав_ВозможностьСборки = -1 Тогда 
		ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаДефицит;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура алсав_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере();
	ТоварыУстановитьФлагВариантКомплектацииОтсуствуетСервер();
	ТоварыЗаполнитьАртикулHOFF();
	ТоварыЗаполнитьИКТ();
КонецПроцедуры


&НаСервере
Функция ТоварыЗаполнитьАртикулHOFF()
	
	Для Каждого стр из Объект.Товары Цикл
		АртикулHOFF="";
		Если ЗначениеЗаполнено(стр.Характеристика) Тогда 
			АртикулHOFF = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Характеристика, "Артикул HOFF");
		КонецЕсли;
		стр.АртикулHOFF = АртикулHOFF;
	КонецЦикла;
КонецФУнкции

&НаСервере
Функция ТоварыЗаполнитьИКТ()
	
	Для Каждого стр из Объект.Товары Цикл
		ИКТ="";
		Если ЗначениеЗаполнено(стр.Характеристика) Тогда 
			//ИКТ = алсав_ПечатьСчет.ПолучитьАртикул(стр.Номенклатура, стр.Характеристика,Объект.Контрагент);
			ИКТ = алсав_ПечатьСчет.ПолучитьАртикул(стр.Номенклатура, стр.Характеристика,неопределено);
		КонецЕсли;
		стр.ИКТ= ИКТ;
	КонецЦикла;
КонецФУнкции

&НаСервере
Процедура алсав_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере();
	ТоварыУстановитьФлагВариантКомплектацииОтсуствуетСервер();
	ТоварыЗаполнитьАртикулHOFF();
	ТоварыЗаполнитьИКТ();
	Проверить_Контрольсборок_ЕстьОшибка();
	
	Если ЭтаФорма.Объект.Комментарий = "#НЕ ТРОЖЬ!#" Тогда
		ЭтаФорма.Элементы.Комментарий.ТолькоПросмотр = ИСТИНА;
	КонецЕсли;
	ОновитьОбщийВес();
КонецПроцедуры

&НаСервере
Функция ОновитьОбщийВес()
	общийВес = 0;
	Для Каждого стр из Объект.Товары Цикл
		общийВес = общийВес + алсав_ПечатьСчет.Вес(стр.Номенклатура, истина) * стр.Количество;
	КонецЦикла;
	алсав_ОбщийВес = общийВес;
КонецФУнкции

&НаКлиенте
Процедура алсав_ТоварыПриИзмененииПосле(Элемент)
	алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере();
	ТоварыУстановитьФлагВариантКомплектацииОтсуствуетСервер();
	ТоварыЗаполнитьАртикулHOFF();
КонецПроцедуры

&НаСервере
Функция ТоварыУстановитьФлагВариантКомплектацииОтсуствуетСервер()
	Для Каждого стр из Объект.Товары Цикл
		вариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(стр.Номенклатура, стр.Характеристика);
		стр.ВариантКомплектацииОтсуствует = НЕ ЗначениеЗаполнено(вариантКомплектации);
	КонецЦикла;
КонецФункции

&НаКлиенте
&После("ОбработкаОповещенияФрагмент")
Процедура алсав_ОбработкаОповещенияФрагмент(Знач ИмяСобытия, Знач Параметр)
	// Вставить содержимое метода.
	алсав_алсав_ПроверитьВозможнлстьСборкиПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_ЗагрузитьXML_ZKПосле(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = НСтр("xml");
	Диалог.Заголовок = "Выберите файл XML";
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаXML_ZKЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаXML_ZKЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
		
		ф = новый Файл(ПутьКФайлу);
		Если ф.Существует() Тогда
			чт = Новый ЧтениеТекста(ПутьКФайлу);
			СтрокаXML = чт.Прочитать();
			
			ЧтениеXML = Новый ЧтениеXML;
			
			ЧтениеXML.УстановитьСтроку(СтрокаXML);	
			ЧтениеXML.Прочитать();
						
			объектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
			
			данные = новый Массив;
			
			CutResults = объектXDTO.CutResult;
			Если ТипЗнч(объектXDTO.CutResult) = Тип("ОбъектXDTO") Тогда
				CutResults = новый Массив;
				CutResults.Добавить(объектXDTO.CutResult);
			КонецЕсли;
			
			Для Каждого CutResult из CutResults Цикл
				данные.Добавить(
					Новый Структура("Заказ,Артикул,Количество"
						,CutResult.OrderData.Order
						,CutResult.OrderData.MaterialArticle
						,CutResult.Boards.Board.Count
					)
				);
			КонецЦикла;
			//
			//объектXDTO.Проверить();
			//
			//об = СериализаторXDTO.ПрочитатьXDTO(объектXDTO);
			//
			//Значение=СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			
			алсав_алсав_ЗагрузитьXML_ZKПослеНаКлиенте(данные);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ЗагрузитьXML_ZKПослеНаКлиенте(данные)
	// Вставить содержимое обработчика.
	Для каждого стр из данные Цикл
		номен = НайтиНоменклатуру(стр.Артикул);
		колво = Число(стр.Количество);
		заказ = НайтиЗаказ(стр.Заказ);
		
		нСтр = Объект.Товары.Добавить();
		нСтр.Номенклатура = номен;
		нСтр.Количество = колво;
		нСтр.Цена = 1;
		нСтр.КоличествоУпаковок = колво;
		нСтр.ЗаданиеПакет = заказ;
		
		ЭтаФорма.Элементы.Товары.ТекущаяСтрока = нСтр.ПолучитьИдентификатор();
		
		ТоварыНоменклатураПриИзменении(ЭтаФорма.Элементы.Товары);
	КонецЦикла;
	
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ПолучитьОрганизациюПоНаименованию("ООО ""АЛСАВ""");
		ОрганизацияПриИзменении(этаФорма.Элементы.Организация);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = ПолучитьСкладПоНаименованию("Основной склад");
		СкладПриИзменении(этаФорма.Элементы.Склад);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		Объект.Партнер = ПолучитьПартнераПоНаименованию("+ОП+");
		ПартнерПриИзменении(этаФорма.Элементы.Партнер);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьПартнераПоНаименованию(наименование)
	Справочники.Партнеры.НайтиПоНаименованию(наименование);
КонецФункции

&НаСервереБезКонтекста
Функция  ПолучитьОрганизациюПоНаименованию(наименование)
	Справочники.Организации.НайтиПоНаименованию(наименование);
КонецФункции

&НаСервереБезКонтекста
Функция  ПолучитьСкладПоНаименованию(наименование)
	Справочники.Склады.НайтиПоНаименованию(наименование);
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(артикул)
	ЗАпрос = Новый Запрос;
	Запрос.УстановитьПараметр("артикул", артикул);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	н.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК н
	               |ГДЕ
	               |	н.Значение = &артикул
	               |	И н.Свойство.Заголовок = ""ЛДСП Базис""";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	н.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.Номенклатура КАК н
	//               |ГДЕ
	//               |	н.Артикул = &артикул";
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция НайтиЗаказ(заказ)
	док = Документы.ЗаказКлиента.НайтиПоНомеру(Прав(заказ,11),ТекущаяДата());
	Если ЗначениеЗаполнено(док) Тогда
		Возврат док;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура алсав_алсав_СоздатьЗаказПоставщикуПосле(Команда)
	// Вставить содержимое обработчика.
	формаЗаказПоставщику = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта");
	
	портребность = ПолучитьРаскрытуюПотребность();
	
	Для Каждого Стр из портребность Цикл
		//Если Стр.Дефицит > 0 И Не Стр.ПервичнаяПотребность Тогда
			нСтр = формаЗаказПоставщику.Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
			нСтр.Количество = Стр.Количество;
			нСтр.КоличествоУпаковок = нСтр.Количество;
		//КонецЕсли;
	КонецЦикла;
	
	формаЗаказПоставщику.Объект.ДокументОснование = Объект.Ссылка;
	
	формаЗаказПоставщику.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_СоздатьЗакзаПоставщикуАЛУТПосле(Команда)
	// Вставить содержимое обработчика.
	формаЗаказПоставщику = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта");
	
	Для Каждого Стр из ЭтаФорма.алса_Дефицит Цикл
		Если Стр.Дефицит > 0 И Не Стр.ПервичнаяПотребность Тогда
			нСтр = формаЗаказПоставщику.Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
			нСтр.Количество = Стр.Дефицит;
			нСтр.КоличествоУпаковок = нСтр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	формаЗаказПоставщику.Объект.ДокументОснование = Объект.Ссылка;
	
	формаЗаказПоставщику.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СоздатьЗаказПоставщикуНаПростыеТоварыПосле(Команда)
	формаЗаказПоставщику = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта");
	
	Для Каждого Стр из ЭтаФорма.алса_Дефицит Цикл
		Если Стр.Дефицит > 0 И Стр.ПервичнаяПотребность Тогда
			нСтр = формаЗаказПоставщику.Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
			нСтр.Количество = Стр.Дефицит;
			нСтр.КоличествоУпаковок = нСтр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	формаЗаказПоставщику.Объект.ДокументОснование = Объект.Ссылка;
	
	формаЗаказПоставщику.Открыть();
КонецПроцедуры



&НаКлиенте
Процедура алсав_ТоварыПриАктивизацииСтрокиПосле(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СобратьВыбраннуСтрокуПосле(Команда)
	Если Модифицированность Или Не Объект.Проведен Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(
		Новый ОписаниеОповещения("СформироватьЗаказНаСборкуДляСтрокиЗавершение", ЭтотОбъект),
		НСтр("ru = 'Необходимо провести документ для выполнения операции. Провести документ?'"), 
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	СформироватьЗаказНаСборкуДляСтроки();	
КонецПроцедуры




&НаКлиенте
Процедура СформироватьЗаказНаСборкуДляСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		Возврат;
	КонецЕсли;
	СформироватьЗаказНаСборкуДляСтроки();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьЗаказНаСборкуДляСтроки()
	СформироватьЗаказНаСборкуДляСтрокиСервер(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры


&НаСервере
Функция СформироватьЗаказНаСборкуДляСтрокиСервер(ТекущаяСтрока)
	стр = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	массивВариантовОбоеспечения = Новый Массив;
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);	
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.Требуется);
	
	Если стр.ВариантКомплектацииОтсуствует или массивВариантовОбоеспечения.Найти(стр.ВариантОбеспечения) = неопределено Тогда
		Сообщить("Текущая позиция не требует сборки");
		Возврат неопределено;
	КонецЕсли;
	
	Если НЕ стр.ВозможностьСборки Тогда
		Сообщить("Для сборки не хватает остатков");
		Возврат неопределено;
	КонецЕсли;
                                                                               
	массивЗаказов = Новый Массив;
	массивЗаказов.Добавить(Объект.Ссылка);

	тчСборки = Обработки.ПомошникСозданияСборок.ЗаполнитьСписокСборок(массивЗаказов, стр.НомерСтроки);
	Обработки.ПомошникСозданияСборок.ЗаполнитьВариантыКомплектации(тчСборки);
	Обработки.ПомошникСозданияСборок.НайтиСозданныеЗаказыНаСборку(тчСборки);
	
	сформированныеЗаказы = Обработки.ПомошникСозданияСборок.СоздатьЗаказыНаСборку(тчСборки);
	
	докСборка = неопределено;
	Для Каждого заказНаСборку Из сформированныеЗаказы Цикл
		//докСборка = Обработки.ПомошникСозданияСборок.СоздатьСборку(Заказ);
		сборка = СоздатьСборку(заказНаСборку);
		ордер = СоздатьОрдерДляСборки(сборка);
		ордерРасходный = СоздатьОрдерДляСборкиРасходный(сборка);

		Если ЗначениеЗаполнено(сборка) тогда
			//вариантОтгрузить = ПолучитьВариантОбоеспечения_Отгрузить();
			вариантОтгрузить = ПолучитьВариантОбоеспечения_СоСклада();
			
			Пауза(1);
			Стр.ВариантОбеспечения = вариантОтгрузить;
			ЭтаФорма.Модифицированность = Истина;
			Пауза(1);
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЦикла;
КонецФункции

//&НаСервере
//&Вместо("РассчитатьСкидкиНаценкиНаСервере")
//Функция алсав_РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ВзятьИзВременногоХранилища)
//	// Вставить содержимое метода.
//	Результат = ПродолжитьВызов(СтруктураПараметры, ВзятьИзВременногоХранилища);
//	
//	Для Каждого стр из Объект.Товары Цикл
//		Если НЕ ЗначениеЗаполнено(Стр.ВидЦены) Тогда
//			Стр.ПроцентАвтоматическойСкидки = 0;
//			Стр.СуммаРучнойСкидки = 0;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Результат;
//КонецФункции

&НаКлиенте
Функция получитьСписокСкладов()
	результ = новый СписокЗначений(); 
	результ.Добавить(Объект.Склад);
	возврат результ;
КонецФункции


&НаКлиенте
Функция получитьСписокЗаказов()
	результ = новый СписокЗначений(); 
	результ.Добавить(Объект.Ссылка);
	возврат результ;
КонецФункции


&НаСервере
Функция получитьВидЦены()
	Возврат Справочники.ВидыЦен.НайтиПоНаименованию("Отпускная цена (без НДС)");
КонецФункции

//&НаКлиенте
//Процедура ОткрытьВнешнююОбработку(Команда)
//    ОткрытьВнешнийОтчетОбработкуПоИмениСДопПараметрами ("ВнешняяОбработкаПример", Неопределено, Ложь); 
//КонецПроцедуры

//// Открытие внешней обработки с передачей параметров
//&НаКлиенте
//Процедура ОткрытьВнешнююОбработкуСПараметром(Команда)
//    ПараметрыОбработки = Новый Структура;
//    ПараметрыОбработки.Вставить(НазваниеПараметра, ЗначениеПараметра);
//    ОткрытьВнешнийОтчетОбработкуПоИмениСДопПараметрами ("ВнешняяОбработкаПример", ПараметрыОбработки, Ложь);
//КонецПроцедуры

// Открытие внешнего отчета СКД без параметров 
&НаКлиенте
Процедура ОткрытьВнешнийОтчетВО_АнализДоступностиРаскрытиеСборок(Команда)
	
	
    ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
    //ПараметрыОтчета.Вставить("АдресНастроек"          , АлресХранилища);
    ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
    //ПараметрыОтчета.Вставить("ИДРасшифровки"          , ИмяОтчета);
    //ПараметрыОтчета.Вставить("РежимРасшифровки"       , Истина);
    //ПараметрыОтчета.Вставить("ЗаполняемыеНастройки"   , ЗаполнятьТиповыеНастройки);
    
    //Ну и открываем саму форму
	
	//ф = ПолучитьФорму("Отчет.ВО_АнализДоступностиРаскрытиеСборок.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	//ф.УстановитьТекущийВариант("ВО_АнализДоступностиРаскрытиеСборок_Док");
	
	ф = ПолучитьФорму("Отчет.ВО_АнализДоступностиРаскрытиеСборокХарактеристики.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант("ВО_АнализДоступностиРаскрытиеСборок_ДокХарактеристики");
	
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(элемент.Параметр) = "ВидЦены" Тогда
				элемент.Значение = получитьВидЦены();
			ИначеЕсли Строка(элемент.Параметр) = "ОтборСклады" Тогда
				элемент.Использование = Истина;
				элемент.Значение = получитьСписокСкладов();
			ИначеЕсли Строка(элемент.Параметр) = "ОтборЗаказКлиента" Тогда
				элемент.Использование = Истина;
				элемент.Значение = получитьСписокЗаказов();
			ИначеЕсли Строка(элемент.Параметр) = "ПроцентОплаты" Тогда
				элемент.Использование = Истина;
				элемент.Значение = 0;
			Иначе
				элемент.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	ф.Открыть();
    //ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма.ФормаОтчета", ПараметрыОтчета,ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЭлементОтбораКомпоновкиДанных(ОтборНастройкиКомпоновкиДанных,Использование,ВидСрав,ИмяПоля,ЗначениеОтбора)
    
    НовыйЭлемент = ОтборНастройкиКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    
    НовыйЭлемент.Использование  = Использование;
    НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);
    НовыйЭлемент.ВидСравнения   = ВидСрав;
    НовыйЭлемент.ПравоеЗначение = ЗначениеОтбора;
    
КонецПроцедуры


// процедура, открывающая отчет/обработку по имени, заданному в допобработках
&НаКлиенте
Процедура ОткрытьВнешнийОтчетОбработкуПоИмениСДопПараметрами(ИмяОтчетаОбработки, ПараметрыОткрытия, ЭтоОтчет, РодительскаяФорма = Неопределено)
    ВнешнийОтчетОбработкаДляОткрытияСсылка = ПолучитьСсылкуНаВнешнийОтчетОбработкуПоИмениНаСервере (ИмяОтчетаОбработки);  
     // ВЫЗОВ ИЗ БСП ФУНКЦИИ ПОДКЛЮЧЕНИЯ ВНЕШНЕЙ ОБРАБОТКИ
    ИмяОбработкиСлужебное = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешнийОтчетОбработкаДляОткрытияСсылка);
    Если ЭтоОтчет Тогда
        ОткрытьФорму("ВнешнийОтчет." + ИмяОбработкиСлужебное + ".Форма", ПараметрыОткрытия, РодительскаяФорма);
    Иначе
        ОткрытьФорму("ВнешняяОбработка." + ИмяОбработкиСлужебное + ".Форма", ПараметрыОткрытия, РодительскаяФорма);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнешнийОтчетОбработкуПоИмениНаСервере(ИмяОтчетаОбработки)
    Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяОтчетаОбработки).Ссылка;
КонецФункции

&НаКлиенте
Процедура алсав_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
КонецПроцедуры

&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	полныеПрава = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.ПолныеПрава.Имя);

	ЭтаФорма.Элементы.Товарыалсав_ПолучитьДанныеПоСметам.Видимость = полныеПрава;
	ЭтаФорма.Элементы.Товарыалсав_ПолучитьДанныеПоСметам.Доступность = полныеПрава;
	
	ЭтаФорма.Элементы.алсав_СформироватьСборки.Доступность = полныеПрава ИЛИ
		УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоАвтоматическоеСозданиеСборок.Имя);
		
	ЭтаФорма.Элементы.ТоварыКонтекстноеМенюалсав_СобратьВыбраннуСтроку.Доступность = ЭтаФорма.Элементы.алсав_СформироватьСборки.Доступность;
		
КонецПроцедуры

&НаСервере
&Вместо("РассчитатьСкидкиНаценкиНаСервере")
Функция алсав_РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ВзятьИзВременногоХранилища)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(СтруктураПараметры, ВзятьИзВременногоХранилища);
	тмп = Новый Структура;
	тмп.Вставить("ПрименятьКОбъекту",                Истина);
	тмп.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	тмп.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	тмп.Вставить("УправляемыеСкидки", УправляемыеСкидки);

	Если СтруктураПараметры = неопределено Тогда
		СтруктураПараметры = тмп;
	Иначе
		ЗаполнитьЗначенияСвойств(СтруктураПараметры,тмп);
	КонецЕсли;
	
	Результат = ПродолжитьВызов(СтруктураПараметры, Ложь);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура алсав_СоглашениеПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	алсав_СоглашениеПриИзмененииПослеСервер();
КонецПроцедуры


&НаСервере
Процедура алсав_СоглашениеПриИзмененииПослеСервер()
	// Вставить содержимое обработчика.
	
	строкаУИ = алсав_ДопРеквизиты.ПолучитьДопРеквизит(Объект.Соглашение,"УИ_СчетОрганизации");		
	
	Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьПоСтрокеУИ(строкаУИ);
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		//ОрганизацияПриИзмененииСервер();
		ДенежныесредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(Объект.Организация,Объект.БанковскийСчет)
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		Если Объект.БанковскийСчет.ПометкаУдаления = ИСТИНА Тогда
			Сообщить("Банковский счет организации помечен на удаление!");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьПодчиненныеСвойстваПоСтатистике")
Процедура алсав_ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
	// Вставить содержимое метода.
	
	кэшБанковскийСчет = Объект.БанковскийСчет;
	ПродолжитьВызов(ИмяРеквизитаРодителя);
	
	Объект.БанковскийСчет = кэшБанковскийСчет;
КонецПроцедуры


&НаСервере
Процедура Проверить_Контрольсборок_ЕстьОшибка()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Свод.ЗаказКлиента КАК ЗаказКлиента,
	               |	Свод.Номенклатура КАК Номенклатура,
	               |	Свод.Характеристика КАК Характеристика,
	               |	СУММА(Свод.Требуется) КАК Требуется,
	               |	СУММА(Свод.Собрано) КАК Собрано,
	               |	СУММА(Свод.Собрано) > СУММА(Свод.Требуется) КАК ЕстьОшибка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |		ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |		ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |		ЗаказКлиентаТовары.Количество КАК Требуется,
	               |		0 КАК Собрано
	               |	ИЗ
	               |		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |	ГДЕ
	               |		ЗаказКлиентаТовары.Ссылка = &Заказа
	               |		И ЗаказКлиентаТовары.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	               |		И ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЗаказНаСборку.ДокументОснование,
	               |		ЗаказНаСборку.Номенклатура,
	               |		ЗаказНаСборку.Характеристика,
	               |		0,
	               |		ЗаказНаСборку.Количество
	               |	ИЗ
	               |		Документ.ЗаказНаСборку КАК ЗаказНаСборку
	               |	ГДЕ
	               |		ЗаказНаСборку.ДокументОснование = &Заказа
	               |		И ЗаказНаСборку.Проведен
	               |		И ЗаказНаСборку.ДокументОснование.Проведен = ИСТИНА) КАК Свод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Свод.ЗаказКлиента,
	               |	Свод.Номенклатура,
	               |	Свод.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(Свод.Собрано) > СУММА(Свод.Требуется)";
	
	Запрос.УстановитьПараметр("Заказа",Объект.Ссылка);
	
	
	естьОшибка = Ложь;
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		естьОшибка = истина;
		Сообщить("Собрано больше чем требуется ["+рез.Номенклатура+"], требуется = "+рез.Требуется + ", собрано = "+рез.Собрано);
	КонецЦикла;
	
	Элементы.ОшибкаСобраноБольшеЧемПотребность.Видимость = естьОшибка;
КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_ПолучитьДанныеПоСметамПосле(Команда)
	// Вставить содержимое обработчика.
	//тч = алсав_алсав_ПолучитьДанныеПоСметамПослеСервер();
	
	тч = Новый ТабличныйДокумент;
	массивФайлов = ПолучитьМассивФайлов();
	адресаВХранилище = новый Соответствие();
	Для Каждого файлСметы ИЗ массивФайлов Цикл 
		Файл = Новый ДвоичныеДанные(файлСметы);
		Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
		тч = АгрегатСмет(тч,Адрес,файлСметы);
		//адресаВХранилище.Вставить(Адрес,файлСметы);
		//таблДокСметы = алсав_ЗагрузитьИзСметыСерверПосле(Адрес,файлСметы);
		//тч.Вывести(таблДокСметы);
	КонецЦикла;
	
	
	тч.Показать("Заказ "+Объект.Номер);
КонецПроцедуры


&НаСервереБезКонтекста
Функция АгрегатСмет(тч,адресаВХранилище,файлСметы)
	Если ЛОЖЬ Тогда адресаВХранилище = новый Соответствие(); КонецЕсли;
	
	
	//Для Каждого эл из адресаВХранилище Цикл
	//	файлСметы = эл.Значение; 
	//	адресаВХранилище = эл.Ключ;
		сметаДанные= алсав_ЗагрузитьИзСметыВМассивСтруктур(адресаВХранилище, файлСметы);
		сметаТД = Новый ТабличныйДокумент;
		сметаТД.Область("R1C3:R1C3").Текст = файлСметы; 
		
		строка = 1;
		Для Каждого стрСметы Из сметаДанные Цикл
		    строка = строка + 1;
			столб = 0;
			Для Каждого эл Из стрСметы Цикл
				столб = столб + 1;
				сметаТД.Область(строка,столб,строка,столб).Текст = эл.Значение;
			КонецЦикла;
		КонецЦикла; 
		тч.Вывести(сметаТД);
	//КонецЦикла;
	
	Возврат тч;
КонецФункции

&НаСервере
Функция ПолучитьМассивФайлов()
	Результ = новый Массив;
	
	тч = Объект.Товары.Выгрузить();
	тч.Сортировать("НомерСтроки");
	
	инд = 0;
	Для Каждого стр из тч Цикл
		инд = инд + 1;
		
		Если инд > 4 Тогда
			//BREAK;
		КонецЕсли;
		
		компл = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(стр.Номенклатура, стр.Характеристика);
		Если ЗначениеЗаполнено(компл) Тогда
			файлСметы = алсав_ДопРеквизиты.ПолучитьДопСведение(компл,"Файл сметы");
			
			Если ЗначениеЗаполнено(файлСметы) Тогда
				Результ.Добавить(файлСметы);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	Возврат Результ;
КонецФункции

&НаСервереБезКонтекста
Функция алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес, исходныйФайл)
	
	Возврат Справочники.ВариантыКомплектацииНоменклатуры.алсав_ЗагрузитьИзСметыВМассивСтруктур(Адрес, исходныйФайл);
	
КонецФункции



&НаКлиенте
Функция ДобавитьПозиции(мНоменклатура) ЭКСПОРТ
	Для Каждого стр из мНоменклатура Цикл
		нСтр = ЭтаФорма.Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(нСтр, стр);
		нСтр.Количество = 1;
		нСтр.КоличествоУпаковок = 1;
		нСтр.ВариантОбеспечения = ПолучитьВариантОбоеспечения_Требуется();
		нСтр.Цена = 100;
		нСтр.СтавкаНДС = ПолучитьСтавкуНДС_БезНДС();
		нСтр.СуммаНДС = 0;
		нСтр.СуммаСНДС = 100;
		нСтр.Сумма = 100;
		
	КонецЦикла;
	
	Для Каждого стр из ЭтаФорма.Объект.Товары Цикл
		ЭтаФорма.Элементы.Товары.ТекущаяСтрока = стр.ПолучитьИдентификатор();
		ТоварыЦенаПриИзменении(ЭтаФорма.Элементы.Товары);
	КонецЦикла;
	
	ЭтаФорма.Объект.СкидкиРассчитаны = Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДС_БезНДС()
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОрганизация_Производство()
	Возврат Справочники.Организации.НайтиПоНаименованию("ООО ""АЛСАВ""");
КонецФункции

&НаКлиенте
Процедура алсав_алсав_СоздатьПеремещениеСПроизводстваПосле(Команда)
	// Вставить содержимое обработчика.
	складОтКуда = ПолучитьСклад_Производство();
	складКуда = ЭтаФорма.Объект.Склад;
	
	ф = ПолучитьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта");
	ЗаполнитьЗначенияСвойств(ф.Объект,этаФорма.Объект,"Организация");
	
	ф.Открыть();
	
	ф.Объект.Организация = ПолучитьОрганизация_Производство();
	//ф.Объект.ОрганизацияПолучатель = ф.Объект.Организация;
	
	ф.Объект.СкладОтправитель = складОтКуда;
	ф.Объект.СкладПолучатель = складКуда;
	ф.Объект.ДокументОснование = ЭтаФорма.Объект.Ссылка;
	
	Для Каждого стр из ЭтаФорма.алса_Дефицит Цикл
		Если ЗначениеЗаполнено(стр.Дефицит) И ЗначениеЗаполнено(стр.ОстаткиОбуховоПроизводство) Тогда
			колВо = ?(стр.Дефицит<=стр.ОстаткиОбуховоПроизводство, стр.Дефицит, стр.ОстаткиОбуховоПроизводство);
			Если(колВо>0) Тогда
				нСтр = ф.Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нСтр,стр,"Номенклатура,Характеристика");
				нСтр.Количество = колВо;
				нСтр.КоличествоУпаковок = колВо;
				ф.Элементы.Товары.ТекущаяСтрока = нСтр.ПолучитьИдентификатор();
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СоздатьПеремещениеСОбуховоОсновнойПосле(Команда)
	// Вставить содержимое обработчика.
	складОтКуда = ПолучитьСклад_ОбуховоОсновной();
	складКуда = ЭтаФорма.Объект.Склад;
	
	ф = ПолучитьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта");
	ЗаполнитьЗначенияСвойств(ф.Объект,этаФорма.Объект,"Организация");
	
	ф.Открыть();
	
	ф.Объект.Организация = ПолучитьОрганизация_Производство();
	//ф.Объект.ОрганизацияПолучатель = ф.Объект.Организация;
	
	ф.Объект.СкладОтправитель = складОтКуда;
	ф.Объект.СкладПолучатель = складКуда;
	ф.Объект.ДокументОснование = ЭтаФорма.Объект.Ссылка;
	
	Для Каждого стр из ЭтаФорма.алса_Дефицит Цикл
		Если ЗначениеЗаполнено(стр.Дефицит) И ЗначениеЗаполнено(стр.ОстаткиОбуховоОсновной) Тогда
			колВо = ?(стр.Дефицит<=стр.ОстаткиОбуховоОсновной, стр.Дефицит, стр.ОстаткиОбуховоОсновной);
			Если(колВо>0) Тогда
				нСтр = ф.Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нСтр,стр,"Номенклатура,Характеристика");
				нСтр.Количество = колВо;
				нСтр.КоличествоУпаковок = колВо;
				ф.Элементы.Товары.ТекущаяСтрока = нСтр.ПолучитьИдентификатор();
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ЗаполнитьЗаданиеПакетЗаказПоставщикуПосле(Команда)
	парамс = Новый Структура;
	парамс.Вставить("РежимВыбора",Истина);
	парамс.Вставить("МножественныйВыбор",ЛОЖЬ); 

	ОбработкаВыбора = Новый ОписаниеОповещения("алсав_алсав_ЗаполнитьЗаданиеПакетНомерПослеЗавершение", ЭтаФорма,"ПодборЗаказПоставщику");

	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора",парамс,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ЗаполнитьЗаданиеПакетНомерПосле(Команда)
	Оповещение = Новый ОписаниеОповещения("алсав_алсав_ЗаполнитьЗаданиеПакетНомерПослеЗавершение", ЭтотОбъект);
	Подсказка = "Введите пакет";
	пакет = 0;
	ПоказатьВводЧисла(Оповещение, пакет, Подсказка, 10, 0);
КонецПроцедуры

&НаКлиенте 
Процедура алсав_алсав_ЗаполнитьЗаданиеПакетНомерПослеЗавершение(пакет, ДополнительныеПараметры) Экспорт 
	
	Если Не пакет = Неопределено Тогда
		алсав_ЗаполнитьЗаданиеПакетУВыделенных(пакет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция алсав_ЗаполнитьЗаданиеПакетУВыделенных(заданиеПакек)
	Для Каждого идСтроки из ЭтаФорма.Элементы.Товары.ВыделенныеСтроки Цикл
		стр = ЭтаФорма.Объект.Товары.НайтиПоИдентификатору(идСтроки);
		Если стр.ЗаданиеПакет = неопределено ИЛИ НЕ ЗначениеЗаполнено(стр.ЗаданиеПакет) Тогда
			стр.ЗаданиеПакет = заданиеПакек;			
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура алсав_ПриОткрытииПосле(Отказ)
	// Вставить содержимое обработчика.  
	к = 1;
КонецПроцедуры

         

&НаКлиенте
Процедура алсав_ОбъединитьОдинаковыеПозицииПосле(Команда)
	массивИдентификаторовСтрок = ЭтаФорма.Элементы.Товары.ВыделенныеСтроки;
	алсав_ОбъединитьОдинаковыеПозицииПослеСервер(массивИдентификаторовСтрок);КонецПроцедуры


&НаСервере
Процедура алсав_ОбъединитьОдинаковыеПозицииПослеСервер(массивИдентификаторовСтрок)
	
	Количество = 0;
	Сумма = 0;
	СуммаНДС = 0;
	СуммаСНДС = 0;
	
	номен = неопределено;
	характеристика = Неопределено;
	
	разбивкаПоНоменклатуре = новый Соответствие;
	
	Для Каждого идент из массивИдентификаторовСтрок Цикл  
		стр = Объект.Товары.НайтиПоИдентификатору(идент);
		ключ = стр.Номенклатура;
		Если ЗначениеЗаполнено(стр.Характеристика) Тогда
			ключ = стр.Характеристика;
		КонецЕсли;
		
		набор = разбивкаПоНоменклатуре.Получить(ключ);
		Если набор = Неопределено Тогда                  
			набор = Новый Массив;
			разбивкаПоНоменклатуре.Вставить(ключ, набор);
		КонецЕсли;
		
		набор.Добавить(стр);
	КонецЦикла;
	
	Для Каждого элементРазбивки из разбивкаПоНоменклатуре Цикл
		набор = элементРазбивки.Значение;
		Если ЛОЖЬ Тогда набор = новый Массив; КонецЕсли;
		Если набор.Количество() > 1 Тогда     
			
			Количество = 0;
			КоличествоУпаковок = 0;
			Сумма = 0;
			СуммаНДС = 0;
			СуммаСНДС = 0;
			
			стрПервый = набор[0];
			
			Для Каждого стр из набор Цикл
				
				Количество = Количество + стр.Количество;
				КоличествоУпаковок = КоличествоУпаковок + стр.КоличествоУпаковок;
				Сумма = Сумма + стр.Сумма;
				СуммаНДС = СуммаНДС + стр.СуммаНДС;
				СуммаСНДС = Количество + стр.СуммаСНДС;
				
				Если стр <> стрПервый Тогда
					Объект.Товары.Удалить(стр);
				КонецЕсли;
			КонецЦикла;
			
			стрПервый.Количество = Количество;
			стрПервый.КоличествоУпаковок = КоличествоУпаковок;
			стрПервый.Сумма = Сумма;
			стрПервый.СуммаНДС = СуммаНДС;
			стрПервый.СуммаСНДС = СуммаСНДС;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
&Вместо("НалогообложениеНДСПриИзмененииСервер")
Процедура алсав_НалогообложениеНДСПриИзмененииСервер(КэшированныеЗначения)

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, ПоДатеОтгрузки", Объект.НалогообложениеНДС, Объект.Дата, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	///+++++++++++
	СтруктураДействий.ЗаполнитьСтавкуНДС.Вставить("Данные_Организация",Объект.Организация); 
	///-----------
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);


КонецПроцедуры

&НаКлиенте
Процедура алсав_ТоварыНоменклатураПриИзмененииВместо(Элемент)
	//Вставить содержимое обработчика          
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, ПоДатеОтгрузки", Объект.НалогообложениеНДС, Объект.Дата, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
		
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);             
	
	///+++++++++++
	СтруктураДействий.ЗаполнитьСтавкуНДС.Вставить("Данные_Организация",Объект.Организация); 
	///-----------

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
КонецПроцедуры





















