
&После("ДобавитьКомандыПечати")
Процедура алсав_ДобавитьКомандыПечати(КомандыПечати)
	// Вставить содержимое метода.
	
		// Заказ поставщику склад
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
		КомандаПечати.Идентификатор = "ЗаказПоставщикуСклад";
		КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику склад'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщикуСклад");
КонецПроцедуры
