
&После("ДобавитьКомандыПечати")
Процедура алсав_ДобавитьКомандыПечати(КомандыПечати)
	// Вставить содержимое метода.
	
		// Заказ поставщику склад
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
		КомандаПечати.Идентификатор = "ЗаказПоставщикуСклад";
		КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику склад'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщикуСклад");
КонецПроцедуры


Процедура ЗаполнитьВариантДоставки(ссылкаНаОбъект) ЭКСПОРТ
	
	этоСсылка = (ТипЗнч(ссылкаНаОбъект) <> Тип("ДокументОбъект.ЗаказПоставщику"));
		
	об = ссылкаНаОбъект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	др.Ссылка КАК Ссылка,
	               |	др.Ссылка КАК ЗаказПоставщику,
	               |	др.Значение КАК Значение
	               |ИЗ
	               |	Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК др
	               |ГДЕ
	               |	др.Ссылка = &тнСсылка
	               |	И др.Свойство.Заголовок = ""Вариант доставки""";  
	
	Запрос.УстановитьПараметр("тнСсылка",ссылкаНаОбъект.Ссылка);  
	
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда 
		Если ЗначениеЗаполнено(рез.Значение) Тогда			
			Если этоСсылка Тогда
				об = рез.Ссылка.ПолучитьОбъект();
				об.алсав_ВариантДоставки = рез.Значение;
				об.ОбменДанными.Загрузка = истина;
				об.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				об.алсав_ВариантДоставки = рез.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры