
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	РасчетатьЗакупочныеЦены();
КонецПроцедуры


&НаСервере 
Функция РасчетатьЗакупочныеЦены()
	Документы.УстановкаЦенНоменклатуры.РасчетатьЗакупочныеЦены();
КонецФункции