
&НаСервере
Процедура алсав_алсав_ЗаменитьВариантОтчетаПослеНаСервере(новыйОтчет)
	// Вставить содержимое обработчика.
	
	выделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	для каждого стр из выделенныеСтроки Цикл          
		Если НЕ стр.Ссылка.ЭтоГруппа Тогда
			об = стр.Ссылка.ПолучитьОбъект();
			об.Отчеты.Очистить();
			нСтр = об.Отчеты.Добавить();
			нСтр.Отчет = новыйОтчет;
			об.Записать();
       	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ИсключаемыеОтчеты()
	возврат РассылкаОтчетовПовтИсп.ИсключаемыеОтчеты();
КонецФункции

&НаКлиенте
Процедура алсав_алсав_ЗаменитьВариантОтчетаПосле(Команда)
	//алсав_алсав_ЗаменитьВариантОтчетаПослеНаСервере();
	
	ВыбранныеЗначения = Новый СписокЗначений;
	
	ОтборВыбора = Новый Структура;
	ОтборВыбора.Вставить("ТипОтчета", 1);
	ОтборВыбора.Вставить("Отчет", Новый Структура("Вид, Значение", "НеВСписке", ИсключаемыеОтчеты()));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор",              ОтборВыбора);
	ПараметрыФормыВыбора.Вставить("ВыбранныеЗначения",  ВыбранныеЗначения);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВариантыОтчетовФормаВыбора", ЭтаФорма);

	ОткрытьФорму("Справочник.ВариантыОтчетов.ФормаВыбора",ПараметрыФормыВыбора,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры
		
&НаКлиенте
Процедура ПослеВариантыОтчетовФормаВыбора(Значение, ДопПараметры) Экспорт

	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
    КонецЕсли;
    алсав_алсав_ЗаменитьВариантОтчетаПослеНаСервере(Значение);
КонецПроцедуры	
		
