Функция Документы_ЗаполнитьФормализованныйКонтентXML_ДО(Документ, ПроверятьXDTO) ЭКСПОРТ
	//Сообщить(Документ);
	
	Если (ТипЗнч(Документ.ДокументУчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
		или ТипЗнч(Документ.ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		
		Если (Лев(Документ.ИдентификаторВида,6)="ID_УПД") Тогда
			
			док = Документ.ДокументУчета;                                             
			Если (ТипЗнч(Документ.ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")) Тогда
				Если ЛОЖЬ Тогда док = Документы.РеализацияТоваровУслуг.ПустаяСсылка(); КонецЕсли;
				док = док.ДокументОснование;
			КонецЕсли;
			
			Если ЛОЖЬ Тогда док = Документы.РеализацияТоваровУслуг.ПустаяСсылка(); КонецЕсли;
			Если СтрНайти(док.Контрагент.Наименование, "Экспресс офис") = 0 Тогда
				Возврат 0;
			КонецЕсли;
			
			инд = 0;                             
			массивРазвёртка = новый Массив();
			//Для Каждого стр из док.Товары Цикл
			//	
			//	состав = ПолучитьРазвёрнутыйСостав(стр.Номенклатура, стр.Характеристика, стр.Количество);
			//	Если состав <> неопределено Тогда
			//		массивРазвёртка.Добавить(Новый Структура("инд, состав", инд, состав));
			//	КонецЕсли;
			//	
			//	инд = инд+1;
			//КонецЦикла; 
			
			Для Каждого стр из Документ.СлужебнаяИнформация.Контент.Table.Items Цикл
				
				состав = ПолучитьРазвёрнутыйСостав(стр.СлужебнаяИнформация.Номенклатура, стр.СлужебнаяИнформация.Характеристика, стр.Quantity);
				Если состав <> неопределено Тогда
					массивРазвёртка.Добавить(Новый Структура("инд, состав", инд, состав));
				КонецЕсли;
				
				инд = инд+1;
			КонецЦикла;
			
			
			индексПоследнего = массивРазвёртка.ВГраница();
			Для индЭл = -индексПоследнего По 0 Цикл
				эл = массивРазвёртка[-индЭл];
				
				таргетМассив = Документ.СлужебнаяИнформация.Контент.Table.Items;
				
				индексПоследнегоВСоставе = эл.состав.ВГраница();
				Для индСостав = -индексПоследнегоВСоставе По 0 Цикл	
					элСостава = эл.состав[-индСостав];
					топ = таргетМассив[эл.инд];
					
					
					новыйЭл = КопироватьСтруктуруСтруктуры(топ);
					новыйЭл.Product = элСостава.Артикул + " " + элСостава.ПредставлениеНоменклатуры;
					новыйЭл.ItemVendorCode = элСостава.Артикул;
					новыйЭл.ItemMark = "Property";
					новыйЭл.WithoutVat = "false"; 
					новыйЭл.UnitName = Строка(элСостава.ЕдИзм.Наименование);
					новыйЭл.Unit = Строка(элСостава.ЕдИзм.Код);
					
					новыйЭл.Quantity = элСостава.Количество;
					новыйЭл.Price = 0;
					новыйЭл.Subtotal = 0;
					новыйЭл.SubtotalWithVatExcluded = 0;
					новыйЭл.TaxRate = "20";

					
					новыйЭл.СлужебнаяИнформация.ДокументОтгрузки = топ.СлужебнаяИнформация.ДокументОтгрузки; 
					новыйЭл.СлужебнаяИнформация.ЕдиницаИзмерения = элСостава.ЕдИзм;
					новыйЭл.СлужебнаяИнформация.Номенклатура = элСостава.Номенклатура;
					новыйЭл.СлужебнаяИнформация.Характеристика = элСостава.Характеристика;
					//новыйЭл.СлужебнаяИнформация.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
					новыйЭл.СлужебнаяИнформация.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					новыйЭл.СлужебнаяИнформация.ПрослеживаемыйТовар = Ложь;
					
					таргетМассив.Вставить(эл.инд+1, новыйЭл);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецФункции                                             


Функция Документы_ЗаполнитьФормализованныйКонтентXML_ПОСЛЕ(Документ, ПроверятьXDTO) ЭКСПОРТ
	//Сообщить(Документ);
КонецФункции 


Функция ПолучитьРазвёрнутыйСостав(Номенклатура, Характеристика, колВо)
	резалт = Новый Массив;
	Вар = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(Номенклатура,Характеристика);
	Если ЗначениеЗаполнено(Вар) Тогда					
		кк=0;
		Для каждого стрК из Вар.Товары Цикл
			кк = кк + 1;
			структураСтроки = СформироватьСтруктуруСтрокиСостава(стрК, колВо);
			структураСтроки.Вставить("позиция",""+кк);                        
			резалт.Добавить(структураСтроки);
			Вар1=Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(СтрК.ВариантКомлектации.Владелец,СтрК.ВариантКомлектации.Характеристика);
			кк1 = 0;
			Если ЗначениеЗаполнено(Вар1) Тогда
				Для каждого стрК1 из Вар1.Товары Цикл
					кк1 = кк1 + 1;
					структураСтроки = СформироватьСтруктуруСтрокиСостава(стрК1, колВо);
					структураСтроки.Вставить("позиция",""+кк+"."+кк1);
					резалт.Добавить(структураСтроки);
				КонецЦикла;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	
	возврат резалт;
КонецФункции  

Функция СформироватьСтруктуруСтрокиСостава(стрК, колВо)
	резалт = Новый Структура();
	
	
	ПредставлениеНоменклатуры = "" + стрК.Номенклатура.НаименованиеПолное;
	Если ЗначениеЗаполнено(стрК.Характеристика) Тогда 
		ПредставлениеНоменклатуры = ПредставлениеНоменклатуры + " (" + стрК.Характеристика+")"; 
	КонецЕсли;
	Артикул = стрК.Номенклатура.Артикул;
	Количество = СтрК.Количество * колВо;
	ЕдИзм = стрК.Номенклатура.ЕдиницаИзмерения;
	
	резалт.Вставить("ПредставлениеНоменклатуры",ПредставлениеНоменклатуры);
	резалт.Вставить("Артикул",Артикул);
	резалт.Вставить("Номенклатура",стрК.Номенклатура);
	резалт.Вставить("Характеристика",стрК.Характеристика);
	резалт.Вставить("Количество",Количество);
	резалт.Вставить("ЕдИзм",ЕдИзм);
	
	возврат резалт;
КонецФункции 

Функция КопироватьСтруктуруСтруктуры(прототип)
	резалт = новый структура;
	Если ЛОЖЬ Тогда прототип = новый Структура(); КонецЕсли;
	
	Для Каждого эл из прототип Цикл
		резалт.Вставить(эл.Ключ, Неопределено);
		
		Если ТипЗнч(эл.Значение) = Тип("Массив") Тогда
			резалт[эл.Ключ] = Новый Массив();
		КонецЕсли;
		
		Если ТипЗнч(эл.Значение) = Тип("Структура") Тогда
			резалт[эл.Ключ] = КопироватьСтруктуруСтруктуры(эл.Значение);
		КонецЕсли;
	КонецЦикла;
	
	возврат резалт;
КонецФункции