
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое метода. 
	//мИсключения = новый Массив;
	//мИсключения.Добавить(Пользователи.НайтиПоИмени("Администратор"));
	//текущийПользователь = Пользователи.ТекущийПользователь();
	//Если мИсключения.Найти(текущийПользователь) = неопределено Тогда
	//	
	//	Если Истина Тогда			
	//		Для Каждого запись из ЭтотОбъект Цикл
	//			запись.Период = ТекущаяДата();
	//			запись.Менеджер = текущийПользователь;
	//			
	//		конецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
                                      