
&НаКлиенте
Процедура алсав_ОтборПоСпискуАртикуловПосле(Команда)
	// Вставить содержимое обработчика.
	артикулы = "";
	оповещениеПослеВводаСпискаАртикулов = Новый ОписаниеОповещения("ПослеВводаСпискаАртикулов",ЭтаФорма,новый Структура());
	ПоказатьВводСтроки(оповещениеПослеВводаСпискаАртикулов,артикулы,"Отбор по списку артикулов",,Истина);
КонецПроцедуры

&НаКлиенте
Функция ПослеВводаСпискаАртикулов(стрАртикулы,параметры)экспорт
	Если стрАртикулы <> неопределено Тогда
		списокАртикулов = новый СписокЗначений();
		Если ЗначениеЗаполнено(стрАртикулы) Тогда
			Для Счетчик = 1 По СтрЧислоСтрок(стрАртикулы) Цикл
			    артикул = СтрПолучитьСтроку(стрАртикулы, Счетчик);
				списокАртикулов.Добавить(артикул);
			КонецЦикла;
		КонецЕсли;
		УстановитьОтборАртикулы(списокАртикулов);
	КонецЕсли;
КонецФункции


&НаКлиенте 
Функция УстановитьОтборАртикулы(списокАртикулов)
	Если ЛОЖЬ Тогда списокАртикулов = новый СписокЗначений() КонецЕсли;
	
	элементОтбораАртикул = неопределено;
	Для Каждого элОтбора из ЭтаФорма.СписокНоменклатура.Отбор.Элементы Цикл
		Если Строка(элОтбора.ЛевоеЗначение) = "Артикул" Тогда
			элементОтбораАртикул = элОтбора;
		КонецЕсли;
	КонецЦикла;
	Если элементОтбораАртикул = неопределено Тогда
		элементОтбораАртикул = ЭтаФорма.СписокНоменклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		элементОтбораАртикул.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Артикул");
	КонецЕсли;
	
	
	элементОтбораАртикул.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	элементОтбораАртикул.Использование = списокАртикулов.Количество() > 0;
	элементОтбораАртикул.ПравоеЗначение = списокАртикулов;
	
КонецФункции