Перем ОсновнойМодуль Экспорт;



Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт

	Если ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда

		Возврат ПодготовитьЭлектронныйДокумент(Параметры);

	КонецЕсли;

КонецФункции


// Обработчики событий подключаемого модуля

Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//Сообщить("ПодготовитьЭлектронныйДокумент");
	// Имя шаблона: Перезаполнение номеров документов УПД
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
				
		Content		= Параметры.Результат.Content;
		Документ1С 	= Параметры.Результат.Документ1С;

		ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
		
		Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый) Тогда
			
			УПД_ИзменитьНомераДокументов(Content, Документ1С);

		КонецЕсли;

		Возврат Истина;

	КонецЕсли;

КонецФункции


// Вспомогательные методы с бизнес-логикой

Процедура УПД_ИзменитьНомераДокументов(Content, Документ1С)
	         	
	Префикс = ДобавляемыйПрефикс(Документ1С);
	     	
	//Если НЕ ЗначениеЗаполнено(Префикс) Тогда
	//	Возврат;
	//КонецЕсли;

	УПД_ИзменитьНомерДокумента(Content, Префикс);
	
	УПД_ИзменитьНомераДокументовОтгрузки(Content, Префикс);
	
	УПД_ИзменитьНомераПлатежноРасчетныхДокументов(Content, Префикс, Документ1С);
	
	УПД_ИзменитьНомераДокументовОснованийОтгрузки(Content, Префикс);
	
КонецПроцедуры

Процедура УПД_ИзменитьНомерДокумента(Content, Префикс)
	
	Номер = Content.DocumentNumber;
	
	НовыйНомер = НомерСПрефиксом(Номер, Префикс); 
	
	УстановитьЗначениеXDTO(Content, "DocumentNumber", НовыйНомер);

КонецПроцедуры

Процедура УПД_ИзменитьНомераДокументовОтгрузки(Content, Префикс)
	
	DocumentShipments = Content.DocumentShipments;
		
	ВсегоДокументов = DocumentShipments.Количество();
	
	Если ВсегоДокументов = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	МаксИндекс = ВсегоДокументов - 1;
	
	Для инд = 0 По МаксИндекс Цикл
		
		DocumentShipment = DocumentShipments[инд];
		
		Номер = DocumentShipment.Number;
		
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			Продолжить;			
		КонецЕсли;
		
		НовыйНомер = НомерСПрефиксом(Номер, Префикс); 
		
		УстановитьЗначениеXDTO(DocumentShipment, "Number", НовыйНомер);
		
	КонецЦикла;

КонецПроцедуры

Процедура УПД_ИзменитьНомераПлатежноРасчетныхДокументов(Content, Префикс, Документ1С)
	
	PaymentDocuments = Content.PaymentDocuments;
		
	ВсегоДокументов = PaymentDocuments.Количество();
	
	Если ВсегоДокументов = 0 Тогда
		Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ТаблицаПлатежноРасчетныеДокументы = Новый ТаблицаЗначений;
			ТаблицаПлатежноРасчетныеДокументы.Колонки.Добавить("НомерПлатежноРасчетногоДокумента");
			ТаблицаПлатежноРасчетныеДокументы.Колонки.Добавить("ДатаПлатежноРасчетногоДокумента");
			
			СписокОснований = Новый СписокЗначений;
			Если ЛОЖЬ Тогда Документ1С = Документы.СчетФактураВыданный.ПустаяСсылка(); КонецЕСли;
			Для Каждого ДокументыОснованияСтр из Документ1С.ДокументыОснования Цикл
				СписокОснований.Добавить(ДокументыОснованияСтр.ДокументОснование);
			КонецЦикла;
			
			Документы.СчетФактураВыданный.ЗаполнитьПлатежноРасчетныеДокументы(
				ТаблицаПлатежноРасчетныеДокументы,
				СписокОснований.ВыгрузитьЗначения(),
				Документ1С.Организация
			);
				
			Для Каждого РезСтр из ТаблицаПлатежноРасчетныеДокументы Цикл
				НоваяЗвпись = Content.Фабрика().Создать(Content.PaymentDocuments.ВладеющееСвойство.Тип);
				УстановитьЗначениеXDTO(НоваяЗвпись, "Number", РезСтр.НомерПлатежноРасчетногоДокумента);
				УстановитьЗначениеXDTO(НоваяЗвпись, "Date", РезСтр.ДатаПлатежноРасчетногоДокумента);
				PaymentDocuments.Добавить(НоваяЗвпись);	
			КонецЦикла;
				

		КонецЕсли;	
	КонецЕсли;
	
	МаксИндекс = ВсегоДокументов - 1;
	
	Для инд = 0 По МаксИндекс Цикл
		
		PaymentDocumentInfo = PaymentDocuments[инд];
		
		Номер = PaymentDocumentInfo.Number;
		
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			Продолжить;			
		КонецЕсли;
		
		НовыйНомер = НомерСПрефиксом(Номер, Префикс); 
		
		УстановитьЗначениеXDTO(PaymentDocumentInfo, "Number", НовыйНомер);
		
	КонецЦикла;

КонецПроцедуры


Процедура ЗаполнитьПлатежноРасчетныеДокументыСервер()
	
	// ТаблицаПлатежноРасчетныеДокументы = ПлатежноРасчетныеДокументы.Выгрузить();
	
	// Документы.СчетФактураВыданный.ЗаполнитьПлатежноРасчетныеДокументы(
	//	ТаблицаПлатежноРасчетныеДокументы,
	//	СписокОснований.ВыгрузитьЗначения(),
	//	Организация);
	
	//ПлатежноРасчетныеДокументы.Загрузить(ТаблицаПлатежноРасчетныеДокументы);
	
КонецПроцедуры


Процедура УПД_ИзменитьНомераДокументовОснованийОтгрузки(Content, Префикс)
	
	TransferBases = Content.TransferInfo.TransferBases;
		
	ВсегоДокументов = TransferBases.Количество();
	
	Если ВсегоДокументов = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	МаксИндекс = ВсегоДокументов - 1;
	
	Для инд = 0 По МаксИндекс Цикл
		
		TransferBase = TransferBases[инд];
		
		Номер = TransferBase.Number;
		
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			Продолжить;			
		КонецЕсли;
		
		НовыйНомер = НомерСПрефиксом(Номер, Префикс); 
		
		УстановитьЗначениеXDTO(TransferBase, "Number", НовыйНомер);
		
	КонецЦикла;

КонецПроцедуры


// Общие функции для использования в обработчиках событий

Функция ДобавляемыйПрефикс(Документ1С)
	
	Результат = Неопределено;
	
	ДокументОснование = ДокументОснование(Документ1С);
	
	Если ДокументОснование.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Подразделение = ДокументОснование.ПодразделениеОрганизации;
	
	Если Подразделение.Метаданные().Реквизиты.Найти("Префикс") = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Подразделение.Префикс;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументОснование(Документ1С)

	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Результат = Документ1С.ДокументОснование;
	Иначе
		Результат = Документ1С;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция НомерСПрефиксом(Номер, Префикс)
	
	Возврат "" + Префикс + Номер;
	
КонецФункции

Процедура УстановитьЗначениеXDTO(Элемент, ИмяРеквизита, ЗначениеРеквизита, ЗаписыватьПустоеЗначениеТипа = Ложь)
	
	ЗаписыватьПустоеЗначение = (ТипЗнч(ЗначениеРеквизита) = Тип("Булево")) ИЛИ ЗаписыватьПустоеЗначениеТипа;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) И НЕ ЗаписыватьПустоеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Свойства().Получить(ИмяРеквизита) = Неопределено Тогда // у объекта XDTO отсутствует такое свойство
		Возврат;
	КонецЕсли;
	
	Элемент[ИмяРеквизита] = ЗначениеРеквизита;
	
КонецПроцедуры


// Общие функции подключаемого модуля (БСП и взаимодействие с основным модулем)

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ВыполнитьРегламентныеДействияПМ", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРегламентныеДействияПМ(Параметры)
	// Регламентные действия, НЕ требующие инициализации основного модуля
КонецПроцедуры

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4;
	
КонецФункции

Процедура ЭДО_СлужебнаяИнформацияГенератораШаблона()

	// Данный метод не выполняет кода и содержит только настройки построителя ПМ в момент генерации кода.
	// Предназначен для облегчения анализа изменений реального кода относительно шаблона.
	
	// ВерсияПостроителя: 1.8.0
	//{ Сценарии
	// Перезаполнение номеров документов УПД
	//} Сценарии

КонецПроцедуры