&НаКлиенте
Процедура Обновление_НДС_Корр(Элемент)
	РассчитатьИтоговыеПоказателиРеализации(ЭтаФорма);
	СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура алсав_РасхожденияСуммаНДСПриИзмененииПосле(Элемент)
	Обновление_НДС_Корр(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура алсав_РасхожденияСуммаПриИзмененииПосле(Элемент)
	Обновление_НДС_Корр(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура алсав_РасхожденияСуммаСНДСПриИзмененииПосле(Элемент)
	Обновление_НДС_Корр(Элемент);
КонецПроцедуры
