Функция ПолучитьДанныеСсайта()ЭКСПОРТ
	//https://next-meb.ru/relics.php 
   СоединениеHTTP = Новый HTTPСоединение("next-meb.ru", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
    // Получение текста страницы
    ЗапросHTTP = Новый HTTPЗапрос("/relics.php");
    РезультатЗапроса = СоединениеHTTP.Получить(ЗапросHTTP); // Get запрос
	Возврат jsonПрочитатьПлатформой(РезультатЗапроса.ПолучитьТелоКакСтроку());
КонецФункции


Функция jsonПрочитатьПлатформой(Значение)

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Значение);
    
    Результат = ПрочитатьJSON(ЧтениеJSON);
    
    ЧтениеJSON.Закрыть();
    
    Возврат Результат;

КонецФункции