
&После("УстановитьУсловноеОформлениеЕдиницИзмерения")
Процедура алсав_УстановитьУсловноеОформлениеЕдиницИзмерения(Форма,
													  ИмяПоляВводаЕдиницИзмерения = "ТоварыНоменклатураЕдиницаИзмерения",
													  ПутьКПолюОтбора = "Объект.Товары.Упаковка") Экспорт
	// Вставить содержимое метода.
	
	//Если ПутьКПолюОтбора = "Объект.Товары.Упаковка" Тогда 
	//	ПутьКПолюНоменклатураЕдИзм = "Объект.Товары.Номенклатура.ЕдиницаИзмерения";
	//	УсловноеОформление = Форма.УсловноеОформление;
	//	ЭлементыФормы = Форма.Элементы;
	//	
	//	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	//	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЕдиницИзмерения].Имя);

	//	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	//	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюНоменклатураЕдИзм);
	//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//	
	//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", истина);
	//КонецЕсли;
КонецПроцедуры

&Вместо("ПроверитьЗаполнениеУпаковок")
Процедура алсав_ПроверитьЗаполнениеУпаковок(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки)
	// Вставить содержимое метода.
	//ПродолжитьВызов(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки);
	
	Возврат;
КонецПроцедуры
