
&НаКлиенте
Процедура алсав_СоздатьОрдерДляСборкиПосле(Команда)
	алсав_СоздатьОрдерДляСборкиПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура алсав_СоздатьОрдерДляСборкиПослеНаСервере()
	// Вставить содержимое обработчика.
	Обработки.ПомошникСозданияСборок.СоздатьОрдерДляСборки(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура алсав_СоздатьОрдерДляСборкиРасходныйПослеНаСервере()
	// Вставить содержимое обработчика.
	Обработки.ПомошникСозданияСборок.СоздатьОрдерДляСборкиРасходный(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура алсав_СоздатьОрдерДляСборкиРасходныйПосле(Команда)
	алсав_СоздатьОрдерДляСборкиРасходныйПослеНаСервере();
КонецПроцедуры
