
&НаКлиенте
&Вместо("ПоказатьДиалогОтправкиПоПочте")
Процедура алсав_ПоказатьДиалогОтправкиПоПочте()
	// Вставить содержимое метода.
	//ПродолжитьВызов();
	
	Вложение = Новый Структура;
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(ОтчетТабличныйДокумент, УникальныйИдентификатор));
	Вложение.Вставить("Представление", ОтчетНаименованиеТекущегоВарианта);
	
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = ОтчетНаименованиеТекущегоВарианта;
		ПараметрыОтправки.Вложения = СписокВложений;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантОтчетаИзФайла(имяФайла)ЭКСПОРТ
	// Вставить содержимое метода.
	
	СвойстваВариантаОтчетаОснования = ВариантыОтчетовКлиент.СвойстваВариантаОтчетаОснования();
	СвойстваВариантаОтчетаОснования.Ссылка = НастройкиОтчета.ВариантСсылка;
	СвойстваВариантаОтчетаОснования.ИмяОтчета = НастройкиОтчета.ПолноеИмя;
	СвойстваВариантаОтчетаОснования.ПредставлениеВарианта = ПредставлениеТекущегоВарианта;
	
	полныйПутьКФайлуНаСервере = ПолучитьОбщуюПапкуНаСервере()+имяФайла;
	
	описаниеФайла = Новый Структура();
	описаниеФайла.Вставить("Хранение",ФайлССервераВоВременноеХранилище(УникальныйИдентификатор,полныйПутьКФайлуНаСервере));
	описаниеФайла.Вставить("Имя",полныйПутьКФайлуНаСервере);
	
	ВариантыОтчетовКлиент.ОбновитьВариантОтчетаИзФайла(описаниеФайла , СвойстваВариантаОтчетаОснования);	
	
	Для Каждого вариант из ЭтаФорма.ДобавленныеВарианты Цикл
		Если вариант.КлючВарианта = КлючТекущегоВарианта Тогда
			ПометитьНаУдаление(вариант.Ссылка);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПометитьНаУдаление(вхСсылка)
	об = вхСсылка.ПолучитьОбъект();
	об.УстановитьПометкуУдаления(истина);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбщуюПапкуНаСервере()
	текущаяБазаСтрока = СтрокаСоединенияИнформационнойБазы();
	текущаяБазаСтрока = СтрЗаменить(текущаяБазаСтрока,"""","");
	мКоннект = СтрРазделить(текущаяБазаСтрока,";");
	
	имяБазы = "";
	Сервер = "";
	
	Для Каждого стр из мКоннект Цикл
		Если СтрНачинаетсяС(стр, "Ref=") Тогда
			имяБазы = СтрЗаменить(стр, "Ref=", "") + ".";
		КонецЕсли;
	КонецЦикла;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;    
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	папка = "";
	//Если ЭтоLinuxКлиент Тогда
	//	папка = "D:\share\private\";
	//Иначе
	//	папка = "D:\share\private\";
	//КонецЕсли;
	папка="/app/private/reports/";
	
	Возврат папка + имяБазы;
КонецФункции
	
&НаСервереБезКонтекста
Функция ФайлССервераВоВременноеХранилище(УникальныйИдентификатор,полныйПутьКФайлуНаСервере)
	данные = Новый ДвоичныеДанные(полныйПутьКФайлуНаСервере);
    Адрес = ПоместитьВоВременноеХранилище(данные, УникальныйИдентификатор);
	Возврат Адрес;
КонецФункции

&НаКлиенте
&После("ОтчетТабличныйДокументОбработкаРасшифровки")
Процедура алсав_ОтчетТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое метода.
	
	ПолноеИмяОтчета = ЭтаФорма.НастройкиОтчета.ПолноеИмя;
	
	Если ПолноеИмяОтчета = "Отчет.ВО_ОстаткиИДоступностьТоваровСРаскрытиемСостава" Тогда
		
		СтруктураРасшифровки = ОтчетыУТВызовСервераПереопределяемый.СформироватьДанныеРасшифровки(Расшифровка, ЭтаФорма.ОтчетДанныеРасшифровки);
		
		Если СтруктураРасшифровки.Свойство("ВРезерве") ИЛИ СтруктураРасшифровки.Свойство("Котгрузке") Тогда
			СтандартнаяОбработка = Ложь;
			
			ОткрытьРашифровкуРезерва(СтруктураРасшифровки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры                    


&НаКлиенте
Функция ОткрытьРашифровкуРезерва(СтруктураРасшифровки)
	ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);

	ф = ПолучитьФорму("Отчет.ВО_РезервПоНеОплаченнымЗаказам.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант("ВО_РезервПоНеОплаченнымЗаказамНоменклатура");
	
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(элемент.Параметр) = "Характеристика" Тогда
				Если СтруктураРасшифровки.Свойство("Характеристика") И ЗначениеЗаполнено(СтруктураРасшифровки.Характеристика) Тогда
					элемент.Использование = Истина;
					элемент.Значение = СтруктураРасшифровки.Характеристика;
				КонецЕсли;
			ИначеЕсли (Строка(элемент.Параметр) = "Номенклатура") Тогда
				Если СтруктураРасшифровки.Свойство("Номенклатура") И ЗначениеЗаполнено(СтруктураРасшифровки.Номенклатура) Тогда
					элемент.Использование = Истина;
					элемент.Значение = СтруктураРасшифровки.Номенклатура;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ф.Открыть();
КонецФУнкции