Перем НаименованиеОтчета;
Перем ПредставлениеОтчета;

// минимальный набор для описания внешней обработки или отчета
//&НаКлиенте
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Наименование", НаименованиеОтчета);
	РегистрационныеДанные.Вставить("Версия", "0.1");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", ПредставлениеОтчета);
	ТЗКоманды = Новый ТаблицаЗначений;
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");
	СтрокаКоманды = ТЗКоманды.Добавить();
	СтрокаКоманды.Представление = ПредставлениеОтчета;
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	СтрокаКоманды.Идентификатор = НаименованиеОтчета;
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);
	Возврат РегистрационныеДанные;
КонецФункции


НаименованиеОтчета="ВО_АнализДоступностиРаскрытиеСборокХарактеристики";
ПредставлениеОтчета ="Анализ доступности, раскрытие сборок характеристики";