
&НаСервере
&Вместо("ДобавитьПодобраннуюНоменклатуру")
Процедура алсав_ДобавитьПодобраннуюНоменклатуру(КодСтроки, НайденнаяНоменклатура, НайденнаяХарактеристика, НайденнаяНоменклатураПартнера)
	
	найденнаяХарактеристикаСтрока = СокрЛП(Строка(НайденнаяХарактеристика));
	характеристикаИзТаблицы = СокрЛП(ТабличныйДокумент.Область(КодСтроки, 5).Текст);
	Если найденнаяХарактеристикаСтрока <> характеристикаИзТаблицы Тогда
		НайденнаяХарактеристика = неопределено;
	КонецЕсли;
	
	
	ПродолжитьВызов(КодСтроки, НайденнаяНоменклатура, НайденнаяХарактеристика, НайденнаяНоменклатураПартнера);
	
	
КонецПроцедуры
