
&Вместо("ОбновитьЗависимостиДополнительныхРеквизитов")
Процедура алсав_ОбновитьЗависимостиДополнительныхРеквизитов(Форма, Объект)
	// Вставить содержимое метода.
	
	
	Если НЕ Форма.Свойства_ИспользоватьСвойства
	 ИЛИ НЕ Форма.Свойства_ИспользоватьДопРеквизиты Тогда
		
		Возврат;
	КонецЕсли;
	
	
	мУдалить = Новый Массив;
	Для Каждого стр из Форма.Свойства_ОписаниеЗависимыхДополнительныхРеквизитов Цикл
		Если (стр.ИмяРеквизитаЗначение="ДополнительныйРеквизитЗначение_C1D59CC1xD372x4C83x8195x162740D97B80_3D96894Cx858Dx11EBxBBCCx001E678B6524") Тогда
			мУдалить.Добавить(стр);
		КонецЕсли;
	КонецЦикла;;
	
	Для Каждого стр из мУдалить Цикл
		Форма.Свойства_ОписаниеЗависимыхДополнительныхРеквизитов.Удалить(стр);
	КонецЦикла;
	
	ПродолжитьВызов(Форма, Объект);
КонецПроцедуры
