
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.Проведен и (не Отказ) Тогда
		полныеПрава = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.ПолныеПрава.Имя);
		правоПерепроведения = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ПравоРедактироватьПроведенных_ПриобретениеТоваровУслуг.Имя);
		Отказ = не(полныеПрава или правоПерепроведения);
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура алсав_ОбработкаПроведения(Отказ, РежимПроведения)
	Возврат;
	
	Если СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(ЭтотОбъект.Склад, ЭтотОбъект.Дата) Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказПоставщику) Тогда
			
			поступление = ЭтотОбъект;
			болванка = Новый Структура("Период,Склад,Отправитель,ХозяйственнаяОперация,Номенклатура,Характеристика");

			болванка.Период = поступление.Дата;
			//болванка.ВидДвижения = ВидДвиженияНакопления.Приход;
			болванка.Склад = поступление.Склад;
			болванка.Отправитель = поступление.Партнер;
			болванка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;

			Для Каждого стр из поступление.Товары Цикл
				
				болванка.Номенклатура = стр.Номенклатура;
				болванка.Характеристика = стр.Характеристика;
				
				//  КОформлениюОрдеров  //////////////////////////////////
				запись = поступление.Движения.ТоварыКПоступлению.Добавить();
				
				ЗаполнитьЗначенияСвойств(запись, болванка);	
				запись.ДокументПоступления = поступление.ЗаказПоставщику;
				запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				запись.КОформлениюОрдеров = стр.Количество;
				
				////////////////////////////////////
				запись = поступление.Движения.ТоварыКПоступлению.Добавить();
				
				ЗаполнитьЗначенияСвойств(запись, болванка);	
				запись.ДокументПоступления = поступление.Ссылка;
				запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				запись.КОформлениюОрдеров = стр.Количество;

				
				//  КОформлениюПоступленийПоОрдерам  //////////////////////////////////
				запись = поступление.Движения.ТоварыКПоступлению.Добавить();
				
				ЗаполнитьЗначенияСвойств(запись, болванка);	
				запись.ДокументПоступления = поступление.ЗаказПоставщику;
				запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				запись.КОформлениюПоступленийПоОрдерам = стр.Количество;
				
				////////////////////////////////////
				запись = поступление.Движения.ТоварыКПоступлению.Добавить();
				
				ЗаполнитьЗначенияСвойств(запись, болванка);	
				запись.ДокументПоступления = поступление.Ссылка;
				запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				запись.КОформлениюПоступленийПоОрдерам = стр.Количество;
								
								
			КонецЦикла;
			
			поступление.Движения.ТоварыКПоступлению.Записать(ИСТИНА);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
