&НаКлиенте
Процедура алсав_СоздатьСписаниеМатериаловПосле(Команда)
	// Вставить содержимое обработчика.
	
	заказы = ПолучитьЗаказ();
	мКСписанию = алсав_ПолучитьМаетиралыДляСписания(заказы);
	
	мФорма = ПолучитьФорму("Документ.СписаниеНедостачТоваров.ФормаОбъекта");
	ДанныеФормы = мФорма.Объект;	
	ДанныеФормы.Дата = ТекущаяДата();
	//ДанныеФормы.Основание = ЭтаФорма.Объект.Ссылка;
	//ДанныеФормы.ЗаказПоставщику = ЭтаФорма.Объект.Ссылка;
	Для Каждого заказ из заказы Цикл
		ДанныеФормы.алсав_ЗаказыПоставщику.Добавить().ЗаказПоставщику = заказ;
	КонецЦикла;
	
	
	Для каждого стр из мКСписанию Цикл
		нСтр = ДанныеФормы.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр, стр);
	КонецЦикла;
	
	мФорма.Открыть();
КонецПроцедуры


&НаСервереБезКонтекста
Функция алсав_ПолучитьМаетиралыДляСписания(ссылки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Номенклатура КАК Номенклатура,
	               |	Т.Характеристика КАК Характеристика,
	               |	СУММА(Т.Всего) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_Заказы.Ссылка КАК ЗаказПоставщику,
	               |		комплектация.Номенклатура.Артикул КАК Артикул,
	               |		комплектация.Номенклатура КАК Номенклатура,
	               |		комплектация.Характеристика КАК Характеристика,
	               |		комплектация.Упаковка КАК Упаковка,
	               |		комплектация.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	               |		ВТ_Заказы.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	               |		комплектация.Количество КАК Количество,
	               |		ВТ_Заказы.КоличествоУпаковок КАК КоличествоРодитель,
	               |		комплектация.Количество * ВТ_Заказы.КоличествоУпаковок КАК Всего
	               |	ИЗ
	               |		Документ.ЗаказПоставщику.Товары КАК ВТ_Заказы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК комплектация
	               |			ПО (комплектация.Ссылка = ВТ_Заказы.ВариантКомплектацииНоменклатуры)
	               |	ГДЕ
	               |		ВТ_Заказы.Ссылка в (&массивЗаказПоставщику)) КАК Т
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Т.Характеристика,
	               |	Т.Номенклатура";
	
	Запрос.УстановитьПараметр("массивЗаказПоставщику",ссылки);
	
	
	прототип = "Номенклатура,Характеристика,Количество";
	результ = новый Массив;
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		списатьМатериалы = алсав_ДопРеквизиты.ПолучитьДопРеквизит(рез.Номенклатура,"Списывать материалы");
		Если (списатьМатериалы = Истина)ИЛИ(Строка(списатьМатериалы) = "Да") Тогда
			стр = Новый Структура(прототип);
			ЗаполнитьЗначенияСвойств(стр, рез);
			результ.Добавить(стр);
		КонецЕсли;
	КонецЦикла;
	Возврат результ;
КонецФункции


&НаКлиенте
Процедура алсав_УстановитьОчереднойНомерПакетаЗаданийПосле(Команда)
	// Вставить содержимое обработчика.
	алсав_УстановитьОчереднойСвойствоСерверПосле("Номер пакета заданий");
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_УстановитьОчереднойНомерПакетаХДФПосле(Команда)
	// Вставить содержимое обработчика.
	алсав_УстановитьОчереднойСвойствоСерверПосле("Номер пакета ХДФ");
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура алсав_УстановитьОчереднойСвойствоСерверПосле(имяСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ДопРекв.Значение) КАК Последний
	               |ИЗ
	               |	Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК ДопРекв
	               |ГДЕ
	               |	ДопРекв.Свойство.Заголовок = &имяСвойства";
	
	Запрос.УстановитьПараметр("имяСвойства",имяСвойства);
	
	
	рез = Запрос.Выполнить().Выбрать();
	
	последнийНомер = 0;
	Если рез.Следующий() Тогда 
		Попытка
			последнийНомер = Число(рез.Последний);
		Исключение КонецПопытки;
	КонецЕсли;
	
	очереднойНомер = последнийНомер + 1;
	
	заказы = ПолучитьЗаказ();
	НачатьТранзакцию();
	Для Каждого заказПоставщику Из заказы Цикл
		
		Если ЛОЖЬ Тогда заказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка(); КонецЕсли;
		
		об = заказПоставщику.ПолучитьОбъект();
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, имяСвойства, очереднойНомер);
		об.ОбменДанными.Загрузка = Истина;
		об.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры




&НаКлиенте
Процедура алсав_алсав_СформироватьПроектБазисПосле(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать проект'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "bprj";
	Диалог.Фильтр = НСтр("ru='bprj (*.bprj)|*.bprj'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);
КонецПроцедуры


&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			мВариантыКомплектации = Новый Массив;
			мТовары = ПолучитьТовары();
			Для Каждого стр из мТовары Цикл
				Если ЗначениеЗаполнено(стр.ВариантКомплектацииНоменклатуры) Тогда
					Если мВариантыКомплектации.Найти(стр.ВариантКомплектацииНоменклатуры) = неопределено Тогда
						мВариантыКомплектации.Добавить(стр.ВариантКомплектацииНоменклатуры);
					конецЕсли;
				Иначе
					Сообщить("Не заполнен вариант комплектации в строке "+стр.НомерСтроки);
				КонецЕсли;
			КонецЦикла;
			соотвествиеФайлов = алсав_ПолучитьИменяФайловБазис(мВариантыКомплектации);
			Если ЛОЖЬ Тогда соотвествиеФайлов = новый Соответствие(); конецЕсли;
			
			файлы = новый Массив;	
			Для Каждого стр из мТовары Цикл
				
				Если ЗначениеЗаполнено(стр.ВариантКомплектацииНоменклатуры) Тогда
					полныйПутьКФайлу = соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры);
					Если полныйПутьКФайлу<>неопределено Тогда
						файлИнфо = новый Файл(соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры));
						файлы.Добавить(Новый Структура("Type,Name,SubName,Sign,Note,Comment,Count",
							5,
							соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры),
							Неопределено,
							файлИнфо.ИмяБезРасширения,
							Неопределено,
							Неопределено,
							Формат(стр.Количество,"ЧГ=0")
						));   
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ListFiles = новый Структура("File",файлы);
			CuttingInfo = новый  Структура("Parameters,ProductCount",Неопределено,1); ;
			
			DataProject = новый Структура;
			DataProject.Вставить("ListFiles",ListFiles);
			DataProject.Вставить("CuttingInfo",CuttingInfo);
			DataProject.Вставить("EstimateInfo",Неопределено);
			
			
			Document = новый Структура;
			Document.Вставить("DataProject", DataProject);
			
			проект = новый Структура;
			проект.Вставить("Document", Document);
			 	
			
			ЗаписьXML = Новый ЗаписьXML; 
			ЗаписьXML.УстановитьСтроку();
			
			ToXML(ЗаписьXML,проект);
			
			xml = ЗаписьXML.Закрыть();
			
			тд = Новый ТекстовыйДокумент();
			тд.УстановитьТекст(xml);
			//тд.Показать(Объект.Номер);
			
			тд.Записать(ИмяФайла);
			
			Сообщить("Файл сформирован: "+ИмяФайла)
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Функция ToXML(ЗаписьXML, эл)
	Если ТипЗнч(эл) = Тип("Структура") Тогда
		Если ЛОЖЬ Тогда эл = Новый Структура; КонецЕсли;
		Для Каждого ф из эл Цикл
			Если ТипЗнч(ф.Значение)=Тип("Массив") Тогда
				Для каждого б из ф.Значение Цикл
					ЗаписьXML.ЗаписатьНачалоЭлемента(ф.Ключ);	
					ToXML(ЗаписьXML,б);
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЦикла;
			иначе
				
				ЗаписьXML.ЗаписатьНачалоЭлемента(ф.Ключ);	
				ToXML(ЗаписьXML,ф.Значение);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			
			КонецЕсли;
			
		КонецЦикла;		
	//ИначеЕсли ТипЗнач(эл)=Тип("Массив") Тогда
	//	Если ЛОЖЬ Тогда эл = Новый Массив; КонецЕсли;
	Иначе
		ЗаписьXML.ЗаписатьТекст(строка(эл));
	конецЕсли;
КонецФункции


&НаСервере
Функция ПолучитьЗаказ()
	мЗаказы = новый Массив;
	Для Каждого заказПоставщику Из ЭтаФорма.Элементы.Список.ВыделенныеСтроки Цикл
		мЗаказы.Добавить(заказПоставщику);
	КонецЦикла;
	
	Возврат мЗаказы;
КонецФункции

&НаСервере
Функция ПолучитьТовары()
	заказы = ПолучитьЗаказ();
	ЗАпрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	               |	ЗаказПоставщикуТовары.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	               |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка В(&заказы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПоставщикуТовары.ВариантКомплектацииНоменклатуры,
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	ЗаказПоставщикуТовары.Характеристика";
	Запрос.УстановитьПараметр("Заказы",заказы);
	тз = Запрос.Выполнить().Выгрузить();
	результ = ОбщегоНазначения.ТаблицаЗначенийВМассив(тз);
	Возврат результ;
КонецФункции

&НаСервереБезКонтекста
Функция алсав_ПолучитьИменяФайловБазис(мВариантыКомплектации)
	// Вставить содержимое обработчика.
	
	результ = Новый Соответствие();
	Для Каждого вариантКомплектации ИЗ мВариантыКомплектации Цикл
		путь = алсав_ДопРеквизиты.ПолучитьДопСведение(вариантКомплектации,"Файл модели");
		путь = СтрЗаменить(путь,"\\192.168.0.230\shared\","");
		результ.Вставить(вариантКомплектации,путь);
	КонецЦикла;
	
	
	Возврат результ;
КонецФункции


&НаКлиенте
Процедура алсав_алсав_МатериалыКСписаниюПосле(Команда)
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыКСписанию","Да");
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СписаниеБазисПосле(Команда)
	// Вставить содержимое обработчика.
	СформироватьОтчет_ВО_МатериалыПоЗаданию("СписаниеБазис", "Нет");
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ОтчетКакНазаватьПосле(Команда)
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыПоЗаданию");
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_МатериалыПоУпаковкамПосле(Команда)
	// Вставить содержимое обработчика.
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыПоУпаковкам");
КонецПроцедуры


&НаКлиенте
Функция СформироватьОтчет_ВО_МатериалыПоЗаданию(имяВарианта, СписыватьМатериалы = неопределено)
	ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ф = ПолучитьФорму("Отчет.ВО_МатериалыПоЗаданию.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант(имяВарианта);                                              	
	
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(элемент.Параметр) = "ЗаказПоставщику" Тогда
				элемент.Значение = неопределено;
				элемент.Использование = Ложь;
			ИначеЕсли Строка(элемент.Параметр) = "ЗаказыПоставщику" Тогда
				сп = Новый СписокЗначений;
				сп.ЗагрузитьЗначения(ПолучитьЗаказ());					
				элемент.Значение = сп;
				элемент.Использование = Истина;

			ИначеЕсли (Строка(элемент.Параметр) = "СписыватьМатериалы") и (СписыватьМатериалы <> неопределено) Тогда
					
				св = ПолучитьЗначенияСписыватьМатериалы(СписыватьМатериалы);				
				сп = Новый СписокЗначений;
				сп.ЗагрузитьЗначения(св);
				
				элемент.Значение = сп;
				элемент.Использование = Истина;
			Иначе
				элемент.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	ф.Открыть();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияСписыватьМатериалы(СписыватьМатериалы)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ  Справочник.ЗначенияСвойствОбъектов ГДЕ Наименование = """+СписыватьМатериалы+""" И Владелец.Заголовок = ""Списывать материалы""";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	полныеЖурналЗаказыПоставщикуДополнительныеКнопки = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ЖурналЗаказыПоставщикуДополнительныеКнопки.Имя);
	ЭтаФорма.Элементы.алсав_Комманды.Видимость = полныеЖурналЗаказыПоставщикуДополнительныеКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_ОчиститьНомерПакетаЗаданийПосле(Команда)
	всегоВыбранно = ЭтаФорма.Элементы.Список.ВыделенныеСтроки.Количество();
	ТекстВопроса = НСтр("ru = 'Вы уверены что хотите очистить Номер пакета заданий у выбранных заказов ("+всегоВыбранно+")?'");
	           Оповещение = Новый ОписаниеОповещения("алсав_ОчиститьНомерПакетаЗаданийПослеЗавершение", ЭтотОбъект);
	           ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура алсав_ОчиститьНомерПакетаЗаданийПослеЗавершение(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		алсав_ОчиститьСвойствоСерверПосле("Номер пакета заданий");
		ЭтаФорма.Элементы.Список.Обновить();
	КонецЕсли;
			   
КонецПроцедуры

&НаСервере
Процедура алсав_ОчиститьСвойствоСерверПосле(имяСвойства)
	очереднойНомер = неопределено; 
	заказы = ПолучитьЗаказ();
	НачатьТранзакцию();
	Для Каждого заказПоставщику Из заказы Цикл
		
		Если ЛОЖЬ Тогда заказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка(); КонецЕсли;
		
		об = заказПоставщику.ПолучитьОбъект();
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, имяСвойства, очереднойНомер);
		об.ОбменДанными.Загрузка = Истина;
		об.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_ОчиститьНомерПакетаХДФПосле(Команда)
		всегоВыбранно = ЭтаФорма.Элементы.Список.ВыделенныеСтроки.Количество();
	ТекстВопроса = НСтр("ru = 'Вы уверены что хотите очистить Номер пакета заданий у выбранных заказов ("+всегоВыбранно+")?'");
	           Оповещение = Новый ОписаниеОповещения("алсав_ОчиститьНомерПакетаХДФПослеЗавершение", ЭтотОбъект);
	           ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура алсав_ОчиститьНомерПакетаХДФПослеЗавершение(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		алсав_ОчиститьСвойствоСерверПосле("Номер пакета ХДФ");
		ЭтаФорма.Элементы.Список.Обновить();
	КонецЕсли;
			   
КонецПроцедуры




