
&НаСервере
Процедура алсав_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура алсав_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если НеобходимоСоздатьСФ(Объект.Организация, Объект.Дата) И
		(Лев(ТекстСчетаФактурыВыданные,8) = "Оформить") И 
		(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение)
		
		Тогда
		СтандартнаяОбработка = Истина;
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыРегистрации = ПараметрыРегистрацииСчетовФактурВыданныхСервер(Объект);
		ВвестиСчетФактуруВыданный(ЭтаФорма, ПараметрыРегистрации);
				
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеобходимоСоздатьСФ(организация, дата)
	инн = организация.ИНН;
	//Если (дата >= Дата(2023,01,01)) И (инн = "504105446700" ИЛИ инн = "772787340724") Тогда
	Если (дата < Дата(2026,01,01)) И (инн = "504105446700" ИЛИ инн = "772787340724" ИЛИ инн = "500513935388") Тогда
		Возврат ЛОЖЬ;
	ИначеЕсли (инн = "504105446700") Тогда
		Возврат ЛОЖЬ;
	Иначе
		Возврат ИСТИНА;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВвестиСчетФактуруВыданный(Форма, ПараметрыРегистрации) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыРегистрации",  ПараметрыРегистрации);
	ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", Ложь);
	ДополнительныеПараметры.Вставить("Форма",                 Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВвестиСчетФактуруВыданныйЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//УчетНДСУПСлужебныйКлиент.ПроверитьВозможностьСозданияДокументаНаОсновании(Форма, Оповещение);
	ОбщегоНазначенияУТКлиент.ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента(Форма, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСчетФактуруВыданныйЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//Если Результат <> КодВозвратаДиалога.Да 
	//	И Результат <> Истина Тогда
	//	Возврат;
	//КонецЕсли;
	//
	ПараметрыРегистрации = ДополнительныеПараметры.ПараметрыРегистрации;
		
	Если ЗначениеЗаполнено(ПараметрыРегистрации.Ссылка) Тогда
		ДокументОснование = ПараметрыРегистрации.Ссылка;
	Иначе
		ДокументОснование = ДополнительныеПараметры.Форма.Объект.Ссылка;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыОткрытия.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ПараметрыОткрытия.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ПараметрыОткрытия.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ПараметрыОткрытия.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);

	
	ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
	формаСФ = ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
	
	формаСФ.Объект.Номер = ПолучитьРеквизит(ДокументОснование,"Номер");
	
	формаСФ.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	формаСФ.Закрыть();
	Сообщить("Счет-фактура создан и проведен.");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизит(Ссылка,ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции



&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Элементы.УБ_МаршрутныйЛист.Видимость = Истина;
	
	Объект.СкидкиРассчитаны = Истина;
	
	ЗаполнитьКладовщика();

	
	ф = истина;	
	Для Каждого стр из Объект.Товары Цикл
		ф = ф и ЭтаФорма.ЭтоПроект;
	КонецЦикла;
	ЭтаФорма.ЭтоПроект = ф;
	УстановитьДоступность_ЭтоПроект();
	
 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКладовщика()
	Если (ЗначениеЗаполнено(Объект.Организация)И(НЕ ЗначениеЗаполнено(Объект.Ссылка))) Тогда
		Объект.Отпустил = алсав_ДопРеквизиты.ПолучитьДопРеквизит(Объект.Организация,"Груз отпустил");
		Объект.ОтпустилДолжность = алсав_ДопРеквизиты.ПолучитьДопРеквизит(Объект.Организация,"Груз отпустил(должность)");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура алсав_ПриОткрытииПосле(Отказ)
	//Вставить содержимое обработчика
	Элементы.УБ_МаршрутныйЛист.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура алсав_ЭтоПроектПриИзмененииПослеНаСервере()
	// Вставить содержимое обработчика.
	
	Для Каждого стр из Объект.Товары Цикл
		стр.ЭтоПроект = ЭтаФорма.ЭтоПроект;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_ЭтоПроектПриИзмененииПосле(Элемент)
	алсав_ЭтоПроектПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Функция УстановитьДоступность_ЭтоПроект()
	Если ЭтаФорма.ЭтоПроект Тогда
		ЭтаФорма.Элементы.ТоварыЭтоПроект.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецФункции

&НаСервере
&Вместо("НалогообложениеНДСПриИзмененииСервер")
Процедура алсав_НалогообложениеНДСПриИзмененииСервер()

	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",
		Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ЗаполнитьКодТНВЭД", Объект.НалогообложениеНДС);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов"); 
	
	///+++++++++++
	СтруктураДействий.ЗаполнитьСтавкуНДС.Вставить("Данные_Организация",Объект.Организация); 
	///-----------
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);
	
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	ПересчитатьСуммуСверхЗаказа();
	
	ПродажиКлиентСервер.РассчитатьИтоговыеПоказателиРеализации(ЭтаФорма);
	СформироватьНадписьВалюты(ЭтаФорма);

КонецПроцедуры
