
&После("ДобавитьКомандыСозданияНаОсновании")
Процедура алсав_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	// Вставить содержимое метода.
	ДобавитьКомандуСоздатьНаОснованииСписание(КомандыСозданияНаОсновании);
КонецПроцедуры



Функция ДобавитьКомандуСоздатьНаОснованииСписание(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеНедостачТоваров) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.СписаниеНедостачТоваров.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.СписаниеНедостачТоваров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПеремещениеТоваров";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

