
//&Вместо("ОбработкаПроведения")
&После("ОбработкаПроведения")
Процедура алсав_ОбработкаПроведения(Отказ, РежимПроведения)
	//возврат;
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ПриходныйОрдерНаТовары.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);
	///////////////////////////////
	этоДляСборки = Ложь;
	
	Если ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.СборкаТоваров")
		ИЛИ  ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку")
		Тогда
		этоДляСборки = Истина;
	КонецЕсли;
	Если этоДляСборки = ложь Тогда		
		СкладыСервер.ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//СкладыСервер.ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ);
	///////////////////////////////
	СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОформлениюИзлишковНедостач(ДополнительныеСвойства, Движения, Отказ);
	
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	Возврат;
	
	Если СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(ЭтотОбъект.Склад, ЭтотОбъект.Дата) И СкладыСервер.ИспользоватьАдресноеХранение(ЭтотОбъект.Склад, ,ЭтотОбъект.Дата) Тогда
		//Если ТипЗнч(ЭтотОбъект.Распоряжение) = тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Если ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.СборкаТоваров")
			ИЛИ  ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку")
			Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.Распоряжение.ЗаказПоставщику) Тогда
				
				ордер = ЭтотОбъект;
				поступление = ЭтотОбъект.Распоряжение; 
				болванка = Новый Структура("Период,ВидДвижения,Склад,Отправитель,ХозяйственнаяОперация,Номенклатура,Характеристика");
				
				болванка.Период = ордер.Дата;
				болванка.ВидДвижения = ВидДвиженияНакопления.Приход;
				болванка.Склад = ордер.Склад;
				болванка.Отправитель = поступление.Партнер;
				болванка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;

				Для Каждого стр из ордер.Товары Цикл
					болванка.Номенклатура = стр.Номенклатура;
					болванка.Характеристика = стр.Характеристика;
					
					запись = ордер.Движения.ДвижениеТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(запись, болванка);	
					запись.Распоряжение = поступление.ЗаказПоставщику;
					запись.ПланируемоеПоступление = -стр.Количество;
					запись.ПланируемоеПоступлениеСНеподтвержденными = -стр.Количество;
				КонецЦикла;
				
				
				ордер.Движения.ДвижениеТоваров.Записать(ИСТИНА);
			КонецЕсли
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
