
&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		строкаУИ = алсав_ДопРеквизиты.ПолучитьДопРеквизит(Объект.Ссылка,"УИ_СчетОрганизации");
		ЭтаФорма.АЛСАВ_СчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьПоСтрокеУИ(строкаУИ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура алсав_АЛСАВ_СчетОрганизацииПриИзмененииПослеНаСервере()
	// Вставить содержимое обработчика.	
	описаниеСвойства = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.Выгрузить().Найти("УИ_СчетОрганизации");
	Если ЗначениеЗаполнено(описаниеСвойства) Тогда
		ЭтаФорма[описаниеСвойства.ИмяРеквизитаЗначение] = ?(
			ЗначениеЗаполнено(ЭтаФорма.АЛСАВ_СчетОрганизации),
			ЭтаФорма.АЛСАВ_СчетОрганизации.УникальныйИдентификатор(),
			""
			);
			
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура алсав_АЛСАВ_СчетОрганизацииПриИзмененииПосле(Элемент)
	алсав_АЛСАВ_СчетОрганизацииПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура алсав_АЛСАВ_СчетОрганизацииНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Владелец",Объект.Организация));
	ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры
