Функция СтруктураВJSON(Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	СтрокаJSON = "";
	ЗаписьJSON.УстановитьСтроку(СтрокаJSON);
	ЗаписатьJSON(ЗаписьJSON, Значение);
	ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
		Результат = СоответствиеВСтруктуру(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеВСтруктуру(Соответствие) Экспорт
	
	Структура = Новый Структура;
	Для каждого КлючЗначение Из Соответствие Цикл
		Значение = КлючЗначение.Значение;
		Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
			Значение = СоответствиеВСтруктуру(Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
			Для Индекс = 0 По Значение.ВГраница() Цикл
				Если ТипЗнч(Значение[Индекс]) = Тип("Соответствие") Тогда
					Значение[Индекс] = СоответствиеВСтруктуру(Значение[Индекс]);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Структура.Вставить(КлючЗначение.Ключ, Значение);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции
