
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	ЭтаФорма.ПересчетТоваров = ЭтаФорма.Параметры.ПересчетТоваров;
	
	
	ЗаполнитьДанные(ЭтаФорма.ПересчетТоваров);
КонецПроцедуры


&НаСервере
Функция ЗаполнитьДанные(ПересчетТоваров)
	  
	
	ЭтаФорма.Данные.Область(1,1,1,1).Текст = "№";
	ЭтаФорма.Данные.Область(1,2,1,2).Текст = "Номенклатура";
	ЭтаФорма.Данные.Область(1,3,1,3).Текст = "Характеристика";
	ЭтаФорма.Данные.Область(1,4,1,4).Текст = "Учет";
	ЭтаФорма.Данные.Область(1,5,1,5).Текст = "Факт";
	
	инд = 1;
	Для каждого стр из ПересчетТоваров.Товары Цикл
		инд = инд + 1;
		
		ЭтаФорма.Данные.Область(инд,1,инд,1).Текст = стр.НомерСтроки;
		ЭтаФорма.Данные.Область(инд,2,инд,2).Текст = стр.Номенклатура;
		ЭтаФорма.Данные.Область(инд,3,инд,3).Текст = стр.Характеристика;
		ЭтаФорма.Данные.Область(инд,4,инд,4).Текст = стр.Количество;
		ЭтаФорма.Данные.Область(инд,5,инд,5).Текст = стр.КоличествоФакт;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьВДокумент(Команда)
	// Вставить содержимое обработчика.
	мДанные = новый массив;
	
	инд = 2;
	Пока ЗначениеЗаполнено(ЭтаФорма.Данные.Область(инд,1,инд,1).Текст) Цикл
		
		мДанные.Добавить(
			новый Структура(
				"НомерСтроки,Номенклатура,Характеристика,Количество,КоличествоФакт",
				ЭтаФорма.Данные.Область(инд,1,инд,1).Текст,
				ЭтаФорма.Данные.Область(инд,2,инд,2).Текст,
				ЭтаФорма.Данные.Область(инд,3,инд,3).Текст,
				ЭтаФорма.Данные.Область(инд,4,инд,4).Текст,
				ЭтаФорма.Данные.Область(инд,5,инд,5).Текст
			)
		);
		инд = инд + 1;
	КонецЦикла;
	
	АдресТоваровВХранилище = ПоместитьВоВременноеХранилище(мДанные);
	
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("АдресТоваровВХранилище",АдресТоваровВХранилище);
	
	ОповеститьОВыборе(СтруктураВыбора);
	//Закрыть();

КонецПроцедуры
