
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое метода.
	
Если (ЭтотОбъект.Дата >= Дата(2026,01,01)) И (ЭтотОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию) Тогда	
		Если ЭтотОбъект.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			Для Каждого стр из ЭтотОбъект.Товары Цикл
				Если стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					Отказ = Истина;
					Сообщить("Ставка НДС 20% запрещена к использованию с 01 января 2026 года.");
				КонецЕсли;
				
				Если стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					Отказ = Истина;
					Сообщить("Ставка Без НДС запрещена к использованию с 01 января 2026 года.");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
