
&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если НЕ  ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НеВыполнятьДвиженияПоСкладу = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Элементы.НеВыполнятьДвиженияПоСкладу.ТолькоПросмотр = 
		НЕ УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_НеВыполнятьДвиженияПоСкладу.Имя);

	АЛСАВ_УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура алсав_НеВыполнятьДвиженияПоСкладуПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	АЛСАВ_УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция АЛСАВ_УстановитьВидимость()
	Этаформа.Элементы.борд_НеВыполнятьДвиженияПоСкладу.Видимость =   Объект.НеВыполнятьДвиженияПоСкладу;
КонецФункции;