&НаСервере
Функция РасчетатьЗакупочныеЦены(вхДатаСреза = неопределено)ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(Истина);
	
	датаСреза = ?(вхДатаСреза = неопределено, ТекущаяДата(), вхДатаСреза);
	датаСреза = КонецДня(датаСреза);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Постулпения.Номенклатура КАК Номенклатура,
	               |	Постулпения.Характеристика КАК Характеристика,
	               |	МАКСИМУМ(Постулпения.Цена) КАК Цена
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК Постулпения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(Постулпения.Ссылка.Дата) КАК ДатаПоступления,
	               |			Постулпения.Номенклатура КАК Номенклатура,
	               |			Постулпения.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Документ.ПриобретениеТоваровУслуг.Товары КАК Постулпения
	               |		ГДЕ
	               |			Постулпения.Ссылка.Проведен
	               |			И Постулпения.Ссылка.Организация <> &алсав
	               |			И Постулпения.Цена > 0
	               |			И Постулпения.Ссылка.Дата <= &датаСреза
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Постулпения.Номенклатура,
	               |			Постулпения.Характеристика) КАК Срез
	               |		ПО (Срез.ДатаПоступления = Постулпения.Ссылка.Дата)
	               |			И (Срез.Номенклатура = Постулпения.Номенклатура)
	               |			И (Срез.Характеристика = Постулпения.Характеристика)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&датаСреза, ВидЦены = &ВидЦены) КАК Цены
	               |		ПО (Цены.Номенклатура = Постулпения.Номенклатура)
	               |			И (Цены.Характеристика = Постулпения.Характеристика)
	               |ГДЕ
	               |	Постулпения.Ссылка.Проведен
	               |	И Постулпения.Цена > 0
	               |	И Постулпения.Ссылка.Организация <> &алсав
	               |	И Постулпения.Ссылка.Дата <= &датаСреза
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Постулпения.Номенклатура,
	               |	Постулпения.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	МАКСИМУМ(Постулпения.Цена) <> МАКСИМУМ(ЕСТЬNULL(Цены.Цена, 0))";
	
	
	
	видЦеныМатериалы = Справочники.ВидыЦен.НайтиПоНаименованию("Материалы цена");
	алсав = Справочники.Организации.НайтиПоНаименованию("ООО ""АЛСАВ""");
	
	Запрос.УстановитьПараметр("ВидЦены",видЦеныМатериалы);
	Запрос.УстановитьПараметр("алсав",алсав);
	Запрос.УстановитьПараметр("датаСреза",датаСреза);
	
	//// Есть ли новые
	рез = Запрос.Выполнить();	
	Если рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	сДок = Получить_УстановкаЦенНоменклатуры(датаСреза);
	оДок = сДок.ПолучитьОбъект();
	Если оДок.Проведен Тогда
		оДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	рез = Запрос.Выполнить().Выбрать();
	
	оДок = сДок.ПолучитьОбъект();
	Если оДок.ВидыЦен.Найти(видЦеныМатериалы) = неопределено Тогда
		нСтр = оДок.ВидыЦен.Добавить();
		нСтр.ВидЦены = видЦеныМатериалы;
	КонецЕсли;
	оДок.Товары.Очистить();
	Пока Рез.Следующий() Цикл
		нСтр = оДок.Товары.Добавить();
		нСтр.ВидЦены = видЦеныМатериалы;
		ЗаполнитьЗначенияСвойств(нСтр,Рез);
		нСтр.ЦенаИзмененаВручную = Истина;
	КонецЦикла;
	
	оДок.Согласован = Истина;
	оДок.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	
	оДок.Записать(РежимЗаписиДокумента.Запись);
	оДок.Записать(РежимЗаписиДокумента.Проведение);
КонецФункции

&НаСервере
Функция Получить_УстановкаЦенНоменклатуры(дата)
	результ = неопределено;
	Запрос = Новый Запрос;
	маркер = "|Материалы цена|";//+дата;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	               |ГДЕ
	               |	УстановкаЦенНоменклатуры.Комментарий ПОДОБНО &Маркер
	               |	И НЕ УстановкаЦенНоменклатуры.ПометкаУдаления
	               |	И УстановкаЦенНоменклатуры.Дата >= &ДатаН
	               |	И УстановкаЦенНоменклатуры.Дата <= &ДатаК";
	
	Запрос.УстановитьПараметр("маркер","%"+маркер+"%");
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(дата));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(дата));
	рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		результ = рез.Ссылка;
	Иначе
		док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		док.Дата = НачалоДня(дата);
		док.Комментарий = маркер;
		док.Записать(РежимЗаписиДокумента.Запись);
		результ = док.Ссылка;
	КонецЕсли;
	Возврат результ;
КонецФункции