Функция ПолучитьСтатусОплаты(заказ) Экспорт
	Результ = Новый Структура;
	Результ.Вставить("ЗаказКлиента");
	Результ.Вставить("ПроцентКредита");
	Результ.Вставить("ПроцентОплаты");
	Результ.Вставить("Оплачено");
	Результ.Вставить("ОплаченПоУсловиюСоглашения");
	Результ.Вставить("ЕстьОплата");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заказы.ЗаказКлиента КАК ЗаказКлиента,
	               |	ГрафикОплаты.ПроцентКредита КАК ПроцентКредита,
	               |	СостоянияЗаказов.ПроцентОплаты КАК ПроцентОплаты,
	               |	СостоянияЗаказов.ОплаченПоУсловиюСоглашения КАК ОплаченПоУсловиюСоглашения,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Оплачено,
	               |	СостоянияЗаказов.ЕстьОплата КАК ЕстьОплата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_Заказы.Ссылка КАК Заказ,
	               |		ВТ_Заказы.Ссылка КАК ЗаказКлиента
	               |	ИЗ
	               |		Документ.ЗаказКлиента КАК ВТ_Заказы) КАК Заказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СостоянияЗаказов.Заказ КАК ЗаказКлиента,
	               |			ВЫБОР
	               |				КОГДА СостоянияЗаказов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки))
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ КАК ОплаченПоУсловиюСоглашения,
	               |			ВЫБОР
	               |				КОГДА ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) >= 1
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ КАК ЕстьОплата,
	               |			СостоянияЗаказов.ПроцентОплаты КАК ПроцентОплаты
	               |		ИЗ
	               |			РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов) КАК СостоянияЗаказов
	               |		ПО (СостоянияЗаказов.ЗаказКлиента = Заказы.ЗаказКлиента)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	               |			СУММА(ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа) КАК ПроцентКредита
	               |		ИЗ
	               |			Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	               |		ГДЕ
	               |			ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка.Проведен = ИСТИНА
	               |			И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка) КАК ГрафикОплаты
	               |		ПО (ГрафикОплаты.Ссылка = Заказы.ЗаказКлиента)
	               |ГДЕ
	               |	Заказы.ЗаказКлиента = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ",заказ);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результ,рез);
	КонецЕсли;
	
	Возврат Результ;
КонецФункции

Функция ПолучитьСтатусОтгрузки(заказ) Экспорт
	
	Результ = Новый Структура;
	Результ.Вставить("ЗаказКлиента", заказ);
	Результ.Вставить("ПроцентОтгрузки",0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
	               |	СостоянияЗаказовКлиентов.Заказ КАК ЗаказКлиента
	               |ИЗ
	               |	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	               |ГДЕ
	               |	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ",заказ);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результ,рез);
	КонецЕсли;
	
	Возврат Результ;
КонецФункции