
&Перед("ПриЗаписи")
Процедура алсав_ПриЗаписи(Отказ)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;

	//
	//Если Не Отказ И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	УдалитьЗаказНаСборку(ЭтотОбъект.Ссылка)	;
	//	//Для Каждого Стр из ЭтотОбъект.Товары Цикл
	//	//КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

Функция УдалитьЗаказНаСборку(заказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаСборку.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаСборку КАК ЗаказНаСборку
	               |ГДЕ
	               |	ЗаказНаСборку.ДокументОснование = &ЗаказКлиента
	               |	И ЗаказНаСборку.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаказКлиента",заказКлиента);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл 
		Рез.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецФункции


Функция УдалитьСборки(ЗаказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СборкаТоваров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СборкаТоваров КАК СборкаТоваров
	               |ГДЕ
	               |	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
	               |	И СборкаТоваров.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку",ЗаказНаСборку);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл 	
		Рез.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецФункции

&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Вставить содержимое метода.
	ПроверитьЗапретОтгрузки(Отказ);
	
	Если Не Отказ И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Для Каждого стр из ЭтотОбъект.Товары Цикл
			//Если стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада ИЛИ 
			//	стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить 
			//Тогда
				
				стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
			//КонецЕсли;
		Конеццикла;
	КонецЕсли;
	
	Если Не Отказ Тогда
		//Отказ = НайтиПомеченныеНаУадленияНоменклатуруИлиХарактеристику();
		НайтиПомеченныеНаУадленияНоменклатуруИлиХарактеристику();
	КонецЕсли;
	
	Если ЭтотОбъект.Дата >= Дата(2026,01,01) Тогда	
		Для Каждого стр из ЭтотОбъект.Товары Цикл
			Если стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				Отказ = Истина;
				Сообщить("Ставка НДС 20% запрещена к использованию с 01 января 2026 года.");
			КонецЕсли;
			
			Если стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				Отказ = Истина;
				Сообщить("Ставка Без НДС запрещена к использованию с 01 января 2026 года.");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиПомеченныеНаУадленияНоменклатуруИлиХарактеристику()
	найденыПомеченныеНаУдаление = Ложь;
	Для Каждого Стр из Товары Цикл
		Если Стр.Номенклатура.ПометкаУдаления Тогда
			Сообщить("В строке "+Стр.НомерСтроки+" Номенклатура помечена на удаление");
		КонецЕсли;
		Если Стр.Характеристика.ПометкаУдаления Тогда
			Сообщить("В строке "+Стр.НомерСтроки+" Характеристика помечена на удаление");
		КонецЕсли;
		найденыПомеченныеНаУдаление = найденыПомеченныеНаУдаление или Стр.Номенклатура.ПометкаУдаления или Стр.Характеристика.ПометкаУдаления;
	КонецЦикла;
	Возврат найденыПомеченныеНаУдаление;	
КонецФункции


Функция ПроверитьЗапретОтгрузки(Отказ)
	запретОтгрузки = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ЭтотОбъект,"Запрет отгрузки");
	
	Если запретОтгрузки = Истина Тогда
		Если ЭтотОбъект.Товары.Найти(Перечисления.ВариантыОбеспечения.Отгрузить) <> неопределено Тогда
			Отказ = Истина;
			Сообщить("Установлен запрет отгрузки, недопустимы позиции со статусом ""К отгрузке""");
		КонецЕсли;
	КонецЕсли;
	
Конецфункции
