
&Вместо("ЗначенияРеквизитовОбъекта")
//Функция алсав_ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, КодЯзыка = Неопределено) Экспорт
Функция алсав_ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	// Вставить содержимое метода.
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.КорректировкаРегистров") Тогда
		Результат = ПродолжитьВызов(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка);
	Иначе
		Результат = Новый Структура(Реквизиты);
		Для Каждого эл из Результат Цикл
			Попытка
				Результат[эл.Ключ] = Ссылка[эл.Ключ];
			Исключение
				Результат[эл.Ключ] = ложь;
			Конецпопытки;
		КонецЦикла;
	Конецесли;
	Возврат Результат;
КонецФункции
