Функция ПолучитьНовыйАртикул() ЭКСПОРТ
	началоНумератора = 555555;
	последнийАртикул = началоНумератора;
	маскаАртикула = "[0-9][0-9][0-9][0-9][0-9][0-9]";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(Номенклатура.Артикул) КАК Артикул
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул ПОДОБНО &маскаАртикула";
	Запрос.УстановитьПараметр("маскаАртикула",маскаАртикула);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		последнийАртикул = Число(рез.Артикул);
		Если последнийАртикул<началоНумератора Тогда
			последнийАртикул = началоНумератора;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Формат(последнийАртикул+1, "ЧГ=0");
КонецФункции

Функция ПолучитьНоменклатуруПоАртикулу(артикул)ЭКСПОРТ
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &Артикул
	               |	И НЕ Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("артикул",артикул);
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.ССылка;
	КонецЕсли;
КонецФункции


Функция РасчитатьСреднемесячныйРасходЗа4Мес(Отбор = неопределено)ЭКСПОРТ
	имяДопРеквизитаСреднемесячныйРасход = "Среднемесячный расход за 4 мес.";
	
	количествоМесяцев = 4;
	началоПериода = ТекущаяДата() - (количествоМесяцев * 30 * 24 * 60 * 60);
	конецПериода = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(началоПериода));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(конецПериода));
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номен.Номенклатура КАК Номенклатура,
	               |	Номен.Характеристика КАК Характеристика,
	               |	ЕСТЬNULL(Списания.Количество, 0)+ЕСТЬNULL(Реализация.Количество, 0) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Номен.Ссылка КАК Номенклатура,
	               |		Хар.Ссылка КАК Характеристика
	               |	ИЗ
	               |		Справочник.Номенклатура КАК Номен
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Хар
	               |			ПО (Хар.Владелец = Номен.Ссылка)) КАК Номен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеНедостачТоваров.Товары КАК Списания
	               |		ПО Номен.Номенклатура = Списания.Номенклатура
	               |			И (Номен.Характеристика ЕСТЬ NULL)
	               |			И (Списания.Ссылка.Дата >= &ДатаН)
	               |			И (Списания.Ссылка.Дата <= &ДатаК)
	               |			И (Списания.Ссылка.Проведен = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Реализация
	               |		ПО (Номен.Номенклатура = Списания.Номенклатура)
	               |			И (НЕ Номен.Характеристика ЕСТЬ NULL)
	               |			И (Номен.Характеристика = Списания.Характеристика)
	               |			И (Списания.Ссылка.Дата >= &ДатаН)
	               |			И (Списания.Ссылка.Дата <= &ДатаК)
	               |			И (Списания.Ссылка.Проведен = ИСТИНА)
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	Номенклатура,
	               |	Характеристика";
	
	выборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока выборкаНоменклатура.Следующий() Цикл
				
		выборкаХарактеристика = выборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока выборкаХарактеристика.Следующий() Цикл
			Если ЗначениеЗаполнено(выборкаХарактеристика.Характеристика) Тогда
				среднемесячныйРасход = ?(количествоМесяцев = 0,0,выборкаХарактеристика.Количество / количествоМесяцев);
				Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(выборкаХарактеристика.Характеристика, имяДопРеквизитаСреднемесячныйРасход) <> среднемесячныйРасход Тогда
					
					оХарактеристика = выборкаХарактеристика.Характеристика.ПолучитьОбъект();
					оХарактеристика.ОбменДанными.Загрузка = Истина;
					Попытка
						алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оХарактеристика,имяДопРеквизитаСреднемесячныйРасход,среднемесячныйРасход);
						оХарактеристика.Записать();
					Исключение
					КонецПопытки;
				КонецЕсли
			Иначе
				среднемесячныйРасход = ?(количествоМесяцев = 0,0,выборкаНоменклатура.Количество / количествоМесяцев);
		
				Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(выборкаНоменклатура.Номенклатура, имяДопРеквизитаСреднемесячныйРасход) <> среднемесячныйРасход Тогда
					оНомен = выборкаНоменклатура.Номенклатура.ПолучитьОбъект(); 
					оНомен.ОбменДанными.Загрузка = Истина;
					Попытка
						алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен,имяДопРеквизитаСреднемесячныйРасход,среднемесячныйРасход);
						оНомен.Записать();
					Исключение
					КонецПопытки;
				КонецЕсли; 
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецФункции


//Имеет вариант комплектации
Функция ОбновитьИмеетВариантКомплектации(номенклатура = неопределено) ЭКСПОРТ
	
	имяДопРеквизитаИмеетВариантКомплектации = "Имеет вариант комплектации";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросИмеетВариантКомплектации();
	Запрос.УстановитьПараметр("ЭтоМатериалы",ЛОЖЬ);
	Запрос.УстановитьПараметр("имяДопРеквизитаИмеетВариантКомплектации",имяДопРеквизитаИмеетВариантКомплектации);
	
	Если номенклатура <> неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.Ссылка = &номен";
		Запрос.УстановитьПараметр("номен",номенклатура);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка
			Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(Рез.Номенклатура, имяДопРеквизитаИмеетВариантКомплектации) <> рез.ИмеетВариантКомплектации Тогда
				оНоменклатура = Рез.Номенклатура.ПолучитьОбъект();
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНоменклатура,имяДопРеквизитаИмеетВариантКомплектации,рез.ИмеетВариантКомплектации);
				оНоменклатура.ОбменДанными.Загрузка = Истина;
				оНоменклатура.Записать();
			КонецЕсли
		Исключение
		КонецПопытки;
	КонецЦикла
КонецФУнкции


Функция ОбновитьИмеетВариантКомплектацииМатериалы(номенклатура = неопределено) ЭКСПОРТ
	
	имяДопРеквизитаИмеетВариантКомплектации = "Имеет вариант комплектации по материалам";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросИмеетВариантКомплектации();
	Запрос.УстановитьПараметр("ЭтоМатериалы",ИСТИНА);
	Запрос.УстановитьПараметр("имяДопРеквизитаИмеетВариантКомплектации",имяДопРеквизитаИмеетВариантКомплектации);
	
	Если номенклатура <> неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.Ссылка = &номен";
		Запрос.УстановитьПараметр("номен",номенклатура);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка
			Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(Рез.Номенклатура, имяДопРеквизитаИмеетВариантКомплектации) <> рез.ИмеетВариантКомплектации Тогда
				оНоменклатура = Рез.Номенклатура.ПолучитьОбъект();
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНоменклатура,имяДопРеквизитаИмеетВариантКомплектации,рез.ИмеетВариантКомплектации);
				оНоменклатура.ОбменДанными.Загрузка = Истина;
				оНоменклатура.Записать();
			КонецЕсли
		Исключение
		КонецПопытки;
	КонецЦикла
КонецФУнкции

Функция ПолучитьТекстЗапросИмеетВариантКомплектации()
	ТекстЗапроса ="ВЫБРАТЬ
	              |	Номенклатура.Ссылка КАК Номенклатура,
	              |	МАКСИМУМ(НЕ Таблица.Ссылка ЕСТЬ NULL) КАК ИмеетВариантКомплектации
	              |ИЗ
	              |	Справочник.Номенклатура КАК Номенклатура
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРекв
	              |		ПО (ДопРекв.Ссылка = Номенклатура.Ссылка)
	              |			И (ДопРекв.Свойство.Заголовок = &имяДопРеквизитаИмеетВариантКомплектации)
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	              |		ПО (Таблица.Владелец = Номенклатура.Ссылка)
	              |			И (НЕ Таблица.Ссылка.ПометкаУдаления)
	              |			И (Таблица.ЭтоМатериалы = &ЭтоМатериалы)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	Номенклатура.Ссылка,
	              |	Таблица.Ссылка,
	              |	ДопРекв.Значение
	              |
	              |ИМЕЮЩИЕ
	              |	((НЕ Таблица.Ссылка ЕСТЬ NULL) <> ЕСТЬNULL(ДопРекв.Значение, ЛОЖЬ)
	              |		ИЛИ ДопРекв.Значение ЕСТЬ NULL)";
	
	Возврат ТекстЗапроса
				   
КонецФУнкции

Функция ВесНетто(Номенклатура) Экспорт
	свойствоНаименование = "Вес (нетто), кг";
	
	весНетто = алсав_ДопРеквизиты.ПолучитьДопРеквизит(Номенклатура, свойствоНаименование);
	
	Если весНетто = неопределено Тогда
		возврат 0.0;
	Иначе
		возврат весНетто;
	КонецЕсли;
	
КонецФункции

Функция Вес(Номенклатура)Экспорт
	Возврат ?(Номенклатура.ВесЗнаменатель > 0 ,
		Номенклатура.ВесЧислитель / Номенклатура.ВесЗнаменатель,
		0);
КонецФункции

Функция Объем(Номенклатура)Экспорт
	Возврат ?(Номенклатура.ОбъемЗнаменатель > 0 ,
		Номенклатура.ОбъемЧислитель / Номенклатура.ОбъемЗнаменатель,
		0);
КонецФункции


Функция ЗаполнитьВесИОбъем(номенклатура = Неопределено) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
				   |	ВариантыКомплектацииНоменклатуры.Владелец.ОбъемИспользовать КАК ОбъемИспользовать,
				   |	ВариантыКомплектацииНоменклатуры.Владелец.ВесИспользовать КАК ВесИспользовать,
	               |	МАКСИМУМ(ВариантыКомплектацииНоменклатуры.Ссылка) КАК Комплектация
	               |ИЗ
	               |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	               |ГДЕ
	               |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	               |	И ВариантыКомплектацииНоменклатуры.Основной = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВариантыКомплектацииНоменклатуры.Владелец";
	
	
	Если номенклатура <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"И ВариантыКомплектацииНоменклатуры.Основной = ИСТИНА",
			"И ВариантыКомплектацииНоменклатуры.Основной = ИСТИНА И ВариантыКомплектацииНоменклатуры.Владелец = &номенклатура"
		);
		
		Запрос.УстановитьПараметр("номенклатура",номенклатура);
			
	КонецЕсли;
	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Состав = АЛСАВ_Сборка.ПолучитьКомплектующиеНоменклатуры(Рез.Комплектация, неопределено, 1, истина);
		
		
		ВесЧисло = 0;
		ОбъёмЧисло = 0;
		ВесНеттоЧисло = 0;
		Для Каждого стр из Состав Цикл
			ВесЧисло = ВесЧисло + (алсав_ПечатьСчет.Вес(стр.Номенклатура, ИСТИНА) * (стр.Количество));
			ОбъёмЧисло = ОбъёмЧисло + (алсав_ПечатьСчет.Объем(стр.Номенклатура, ИСТИНА) * (стр.Количество));
			ВесНеттоЧисло = ВесНеттоЧисло + (Справочники.Номенклатура.ВесНетто(стр.Номенклатура) * (стр.Количество));
		КонецЦикла;
		
		
		Если ВесЧисло <> Справочники.Номенклатура.Вес(Рез.Номенклатура)
			ИЛИ ОбъёмЧисло <> Справочники.Номенклатура.Объем(Рез.Номенклатура)
			ИЛИ ВесНеттоЧисло <> Справочники.Номенклатура.ВесНетто(Рез.Номенклатура)
			ИЛИ (ВесЧисло = 0 И  Рез.ВесИспользовать ) 
			ИЛИ (ОбъёмЧисло = 0 И  Рез.ОбъемИспользовать )Тогда
			
			оНомен = Рез.Номенклатура.ПолучитьОбъект();
			Если Ложь Тогда оНомен = Справочники.Номенклатура.СоздатьЭлемент(); КонецЕсли;
			
			оНомен.ОбъемИспользовать = ОбъёмЧисло > 0;
			оНомен.ОбъемЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("кг");
			оНомен.ОбъемЧислитель = ОбъёмЧисло;
			оНомен.ОбъемЗнаменатель = 1;
			
			оНомен.ВесИспользовать = ВесЧисло > 0;
			оНомен.ВесЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("м3");
			оНомен.ВесЧислитель = ВесЧисло;
			оНомен.ВесЗнаменатель = 1;         
			
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен, "Вес (нетто), кг", ВесНеттоЧисло);
			
			оНомен.ОбменДанными.Загрузка = Истина;
			оНомен.Записать();
		КонецЕсли;
		
		
	КонецЦикла;	
КонецФункции

Функция ЗаполнитьГабаритыИКолвоУпаковок(номенклатура = Неопределено) ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |	алсав_СоставИзделий.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	алсав_СоставИзделий.Глубина КАК Глубина,
	               |	алсав_СоставИзделий.Ширина КАК Ширина,
	               |	алсав_СоставИзделий.Высота КАК Высота
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	               |		алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	               |		СУММА(алсав_СоставИзделий.Количество) КАК КоличествоУпаковок,
	               |		МАКСИМУМ(ВЫРАЗИТЬ(ДР_Глубина.Значение КАК ЧИСЛО)) КАК Глубина,
	               |		МАКСИМУМ(ВЫРАЗИТЬ(ДР_Ширина.Значение КАК ЧИСЛО)) КАК Ширина,
	               |		СУММА(ВЫРАЗИТЬ(ДР_Высота.Значение КАК ЧИСЛО) * алсав_СоставИзделий.Количество) КАК Высота
	               |	ИЗ
	               |		РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	               //|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Активен
	               //|			ПО (ДР_Активен.Ссылка = алсав_СоставИзделий.Номенклатура.Ссылка)
	               //|				И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	               //|				И (ДР_Активен.Значение.Наименование = ""Да"")
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_ТипСкладскогоУчета
	               |			ПО (ДР_ТипСкладскогоУчета.Ссылка = алсав_СоставИзделий.Номенклатура.Ссылка)
	               |				И (ДР_ТипСкладскогоУчета.Свойство.Заголовок = ""Тип складского учета"")
	               |				И (ДР_ТипСкладскогоУчета.Значение.Наименование = ""Одна упаковка"")
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Глубина
	               |			ПО (ДР_Глубина.Ссылка = алсав_СоставИзделий.Номенклатура.Ссылка)
	               |				И (ДР_Глубина.Свойство.Заголовок = ""Габаритные размеры упаковки, глубина"")
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Высота
	               |			ПО (ДР_Высота.Ссылка = алсав_СоставИзделий.Номенклатура.Ссылка)
	               |				И (ДР_Высота.Свойство.Заголовок = ""Габаритные размеры упаковки, высота"")
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Ширина
	               |			ПО (ДР_Ширина.Ссылка = алсав_СоставИзделий.Номенклатура.Ссылка)
	               |				И (ДР_Ширина.Свойство.Заголовок = ""Габаритные размеры упаковки, ширина"")
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		алсав_СоставИзделий.ПродуктНоменклатура,
	               |		алсав_СоставИзделий.ПродуктХарактеристика) КАК алсав_СоставИзделий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Глубина
	               |		ПО (ДР_Глубина.Ссылка = алсав_СоставИзделий.ПродуктНоменклатура.Ссылка)
	               |			И (ДР_Глубина.Свойство.Заголовок = ""Габаритные размеры упаковки, глубина"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Высота
	               |		ПО (ДР_Высота.Ссылка = алсав_СоставИзделий.ПродуктНоменклатура.Ссылка)
	               |			И (ДР_Высота.Свойство.Заголовок = ""Габаритные размеры упаковки, высота"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Ширина
	               |		ПО (ДР_Ширина.Ссылка = алсав_СоставИзделий.ПродуктНоменклатура.Ссылка)
	               |			И (ДР_Ширина.Свойство.Заголовок = ""Габаритные размеры упаковки, ширина"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_КоличествоУпаковокИзделия
	               |		ПО (ДР_КоличествоУпаковокИзделия.Ссылка = алсав_СоставИзделий.ПродуктНоменклатура.Ссылка)
	               |			И (ДР_КоличествоУпаковокИзделия.Свойство.Заголовок = ""Количество упаковок изделия"")
	               |ГДЕ
	               |	(алсав_СоставИзделий.Глубина <> ЕСТЬNULL(ДР_Глубина.Значение, 0)
	               |			ИЛИ алсав_СоставИзделий.Ширина <> ЕСТЬNULL(ДР_Ширина.Значение, 0)
	               |			ИЛИ алсав_СоставИзделий.Высота <> ЕСТЬNULL(ДР_Высота.Значение, 0)
				   |			ИЛИ алсав_СоставИзделий.КоличествоУпаковок <> ЕСТЬNULL(ДР_КоличествоУпаковокИзделия.Значение, 0))";
	
	
		Если номенклатура <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"(алсав_СоставИзделий.Глубина <> ЕСТЬNULL(ДР_Глубина.Значение, 0)",
			"алсав_СоставИзделий.ПродуктНоменклатура = &номенклатура И (алсав_СоставИзделий.Глубина <> ЕСТЬNULL(ДР_Глубина.Значение, 0)"
		);
		
		Запрос.УстановитьПараметр("номенклатура",номенклатура);
			
	КонецЕсли;

	
	рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл 
		оНомен = Рез.ПродуктНоменклатура.ПолучитьОбъект();
		Если Ложь Тогда оНомен = Справочники.Номенклатура.СоздатьЭлемент(); КонецЕсли;		
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен, "Габаритные размеры упаковки, глубина", рез.Глубина);
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен, "Габаритные размеры упаковки, высота", рез.Высота);
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен, "Габаритные размеры упаковки, ширина", рез.Ширина);
		алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНомен, "Количество упаковок изделия", рез.КоличествоУпаковок);
		оНомен.ОбменДанными.Загрузка = Истина;
		оНомен.Записать();

	КонецЦикла;
КонецФункции