
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ)
	// Вставить содержимое метода.    
	
	лкСсылка = ЭтотОбъект.Ссылка; 
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		
		Если ЭтотОбъект.ЭтоНовый() Тогда
			лкСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.УстановитьСсылкуНового(лкСсылка);
		КонецЕсли;
		
		//гуид = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ЭтотОбъект, "GUID");
		//Если НЕ ЗначениеЗаполнено(гуид) Тогда
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(ЭтотОбъект, "GUID", ""+лкСсылка.УникальныйИдентификатор());
		//КонецЕсли;
		
	КонецЕсли;
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Артикул) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.Ссылка <> &Ссылка
		               |	И Номенклатура.Артикул = &Артикул";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Артикул",ЭтотОбъект.Артикул);
		
		рез = Запрос.Выполнить().Выбрать();
		Если рез.Следующий() Тогда
			Сообщить("Артикул ["+ЭтотОбъект.Артикул+"] уже установлен для номенклатуры ["+рез.Ссылка+"]");
			Отказ = Истина;;
		Конецесли;           
	КонецЕсли;

КонецПроцедуры
