
&После("ОбработкаПроведения")
Процедура алсав_ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое метода.   
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗонаОтгрузки) Тогда
		фЕстьИзменения = ложь;
		мЗаписи = новый Массив;
		
		Для Каждого запись из Движения.ТоварыВЯчейках Цикл   
			Если запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				мЗаписи.Добавить(запись);
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого запись из мЗаписи Цикл
			нЗапись = Движения.ТоварыВЯчейках.Добавить();
			ЗаполнитьЗначенияСвойств(нЗапись, запись);
			нЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			нЗапись.Ячейка = ЭтотОбъект.ЗонаОтгрузки;
			
			фЕстьИзменения = истина;
		КонецЦикла;
		
		Если фЕстьИзменения = истина Тогда
			Движения.ТоварыВЯчейках.Записать(истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
