

Процедура ЗаполнитьВариантДоставки(ссылкаНаОбъект) ЭКСПОРТ
	
	этоСсылка = (ТипЗнч(ссылкаНаОбъект) <> Тип("ДокументОбъект.ТранспортнаяНакладная"));
		
	об = ссылкаНаОбъект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тн.Ссылка КАК Ссылка,
	               |	р.Реализация КАК Реализация,
	               |	р.ЗаказКлиента КАК ЗаказКлиента,
	               |	р.Значение КАК Значение
	               |ИЗ
	               |	Документ.ТранспортнаяНакладная.ДокументыОснования КАК тн
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			тр.Ссылка КАК Реализация,
	               |			др.Ссылка КАК ЗаказКлиента,
	               |			др.Значение КАК Значение
	               |		ИЗ
	               |			Документ.РеализацияТоваровУслуг.Товары КАК тр
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК др
	               |				ПО (др.Ссылка В (тр.Ссылка.ЗаказКлиента, тр.ЗаказКлиента))
	               |					И (др.Свойство.Заголовок = ""Вариант доставки"")) КАК р
	               |		ПО тн.ДокументОснование = р.Реализация
	               |ГДЕ
	               |	(тн.Ссылка = &тнСсылка
	               |			ИЛИ р.Реализация = &тнСсылка
	               |			ИЛИ р.ЗаказКлиента = &тнСсылка)";  
	
	Запрос.УстановитьПараметр("тнСсылка",ссылкаНаОбъект.Ссылка);  
	
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда 
		Если ЗначениеЗаполнено(рез.Значение) Тогда			
			Если этоСсылка Тогда
				об = рез.Ссылка.ПолучитьОбъект();
				об.алсав_ВариантДоставки = рез.Значение;
				об.ОбменДанными.Загрузка = истина;
				об.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				об.алсав_ВариантДоставки = рез.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры