
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое метода.  
	
	//Проверка водителя
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.Наименование = &Наименование";  
	
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Водитель);
	
	рез = Запрос.Выполнить();
	 
	Если Рез.Пустой() Тогда
		Сообщить("Водитель ["+ЭтотОбъект.Водитель+"] не найден в справочнике физических лиц");
	КонецЕсли; 
	
	Если НЕ ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Документы.ТранспортнаяНакладная.ЗаполнитьВариантДоставки(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура алсав_ПриЗаписи(Отказ)
	
КонецПроцедуры
