
&НаСервере
Процедура алсав_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// Вставить содержимое обработчика.
	алсав_ПроверитьТовары_ИмеетВарианткомплектации();
КонецПроцедуры


&НаСервере
Процедура алсав_ПроверитьТовары_ИмеетВарианткомплектации()
	// Вставить содержимое обработчика.
	
	естьОшибка = Ложь;
	
	Для каждого стр из Объект.Товары Цикл
		естьВариант = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Номенклатура,"Имеет вариант комплектации");
		Если естьВариант = Истина Тогда
			естьОшибка = истина;
			Сообщить("Номенклатура имеет вариант комплектации - ["+стр.Номенклатура+"]");
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.естьКомплектУпаковка.Видимость = естьОшибка;
	
	
	особКомпл = "";
	особКомпл = ПолучитьОсобКомпл();

	Для каждого стр из Объект.Товары Цикл
		данныеПоВариантукомплектации =  получитьВариантКомплектации(   
				стр.Номенклатура,
			    стр.Характеристика,
				особКомпл
			);
		стр.КоличествоВариантовКомплектацииНоменклатуры = данныеПоВариантукомплектации.КоличествоВариантовКомплектацииНоменклатуры;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура алсав_ТоварыПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	алсав_ПроверитьТовары_ИмеетВарианткомплектации();
КонецПроцедуры



&НаКлиенте
Процедура алсав_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	проверитьВариантКомплектации();
КонецПроцедуры


&НаКлиенте
Процедура алсав_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	проверитьВариантКомплектации();
КонецПроцедуры


&НаКлиенте
Функция проверитьВариантКомплектации()
	Если Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

	
	стр = ЭтаФорма.Элементы.Товары.ТекущиеДанные;
	Если стр <> неопределено тогда
		особКомпл = "";
		особКомпл = ПолучитьОсобКомпл();
		
		Если НЕ ЗначениеЗаполнено(стр.ВариантКомплектацииНоменклатуры) Тогда
			данныеПоВариантукомплектации =  получитьВариантКомплектации(   
				ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура,
			    ЭтаФорма.Элементы.Товары.ТекущиеДанные.Характеристика,
				особКомпл
			);
			
			стр.ВариантКомплектацииНоменклатуры = данныеПоВариантукомплектации.ВариантыКомплектацииНоменклатуры;
			стр.КоличествоВариантовКомплектацииНоменклатуры = данныеПоВариантукомплектации.КоличествоВариантовКомплектацииНоменклатуры;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьОсобКомпл()
	попытка
		описаниеСвойства = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.Выгрузить().Найти("Особенности комплектации (Проект)");
	Исключение
		Для каждого стр из Объект.ДополнительныеРеквизиты Цикл
			если стр.Свойство.Заголовок = "Особенности комплектации (Проект)" Тогда
				Возврат стр.Значение;
			КонецЕсли;
		КонецЦикла;
	Конецпопытки;
	
	Если ЗначениеЗаполнено(описаниеСвойства) Тогда
		
		имяРеквизита = описаниеСвойства.ИмяРеквизитаЗначение;
		
		Если ЗначениеЗаполнено(имяРеквизита) Тогда
		Попытка
			Возврат ЭтаФорма[имяРеквизита];
		Исключение
			сообщить("Ошибка получения [Особенности комплектации (Проект)]");
		КонецПопытки;
	КонецЕсли;

	КонецЕсли;
	
	
КонецФункции


&НаСервереБезКонтекста
Функция получитьВариантКомплектации(номенклатура, характеристика, особКомпл)
	
	результ = Новый Структура;
	результ.Вставить("ВариантыКомплектацииНоменклатуры",Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка());
	Запрос = Новый Запрос;
	основнойЗапрос="ВЫБРАТЬ
	               |	ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	               |ГДЕ
	               |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
	               |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
	               |	И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	               |	И ВариантыКомплектацииНоменклатуры.ЭтоМатериалы = ИСТИНА
	               |	И ВариантыКомплектацииНоменклатуры.Ссылка.ОсобенностиКомплектацииПроект В(&м_особКомпл)";
	 
	
	м_особКомпл = новый Массив;
	Если ЗначениеЗаполнено(особКомпл) тогда
		м_особКомпл.Добавить(особКомпл);
	Иначе		
		м_особКомпл.Добавить(Неопределено);
		м_особКомпл.Добавить(Справочники.Проекты.ПустаяСсылка());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец",номенклатура);
	Запрос.УстановитьПараметр("Характеристика",характеристика);
	Запрос.УстановитьПараметр("м_особКомпл", м_особКомпл);
	
	Запрос.Текст = основнойЗапрос;
	квери = Запрос.Выполнить();
	результатВыборки = квери.Выгрузить();
	
	результ.Вставить("КоличествоВариантовКомплектацииНоменклатуры",результатВыборки.Количество());
	Если результ.КоличествоВариантовКомплектацииНоменклатуры = 1 Тогда
		результ.ВариантыКомплектацииНоменклатуры = результатВыборки[0].Ссылка
	КонецЕсли;
	
	
	Возврат результ;
КонецФункции


&НаКлиенте
Процедура алсав_алсав_ОткрытьPDFНоменклатурыПосле(Команда)
	// Вставить содержимое обработчика.
	мНоменклатура = Новый Массив;
	Для Каждого стр из Объект.Товары Цикл
		мНоменклатура.Добавить(стр.Номенклатура);
	КонецЦикла;
	фф = алсав_алсав_ФайлыPDFНоменклатурыСервер(стр.Номенклатура);
	
	Для Каждого файл из фф Цикл
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(файл, 
			Неопределено, УникальныйИдентификатор,);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Функция алсав_алсав_ФайлыPDFНоменклатурыСервер(мНоменклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.Расширение = &pdf
	               |	И Файлы.ПометкаУдаления = ЛОЖЬ
	               |	И Файлы.ВладелецФайла В(&мНоменклатура)";
	Запрос.УстановитьПараметр("мНоменклатура",мНоменклатура);
	Запрос.УстановитьПараметр("pdf","pdf");
	
	возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции


&НаКлиенте
Процедура алсав_алсав_СформироватьПроектБазисПосле(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать проект'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "bprj";
	Диалог.Фильтр = НСтр("ru='bprj (*.bprj)|*.bprj'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);
КонецПроцедуры


&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			мВариантыКомплектации = Новый Массив;
			Для Каждого стр из Объект.Товары Цикл
				Если ЗначениеЗаполнено(стр.ВариантКомплектацииНоменклатуры) Тогда
					Если мВариантыКомплектации.Найти(стр.ВариантКомплектацииНоменклатуры) = неопределено Тогда
						мВариантыКомплектации.Добавить(стр.ВариантКомплектацииНоменклатуры);
					конецЕсли;
				Иначе
					Сообщить("Не заполнен вариант комплектации в строке "+стр.НомерСтроки);
				КонецЕсли;
			КонецЦикла;
			соотвествиеФайлов = алсав_ПолучитьИменяФайловБазис(мВариантыКомплектации);
			Если ЛОЖЬ Тогда соотвествиеФайлов = новый Соответствие(); конецЕсли;
			
			файлы = новый Массив;	
			Для Каждого стр из Объект.Товары Цикл
				
				Если ЗначениеЗаполнено(стр.ВариантКомплектацииНоменклатуры) Тогда
					полныйПутьКФайлу = соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры);
					Если полныйПутьКФайлу<>неопределено Тогда
						файлИнфо = новый Файл(соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры));
						файлы.Добавить(Новый Структура("Type,Name,SubName,Sign,Note,Comment,Count",
							5,
							соотвествиеФайлов.Получить(стр.ВариантКомплектацииНоменклатуры),
							Неопределено,
							файлИнфо.ИмяБезРасширения,
							Неопределено,
							Неопределено,
							Формат(стр.Количество,"ЧГ=0")
						));   
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ListFiles = новый Структура("File",файлы);
			CuttingInfo = новый  Структура("Parameters,ProductCount",Неопределено,1); ;
			
			DataProject = новый Структура;
			DataProject.Вставить("ListFiles",ListFiles);
			DataProject.Вставить("CuttingInfo",CuttingInfo);
			DataProject.Вставить("EstimateInfo",Неопределено);
			
			
			Document = новый Структура;
			Document.Вставить("DataProject", DataProject);
			
			проект = новый Структура;
			проект.Вставить("Document", Document);
			 	
			
			ЗаписьXML = Новый ЗаписьXML; 
			ЗаписьXML.УстановитьСтроку();
			
			ToXML(ЗаписьXML,проект);
			
			xml = ЗаписьXML.Закрыть();
			
			тд = Новый ТекстовыйДокумент();
			тд.УстановитьТекст(xml);
			//тд.Показать(Объект.Номер);
			
			тд.Записать(ИмяФайла);
			
			Сообщить("Файл сформирован: "+ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры


&НаКлиенте
Функция ToXML(ЗаписьXML, эл)
	Если ТипЗнч(эл) = Тип("Структура") Тогда
		Если ЛОЖЬ Тогда эл = Новый Структура; КонецЕсли;
		Для Каждого ф из эл Цикл
			Если ТипЗнч(ф.Значение)=Тип("Массив") Тогда
				Для каждого б из ф.Значение Цикл
					ЗаписьXML.ЗаписатьНачалоЭлемента(ф.Ключ);	
					ToXML(ЗаписьXML,б);
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЦикла;
			иначе
				
				ЗаписьXML.ЗаписатьНачалоЭлемента(ф.Ключ);	
				ToXML(ЗаписьXML,ф.Значение);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			
			КонецЕсли;
			
		КонецЦикла;		
	//ИначеЕсли ТипЗнач(эл)=Тип("Массив") Тогда
	//	Если ЛОЖЬ Тогда эл = Новый Массив; КонецЕсли;
	Иначе
		ЗаписьXML.ЗаписатьТекст(строка(эл));
	конецЕсли;
КонецФункции


&НаСервереБезКонтекста
Функция алсав_ПолучитьИменяФайловБазис(мВариантыКомплектации)
	// Вставить содержимое обработчика.
	
	результ = Новый Соответствие();
	Для Каждого вариантКомплектации ИЗ мВариантыКомплектации Цикл
		путь = алсав_ДопРеквизиты.ПолучитьДопСведение(вариантКомплектации,"Файл модели");
		путь = СтрЗаменить(путь,"\\192.168.0.230\shared\","");
		результ.Вставить(вариантКомплектации,путь);
	КонецЦикла;
	
	
	Возврат результ;
КонецФункции

&НаСервереБезКонтекста
Функция алсав_ПолучитьИменяФайловБазисИзХарактеристики(мХарактеристики)
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПутьКФайлу.Ссылка КАК Характеристика,
	               |	ПутьКФайлу.Значение КАК Путь
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ПутьКФайлу
	               |ГДЕ
	               |	ПутьКФайлу.Ссылка В(&мХарактеристики)
	               |	И ПутьКФайлу.Свойство.Заголовок = ""Путь""";
	
	Запрос.УстановитьПараметр("мХарактеристики",мХарактеристики);
	
	рез = Запрос.Выполнить().Выбрать();
	
	результ = Новый Соответствие();
	пока рез.Следующий() Цикл
		результ.Вставить(рез.Характеристика,рез.Путь);
	КонецЦикла;
	
	
	Возврат результ;
КонецФункции

&НаКлиенте
Процедура алсав_алсав_ВариантыКомплектацииНоменклатурыПосле(Команда)
	// Вставить содержимое обработчика.
	бэк = Элементы.Товары.ТекущаяСтрока;
	Для Каждого стр из Объект.Товары Цикл
		Элементы.Товары.ТекущаяСтрока = стр.ПолучитьИдентификатор();
		проверитьВариантКомплектации();
	КонецЦикла;
	Элементы.Товары.ТекущаяСтрока = бэк;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_ОчиститьВариантыКомплектацииПосле(Команда)
	Для каждого стр из Объект.Товары Цикл
		стр.ВариантКомплектацииНоменклатуры = неопределено;
	КонецЦикла;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура алсав_СоздатьСписаниеМатериаловПосле(Команда)
	// Вставить содержимое обработчика.
	
	мКСписанию = алсав_ПолучитьМаетиралыДляСписания(Объект.Ссылка);
	
	мФорма = ПолучитьФорму("Документ.СписаниеНедостачТоваров.ФормаОбъекта");
	ДанныеФормы = мФорма.Объект;	
	ДанныеФормы.Дата = ТекущаяДата();
	//ДанныеФормы.Основание = ЭтаФорма.Объект.Ссылка;
	ДанныеФормы.ЗаказПоставщику = ЭтаФорма.Объект.Ссылка;
	
	Для каждого стр из мКСписанию Цикл
		нСтр = ДанныеФормы.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр, стр);
	КонецЦикла;
	
	мФорма.Открыть();
КонецПроцедуры


&НаСервереБезКонтекста
Функция алсав_ПолучитьМаетиралыДляСписания(ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Номенклатура КАК Номенклатура,
	               |	Т.Характеристика КАК Характеристика,
	               |	СУММА(Т.Всего) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_Заказы.Ссылка КАК ЗаказПоставщику,
	               |		комплектация.Номенклатура.Артикул КАК Артикул,
	               |		комплектация.Номенклатура КАК Номенклатура,
	               |		комплектация.Характеристика КАК Характеристика,
	               |		комплектация.Упаковка КАК Упаковка,
	               |		комплектация.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	               |		ВТ_Заказы.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	               |		комплектация.Количество КАК Количество,
	               |		ВТ_Заказы.КоличествоУпаковок КАК КоличествоРодитель,
	               |		комплектация.Количество * ВТ_Заказы.КоличествоУпаковок КАК Всего
	               |	ИЗ
	               |		Документ.ЗаказПоставщику.Товары КАК ВТ_Заказы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК комплектация
	               |			ПО (комплектация.Ссылка = ВТ_Заказы.ВариантКомплектацииНоменклатуры)
	               |	ГДЕ
	               |		ВТ_Заказы.Ссылка = &ЗаказПоставщику) КАК Т
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Т.Характеристика,
	               |	Т.Номенклатура";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику",ссылка);
	
	
	прототип = "Номенклатура,Характеристика,Количество";
	результ = новый Массив;
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		списатьМатериалы = алсав_ДопРеквизиты.ПолучитьДопРеквизит(рез.Номенклатура,"Списывать материалы");
		Если (списатьМатериалы = Истина)ИЛИ(Строка(списатьМатериалы) = "Да") Тогда
			стр = Новый Структура(прототип);
			ЗаполнитьЗначенияСвойств(стр, рез);
			результ.Добавить(стр);
		КонецЕсли;
	КонецЦикла;
	Возврат результ;
КонецФункции

&НаКлиенте
Процедура алсав_алсав_МатериалыКСписаниюПосле(Команда)
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыКСписанию","Да");
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ОтчетКакНазаватьПосле(Команда)
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыПоЗаданию");
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_СписаниеБазисПосле(Команда)
	// Вставить содержимое обработчика.
	СформироватьОтчет_ВО_МатериалыПоЗаданию("СписаниеБазис", "Нет");
КонецПроцедуры



&НаКлиенте
Функция СформироватьОтчет_ВО_МатериалыПоЗаданию(имяВарианта, СписыватьМатериалы = неопределено)
	ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ф = ПолучитьФорму("Отчет.ВО_МатериалыПоЗаданию.Форма", ПараметрыОтчета, ЭтаФорма, Истина);
	ф.УстановитьТекущийВариант(имяВарианта);                                              	
	
	КомпоновщикНастроек = ф.Отчет.КомпоновщикНастроек;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для Каждого элемент из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(элемент.Параметр) = "ЗаказПоставщику" Тогда
				элемент.Значение = Объект.Ссылка;
				элемент.Использование = Истина;
			ИначеЕсли (Строка(элемент.Параметр) = "СписыватьМатериалы") и (СписыватьМатериалы <> неопределено) Тогда
					
				св = ПолучитьЗначенияСписыватьМатериалы(СписыватьМатериалы);				
				сп = Новый СписокЗначений;
				сп.ЗагрузитьЗначения(св);
				
				элемент.Значение = сп;
				элемент.Использование = Истина;
			Иначе
				элемент.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	ф.Открыть();
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьЗначенияСписыватьМатериалы(СписыватьМатериалы)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ  Справочник.ЗначенияСвойствОбъектов ГДЕ Наименование = """+СписыватьМатериалы+""" И Владелец.Заголовок = ""Списывать материалы""";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции


&НаСервере
&После("УстановитьУсловноеОформление")
Процедура алсав_УстановитьУсловноеОформление()
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВариантКомплектацииНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоВариантовКомплектацииНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.СобытиеОтказ);

КонецПроцедуры


&НаКлиенте
Процедура алсав_алсав_МатериалыПоУпаковкамПосле(Команда)
	// Вставить содержимое обработчика.
	СформироватьОтчет_ВО_МатериалыПоЗаданию("МатериалыПоУпаковкам");
КонецПроцедуры


&НаСервере
Процедура алсав_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	полныеОбъединитьОдинаковыеПозицииЗаказаПоставщика = УправлениеДоступом.ЕстьРоль(Метаданные.Роли.АЛСАВ_ОбъединитьОдинаковыеПозицииЗаказаПоставщика.Имя);
	ЭтаФорма.Элементы.ФормаОбъединитьОдинаковыеПозиции.Видимость = полныеОбъединитьОдинаковыеПозицииЗаказаПоставщика;
КонецПроцедуры


&НаСервере
Процедура алсав_ОбъединитьОдинаковыеПозицииПослеНаСервере()
	// Вставить содержимое обработчика.
	тч = ЭтаФорма.Объект.Товары.Выгрузить();
	ЭтаФорма.Объект.Товары.Очистить();
	
	//тч.Свернуть(
	//	"НоменклатураПартнера, Номенклатура, Характеристика, Упаковка, Цена, СтавкаНДС",
	//	"КоличествоУпаковок, Количество, Сумма, СуммаНДС, СуммаСНДС"
	//);
	
	инд = тч.Количество()-1;
	Пока инд>0 Цикл
		стр = тч[инд];
		ф = 0;
		Пока ф < инд цикл
			нСтр = тч[ф];
			
			Если нСтр.Номенклатура = стр.Номенклатура и нСтр.Характеристика = стр.Характеристика Тогда
				нСтр.Количество = нСтр.Количество + стр.Количество;
				нСтр.КоличествоУпаковок = нСтр.КоличествоУпаковок + стр.КоличествоУпаковок;
				нСтр.Сумма = нСтр.Сумма + стр.Сумма;
				нСтр.СуммаНДС = нСтр.СуммаНДС + стр.СуммаНДС;
				нСтр.СуммаСНДС = нСтр.СуммаСНДС + стр.СуммаСНДС;
				тч.Удалить(стр);
				break;
			КонецЕсли;			
			ф = ф + 1
		КонецЦикла;	
		
		инд = инд - 1;
	КонецЦикла;
	
	ЭтаФорма.Объект.Товары.Загрузить(тч); 
КонецПроцедуры


&НаКлиенте
Процедура алсав_ОбъединитьОдинаковыеПозицииПосле(Команда)
	алсав_ОбъединитьОдинаковыеПозицииПослеНаСервере();
КонецПроцедуры

