Перем ДанныеОтладки Экспорт;
Перем СсылкаНаМодуль Экспорт; 

Процедура Инициализировать(ОбработкаКонтурEDI, КэшироватьОсновнойМодуль = Истина) Экспорт
	
	СписокСвойств = "ПодключаемыйМодульСообщатьОСобытиях,ПодключаемыйМодульИспользоватьОтладку,ПодключаемыйМодульСобытиеОтладки";
	ДанныеОтладки = ОбработкаКонтурEDI.ПолучитьСписокСвойствEDI(СписокСвойств);
	
	Если КэшироватьОсновнойМодуль = Истина Тогда
		СсылкаНаМодуль = ОбработкаКонтурEDI;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбработатьСобытиеКонтурEDI(ИмяСобытия, Параметры, СтандартнаяОбработкаEDI = Истина) Экспорт
	
	// Данная функция - основная точка входа в ПМ, здесь происходит обработка всех возможных событий.
	// Если вам нужно что-то изменить в типовой логике модуля, но вы не знаете, каким событием воспользоваться, просто напишите здесь 
	// Сообщить(ИмяСобытия);
	// И в пользовательском режиме отслеживайте, какие события вызываются при действиях пользователя.
	
	//Примеры обработки событий можно посмотреть в методе ПримерыОбработкиСобытий()
	//Для получения полного списка поддерживаемых событий см. метод СобытияПодключаемогоМодуляРасширений_КонтурEDI() основного модуля
	
	ОсновнойМодуль = Неопределено;
	
	Если Не СсылкаНаМодуль = Неопределено Тогда 
		ОсновнойМодуль = СсылкаНаМодуль;
	Иначе  
		Параметры.Свойство("ОсновнойМодуль",ОсновнойМодуль);
	КонецЕсли;
	
	ОткрытьКонструктор(ИмяСобытия, Параметры, СтандартнаяОбработкаEDI, ОсновнойМодуль);
	
	Если ИмяСобытия = "ПослеПодготовкиИсходящегоСообщения" Тогда  
		
		//++СКБ Контур, Морозова А., 21.11.2024, E1C_in-199873
		
		Сообщение = Параметры.Сообщение;    
		ДокументСсылка = Параметры.ДокументСсылка;		
		
		Если Сообщение.ТипСообщения= "COINVOIC" 
			И ОсновнойМодуль.ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "КодСети") = "hoff"  Тогда     
			
			Комментарий = ДокументСсылка.ДокументОснование.Комментарий;
			
			Если Комментарий <> Неопределено Тогда 		
				//МассивКомментария = СтрРазделить(Комментарий, " "); 
				//НомерПретензии =  Прав(Лев(МассивКомментария[1],СтрДлина(МассивКомментария[1])-1), СтрДлина(МассивКомментария[1])-2); 
				
				Сообщение.Комментарий = Комментарий;
				
			КонецЕсли;
			
		КонецЕсли;  
		//--СКБ Контур, Морозова А., 21.11.2024, E1C_in-199873
		
	КонецЕсли; 
	
	///// АЛСАВ
	Если ИмяСобытия = "ПослеПолученияТоваровДокумента1С" Тогда 
		Если Параметры.Источник = "PRICAT"
			ИЛИ Параметры.Источник = "PRICELIST" Тогда
			
				мНомен = Параметры.ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"); 
				ЗапросЦены = Новый Запрос;
				ЗапросЦены.Текст = "ВЫБРАТЬ
				                   |	ЦеныНоменклатурыСрезПервых.Номенклатура КАК Номенклатура,
				                   |	ЦеныНоменклатурыСрезПервых.Характеристика КАК Характеристика,
				                   |	ЦеныНоменклатурыСрезПервых.Цена КАК Цена
				                   |ИЗ
				                   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПервых
				                   |ГДЕ
				                   |	ЦеныНоменклатурыСрезПервых.Номенклатура В(&Номенклатура)
				                   |	И ЦеныНоменклатурыСрезПервых.ВидЦены = &ВидЦены";
				
				ЗапросЦены.УстановитьПараметр("ВидЦены",Справочники.ВидыЦен.НайтиПоНаименованию("ВсеИнструменты.ру, РРЦ"));
				ЗапросЦены.УстановитьПараметр("Номенклатура",мНомен);   
				ценыВИ = ЗапросЦены.Выполнить().Выгрузить();
				
				
			    Для Каждого Стр Из Параметры.ТаблицаТоваров Цикл
					
					Стр.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьХарактеристикуПоШтрихкоду(Стр.GTIN, Стр.Номенклатура);                 
					Стр.КоличествоОстаткаНаКонец = алсав_НоменклатураОстатки.ПолучитьДоступноСейчасСкладАдресногоХранения(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры);
					
					Если ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда
						Стр.Наименование = ""+Стр.Номенклатура +" "+ Стр.ХарактеристикаНоменклатуры; 
						Стр.КодТовараПоставщика	= алсав_ПечатьСчет.ПолучитьАртикул(Стр.Номенклатура, Стр.ХарактеристикаНоменклатуры, Параметры.Сообщение.Покупатель1С);
					КонецЕсли;
					
					Стр.Бренд = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Номенклатура,"Бренд");
					
					Стр.ВесБрутто = Справочники.Номенклатура.Вес(Стр.Номенклатура);    
					Стр.Высота = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Номенклатура,"Высота");
					Стр.Ширина = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Номенклатура,"Ширина");
					Стр.Глубина = алсав_ДопРеквизиты.ПолучитьДопРеквизит(стр.Номенклатура,"Глубина");
					
					Стр.ЕдиницаВысоты = "CMT";
					Стр.ЕдиницаГлубины = "CMT";
					Стр.ЕдиницаШирины = "CMT";
					
					Стр.ИмяПроизводителя = "ALSAV";
					
					ценаВИ = ценыВИ.Найти(Стр.ХарактеристикаНоменклатуры);
					Если ценаВИ <> неопределено Тогда
						Стр.РекомендуемаяРозничнаяЦена=ценаВИ.Цена;
					Иначе
						Стр.РекомендуемаяРозничнаяЦена=0;
					КонецЕсли;
				КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменитьЗапросПоНоменклатуреДляПрайсЛиста" Тогда
		Если Параметры.ДополнительныеПараметры.Партнер.Наименование = "ТС «ВсеИнструменты.ру»" Тогда
			Параметры.Запрос.Текст = СтрЗаменить(
				Параметры.Запрос.Текст,
				"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды",
				"
				|INNER JOIN (
				|		ВЫБРАТЬ ШК.Номенклатура,ШК.Характеристика,ШК.Упаковка,MAX(ШК.Штрихкод)Штрихкод ИЗ РегистрСведений.ШтрихкодыНоменклатуры КАК ШК
				|			INNER JOIN Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_Активен
	        	|			ПО ДР_Активен.Ссылка = ШК.Характеристика
	        	|				И (ДР_Активен.Свойство.Заголовок = ""Прайс-лист ВИ"")
	        	|				И (ДР_Активен.Значение.Наименование = ""Да"") 

				|		GROUP BY ШК.Номенклатура,ШК.Характеристика,ШК.Упаковка
				|) КАК Штрихкоды
				|"
			);    
			
			Параметры.Запрос.Текст = СтрЗаменить(
				Параметры.Запрос.Текст,
				"ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = Штрихкоды.Номенклатура",
				"ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = Штрихкоды.Номенклатура И ЦеныНоменклатурыСрезПоследних.Характеристика = Штрихкоды.Характеристика)"
			);
			
			Параметры.Запрос.Текст = СтрЗаменить(
				Параметры.Запрос.Текст,
				"ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура",
				"ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура И ЦеныНоменклатурыСрезПоследних.Характеристика = ТоварыНаСкладахОстатки.Характеристика)"
			);
		КонецЕсли;
	КонецЕсли;
	
	/////
	Возврат Неопределено;
	
КонецФункции

Процедура ПримерыОбработкиСобытий(ИмяСобытия)
	
	Если ИмяСобытия = "НастройкаОформленияТребуемыхДействий" Тогда
		
		//НастройкаОформленияТребуемогоДействия = Параметры.ТаблицаОформленияТребуемыхДействий;
		//
		//ОсновнойМодуль.ДобавитьСтрокуОформленияТребуемогоДействия(НастройкаОформленияТребуемогоДействия,"Счет-фактура выданный","Провести счет-фактуру","ПровестиДокумент",Истина,"ПровестиДокумент_СчетФактураВыданный",10);
		//ОсновнойМодуль.ДобавитьСтрокуОформленияТребуемогоДействия(НастройкаОформленияТребуемогоДействия,"Счет-фактура выданный","Создать счет-фактуру","ВвестиНаОсновании",Истина,"СоздатьДокумент_СчетФактураВыданный",11);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПередОбновлениемСпискаЗадач" Тогда
		
		// Вызывается перед сборкой окончательного списка задач. 
		// Рекомендуется для выполнения кастомных запросов на автоматическое привязываение сообщений к документам и прочих подобных вещей.
		
	КонецЕсли;
	
	Если ИмяСобытия = "СвернутьТаблицуТоваровДляСообщения" Тогда
		
		// Позволяет переопределить логику сворачивания товаров для исходящего сообщения. 
		// Важно! В этом событии тип сообщения отражает тип документа, по которому происходит выборка товаров, 
		// например, когда в СФ нет табличной части товары, товары выбираются из РТУ, в этом случае 
		// тип сообщения для INVOIC будет DESADV. Проще ориентироваться на параметр Источник, 
		// его значения можно посмотреть в методе "ПолучитьТоварыДокументаДляСообщения"
		
		//ТаблицаТоваров = Параметры.ТаблицаТоваров;
		//Партнер = Параметры.Партнер;
		//Источник = Параметры.Источник;
		//ТипСообщения = Параметры.ТипСообщения;
		//
		//// #1 Например, свернем товары для INVOIC без учета серий и характеристик
		//Если Источник = "ПодготовкаСчетФактурыКОтправке" Тогда
		//	
		//	СтандартнаяОбработкаEDI = Ложь;
		//	
		//	Для каждого Стр Из ТаблицаТоваров Цикл
		//		ЗаполнитьЗначенияСвойств(Стр, Новый Структура("СерияНоменклатуры,ХарактеристикаНоменклатуры"));
		//	КонецЦикла;	
		//		
		//	СуммируемыеПоля = "Количество,Сумма,СуммаБезНДС,СуммаНДС,СуммаСНДС";
		//	ГруппируемыеПоля = "GTIN,КодТовараПокупателя,КодТовараПоставщика,КодЕдиницыИзмеренияEDI,Номенклатура,Наименование,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,Пометка,СтавкаНДС,Цена,ЦенаБезНДС,ЦенаСНДС,НомерГТД,Страна,ТипЕдиницы";
		//	
		//	НеОтправлятьКодПоставщика = (ОсновнойМодуль.ПолучитьЗначениеСвойстваОбъектаEDI(Партнер,"НеОтправлятьКодПоставщика")=Истина);
		//	Если НеОтправлятьКодПоставщика = Истина Тогда
		//		ГруппируемыеПоля = СтрЗаменить(ГруппируемыеПоля,"КодТовараПоставщика,","");
		//	КонецЕсли;
		//	ПоляГруппировкиМассив = ОсновнойМодуль.РазложитьСтроку(ГруппируемыеПоля);
		//	
		//	ПоляГруппировки = "";
		//	Для Каждого ИмяПоля Из ПоляГруппировкиМассив Цикл
		//		Если ТаблицаТоваров.Колонки.Найти(ИмяПоля)<>Неопределено Тогда
		//			ПоляГруппировки = ПоляГруппировки+","+ИмяПоля;
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	ПоляГруппировки = Сред(ПоляГруппировки,2);//обрежем первую запятую
		//	
		//	ТаблицаТоваров.Свернуть(ПоляГруппировки,СуммируемыеПоля);
		
		//КонецЕсли;
		
		//// #2 Отключим сворачивание только для DESADV
		//Если Источник = "ПодготовитьУведомлениеОбОтгрузке" Тогда
		//	СтандартнаяОбработкаEDI = Ложь;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьВиртуальныеСвязанныеORDERS" Тогда
		
		////Таб = Новый ТаблицаЗначений;
		////ДобавитьКолонкиВТаблицуЗначений(Таб,"ORDERS,ORDERS_ТипСообщения,ORDERS_Статус,Документ,ORDRSP,ORDRSP_Статус,ЭтоТекущийДокумент");
		//
		//Если Параметры.ДокументСсылка = Неопределено Тогда
		//	Возврат Неопределено
		//КонецЕсли;	
		//	
		//СтандартнаяОбработкаEDI = Ложь;
		//
		//Если ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//	Документ_ORDERS = Параметры.ДокументСсылка.ДокументОснование;
		//ИначеЕсли ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.МОЛ_ЗаказПоМаршруту") Тогда
		//	Документ_ORDERS = Параметры.ДокументСсылка;
		//КонецЕсли;
		//
		//
		//Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("Документ_ORDERS", Документ_ORDERS);
		//
		//Запрос.Текст = 
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	КонтурEDI_Сообщения.Ссылка,
		//|	КонтурEDI_Сообщения.ID
		//|ПОМЕСТИТЬ ВТ_ИД_ORDERS
		//|ИЗ
		//|	Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
		//|ГДЕ
		//|	КонтурEDI_Сообщения.ТипСообщения = ""ORDERS""
		//|	И КонтурEDI_Сообщения.Документ = &Документ_ORDERS
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	КонтурEDI_Сообщения_ORDERS.Ссылка КАК ORDERS,
		//|	КонтурEDI_Сообщения_ORDERS.ТипСообщения КАК ORDERS_ТипСообщения,
		//|	КонтурEDI_Сообщения_ORDERS.Статус КАК ORDERS_Статус,
		//|	ВЫРАЗИТЬ(КонтурEDI_Сообщения_ORDERS.Документ КАК Документ.МОЛ_ЗаказПоМаршруту) КАК Документ,
		//|	ВЫБОР
		//|		КОГДА КонтурEDI_Сообщения_ORDERS.Документ = &Документ_ORDERS
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ЭтоТекущийДокумент
		//|ПОМЕСТИТЬ ВТ_ORDERS
		//|ИЗ
		//|	ВТ_ИД_ORDERS КАК ВТ_ИД_ORDERS
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения_ORDERS
		//|		ПО ВТ_ИД_ORDERS.ID = КонтурEDI_Сообщения_ORDERS.ID
		//|			И (КонтурEDI_Сообщения_ORDERS.ТипСообщения = ""ORDERS""
		//|				ИЛИ КонтурEDI_Сообщения_ORDERS.ТипСообщения = ""#ORDERS"")
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Документ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЗаказПокупателя.Ссылка КАК Док_ORDRSP,
		//|	МОЛ_ЗаказПоМаршруту.Ссылка КАК Док_ORDERS
		//|ПОМЕСТИТЬ ВТ_Док_ORDRSP
		//|ИЗ
		//|	ВТ_ORDERS КАК ВТ_ORDERS
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МОЛ_ЗаказПоМаршруту КАК МОЛ_ЗаказПоМаршруту
		//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		//|			ПО (ЗаказПокупателя.ДокументОснование = МОЛ_ЗаказПоМаршруту.Ссылка)
		//|		ПО ВТ_ORDERS.Документ = МОЛ_ЗаказПоМаршруту.Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	КонтурEDI_Сообщения_ORDRSP.Ссылка КАК ORDRSP,
		//|	КонтурEDI_Сообщения_ORDRSP.Статус КАК ORDRSP_Статус,
		//|	ВТ_ORDERS.ORDERS,
		//|	ВТ_ORDERS.ORDERS_ТипСообщения,
		//|	ВТ_ORDERS.ORDERS_Статус,
		//|	ВТ_ORDERS.Документ,
		//|	ВТ_ORDERS.ЭтоТекущийДокумент
		//|ИЗ
		//|	ВТ_ORDERS КАК ВТ_ORDERS
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док_ORDRSP КАК ВТ_Док_ORDRSP
		//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения_ORDRSP
		//|			ПО ВТ_Док_ORDRSP.Док_ORDRSP = КонтурEDI_Сообщения_ORDRSP.Документ
		//|		ПО ВТ_Док_ORDRSP.Док_ORDERS = ВТ_ORDERS.Документ
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ВТ_ORDERS.ORDERS";
		//
		//Таб = Запрос.Выполнить().Выгрузить();
		//
		//Возврат Таб;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьСтавкуНДС" Тогда
		
		// СтандартнаяОбработкаEDI = Ложь;
		// СтавкаНДС = Параметры.СтавкаНДС;
		//
		//Если СтавкаНДС = Справочники.СтавкиНДС.Ставка10 Тогда
		//	Возврат 10
		//ИначеЕсли СтавкаНДС = Справочники.СтавкиНДС.Ставка18 Тогда
		//	Возврат 18
		//ИначеЕсли СтавкаНДС = Справочники.СтавкиНДС.Ставка20 Тогда
		//	Возврат 20
		//Иначе
		//	Возврат 0
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ДобавитьОсобенностиСообщений" Тогда
		//Это универсальный добавлятель полей в EDI, ключ поиска мест использования по:
		//	"Для каждого ОсобенностьСообщения Из ОсобенностиСообщений Цикл"
		//Это событие не добавляет поле объекта XDTO!!! убедитесь что xsd схема в макете СхемыСообщений знает про ваше поле
		
		////пример///////////////////////////////////
		//НоваяОсобенность = Параметры.ТаблицаОсобенностей.Добавить();
		//НоваяОсобенность.Партнер = "";                    //можно оставить пустым - тогда по всем будет, можно просто через запятую псевдонимы вида: tander, billa
		//НоваяОсобенность.ТипыСообщения = "DESADV";
		//НоваяОсобенность.Наименование = "ВСДUUID" ;  //наименование по сути только для представления пользователю. Везде обращаться следует только по идентификатору!
		//НоваяОсобенность.Идентификатор = "ВСДUUID" ;
		//НоваяОсобенность.Путьxml = "lineItem.vsdUUID" ;  //XDTO путь!
		//НоваяОсобенность.Направление = "Исходящее" ;	
		//НоваяОсобенность.ЭтоСтруктура = ложь; 
		//
		//НоваяОсобенность.Ревенство1СEDI = "=" ; // = / 1С / EDI	//
		//НоваяОсобенность.ТипЗначения1С = "Строка255" ;	
		//НоваяОсобенность.ТипЗначенияEDI = "Строка255" ;	
		//
		//НоваяОсобенность.ВыводитьВКарточке = Истина;
		//НоваяОсобенность.ВалидироватьЗаполнение = Истина;
		//НоваяОсобенность.ДобавитьНастройкуПартнера = Истина;     //галочку Булево  или или 
		
		////еще пример///////////////////////////////////
		//НоваяОсобенность = Параметры.ТаблицаОсобенностей.Добавить();
		//НоваяОсобенность.Партнер = "";
		//НоваяОсобенность.ТипыСообщения = "DESADV";
		//НоваяОсобенность.Наименование = "ТестовыйРеквизит" ;  
		//НоваяОсобенность.Идентификатор = "ТестовыйРеквизит" ;
		//НоваяОсобенность.Путьxml = "testUnit" ;                
		//НоваяОсобенность.Направление = "Исходящее" ;	
		//НоваяОсобенность.ЭтоСтруктура = ложь; 
		//
		//НоваяОсобенность.Ревенство1СEDI = "=" ; // = / 1С / EDI	//
		//НоваяОсобенность.ТипЗначения1С = "Строка255" ;	
		//НоваяОсобенность.ТипЗначенияEDI = "Строка255" ;	
		//
		//НоваяОсобенность.ВыводитьВКарточке = Истина;
		//НоваяОсобенность.ВалидироватьЗаполнение = Истина;
		//НоваяОсобенность.ДобавитьНастройкуПартнера = Ложь;     //галочку Булево  //или или 
		
		//Пример для keyValuePair
		//
		//Таб = Параметры.ТаблицаОсобенностей;
		//
		////ключи в шапке
		//ДобавитКлючЗначениеШапки(Таб,"ORDERS","Поставка","VBSTEL","1500-прямая поставка с завода ЧЕрМК (завод 1500); 1900 - поставка со склада хранения (завод 1900); 1902 - поставка со склада автозавода (завод 1902); 1500 - Завод ЧерМК ГП; 1511 - ГП СПЦ; 1901 - Промпорт.","Исходящее"); 
		//
		//ДобавитКлючЗначениеШапки(Таб,"ORDRSP, DESADV","Инкотермс","INCO","СКП - Склад Поставщика, CPT - Франко-фрахт.","Входящее"); 
		//ДобавитКлючЗначениеШапки(Таб,"ORDRSP, DESADV","Статус заказа","ORDSTAT","1 - заказ первичный ввод, 2 - заказ подписан с 2-х сторон,   3 - выдан в производство.","Входящее");
		//ДобавитКлючЗначениеШапки(Таб,"ORDRSP, DESADV","Пункт отгрузки","VBSTEL","1500 - прямая поставка с завода ЧЕрМК (завод 1500); 1900 - поставка со склада хранения (завод 1900); 1902 - поставка со склада автозавода (завод 1902); 1500 - Завод ЧерМК ГП; 1511 - ГП СПЦ; 1901 - Промпорт.","Входящее");
		//
		////ключи построчно
		//ДобавитКлючЗначениеСтроки(Таб,"ORDERS", "Поставка",  "VBELN","Исходящее");
		//ДобавитКлючЗначениеСтроки(Таб,"ORDERS", "Инкотермс", "INCO", "Исходящее");
		//ДобавитКлючЗначениеСтроки(Таб,"ORDERS", "VES_UPAK_DO", "VES_UPAK_DO", "Исходящее");
		//ДобавитКлючЗначениеСтроки(Таб,"ORDERS", "VES_UPAK_OT", "VES_UPAK_OT", "Исходящее");
		//ДобавитКлючЗначениеСтроки(Таб,"ORDERS", "Толщина", "TOL", "Исходящее");
		
	КонецЕсли;
	
	
	//+обработчики для учета особенностей текущей конфигурации
	//----------------------------------------------------------------------------------------------------------------
	
	Если ИмяСобытия = "ПередСвязываниемСообщенияСДокументомЧерезФорму" Тогда
		
		//// Параметры: Документ, Сообщение, Форма
		//// В результате необходимо вернуть СтруктураВозврата
		
		//СтруктураВозврата = Новый Структура;
		//СтруктураВозврата.Вставить("Успешно", 			Ложь);
		//СтруктураВозврата.Вставить("ОписаниеОшибки", 	"");
		
		//Документ = Параметры.Документ;
		//Сообщение = Параметры.Сообщение;
		//ТоварыСообщения = Параметры.Форма.Товары;
		//КоличествоОшибок = 0;
		
		//// Проверка на наличие сопоставленной точки доставки
		//Если НЕ ЗначениеЗаполнено(Сообщение.Грузополучатель1С.СвязанныйСправочник1) 
		//	ИЛИ НЕ ЗначениеЗаполнено(Сообщение.Грузополучатель1С.СвязанныйСправочник2) Тогда
		//	
		//	КоличествоОшибок = КоличествоОшибок + 1;
		//	СтруктураВозврата.ОписаниеОшибки = "Необходимо сопоставить точку доставки." + Символы.ПС;
		//	
		//КонецЕсли;
		//
		//// Проверка на наличие номенклатуры документа в сопоставлениях товаров из сообщения
		//// Написано для УФ_УТ, при необходимости внести изменения
		//ВсеСоответствияСообщения = Новый ТаблицаЗначений;
		//ВсеСоответствияСообщения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//ВсеСоответствияСообщения.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		//Массив = Новый Массив;
		//Массив.Добавить(Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		//Массив.Добавить(Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
		//ОписаниеТиповЕдиницаИзмерения = Новый ОписаниеТипов(Массив); 
		//ВсеСоответствияСообщения.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТиповЕдиницаИзмерения);
		//
		//Для каждого Строка Из ТоварыСообщения Цикл
		//	
		//	СоответствияСтроки = ОсновнойМодуль.СоответствиеТоваров_НайтиНоменклатуру(Строка.GTIN, Строка.КодТовараПокупателя, Сообщение.Партнер);		 
		//	
		//	Для каждого Стр Из СоответствияСтроки Цикл
		//		НоваяСтрока = ВсеСоответствияСообщения.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		//	КонецЦикла;
		//	
		//КонецЦикла;
		//
		//Для каждого Строка Из Документ.Товары Цикл
		//	
		//	СтруктураПоиска = Новый Структура(
		//						"Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",
		//						Строка.Номенклатура,
		//						Строка.Характеристика,
		//						?(ЗначениеЗаполнено(Строка.Упаковка), Строка.Упаковка, Строка.Номенклатура.ЕдиницаИзмерения));
		//	
		//	НайденныеСтроки = ВсеСоответствияСообщения.НайтиСтроки(СтруктураПоиска);
		//	
		//	Если НайденныеСтроки.Количество() = 0 Тогда
		//		КоличествоОшибок = КоличествоОшибок + 1;
		//		
		//		Если Найти(СтруктураВозврата.ОписаниеОшибки, "В товарах сообщения не найдены товары из документа:") = 0 Тогда
		//			СтруктураВозврата.ОписаниеОшибки = СтруктураВозврата.ОписаниеОшибки + "В товарах сообщения не найдены товары из документа:" + Символы.ПС;
		//		КонецЕсли;
		//		
		//		СтруктураВозврата.ОписаниеОшибки = 	СтруктураВозврата.ОписаниеОшибки + """" + Строка.Номенклатура.Наименование + """"
		//			+ ?(ЗначениеЗаполнено(Строка.Характеристика), ", Характеристика: """ + Строка.Характеристика, "")
		//			+ ", ед. изм.: """ + ?(ЗначениеЗаполнено(Строка.Упаковка), Строка.Упаковка.Наименование, Строка.Номенклатура.ЕдиницаИзмерения.Наименование) + """." + Символы.ПС;					
		//	КонецЕсли;
		//	
		//КонецЦикла;
		//
		//Если КоличествоОшибок = 0 Тогда
		//	СтруктураВозврата.Успешно = Истина;
		//Иначе
		//	СтруктураВозврата.ОписаниеОшибки = "Документ не привязан по причинам:" + Символы.ПС + СтруктураВозврата.ОписаниеОшибки;
		//КонецЕсли;
		//
		//// необходимо вернуть структуру 
		//Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПередАвтоотправкойСообщения" Тогда
		
		////Параметры: СтрокаСообщения, ТипСообщения
		////Используется для гибкой настройки автоотправки сообщений в разрезе организаций поставщика
		//
		//Организация		= Параметры.СтрокаСообщения.Организация;
		//ТипСообщения	= Параметры.ТипСообщения;	
		//
		//ЗаблокированныеСообщения = "PORDERS,ORDRSP,DESADV,INVOIC"; //Укажите какие сообщения заблокированы по организации
		//Если Найти(ЗаблокированныеСообщения,ТипСообщения)>0 Тогда
		//	Если Организация=Справочники.Организации.НайтиПоКоду("ВашКодОрганизацииПоКоторойЗаблокировано") Тогда  //Укажите Код организации по которой применять блокирование
		//		СтандартнаяОбработкаEDI = Ложь;  //Сам отказ от автоотправки этого сообщения
		//		Возврат Неопределено;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//////Блок можно повторять, тем самым накладывая проверки на несколько организааций.
		//////В общем случае у каждой организации могут быть заблокированы к автоотправке разные типы сообщений
		////ЗаблокированныеСообщения = "DESADV,INVOIC";  //например эти 2 сообщения
		////Если Найти(ЗаблокированныеСообщения,ТипСообщения)>0 Тогда
		////	Если Организация=Справочники.Организации.НайтиПоКоду("ВашКодДругойОрганизацииПоКоторойЗаблокированоИначе") Тогда  //Укажите Код организации по которой применять блокирование
		////		СтандартнаяОбработкаEDI = Ложь;  //Сам отказ от автоотправки этого сообщения
		////		Возврат Неопределено;
		////	КонецЕсли;
		////КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьРеквизитДокументаДляСообщения" Тогда
		
		//Параметры: Документ, Реквизит
		//Допустимые варианты реквизитов сейчас:
		//Договор, Контрагент, ВалютаДокумента, СуммаВключаетНДС, ДатаОтгрузки
		
		//Документ		= Параметры.Документ;
		//ИмяРеквизита	= Параметры.ИмяРеквизита;	
		//
		//Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//	
		//	Если ИмяРеквизита = "СуммаВключаетНДС" Тогда
		//		СтандартнаяОбработкаEDI = Ложь;
		//		Если ЗначениеЗаполнено(Документ.Магазин)
		//			И Документ.Магазин.Владелец.Код = "ук0007532" Тогда 
		//			Возврат Ложь;
		//		Иначе
		//			Возврат Истина;
		//		КонецЕсли;
		//	ИначеЕсли ИмяРеквизита = "Договор" Тогда
		//		СтандартнаяОбработкаEDI = Ложь;
		//		Возврат Неопределено;
		//	ИначеЕсли ИмяРеквизита = "Валюта" Тогда
		//		СтандартнаяОбработкаEDI = Ложь;
		//		Возврат Неопределено;	
		//	КонецЕсли;
		//	
		//Иначе			
		//	
		//	Если ИмяРеквизита = "Валюта" Тогда
		//		СтандартнаяОбработкаEDI = Ложь;
		//		Возврат Документ.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ФинальныйЗапросПостроенияСписка" Тогда
		
		// ******** Событие используется для изменения финального запроса построения списка 
		//- изменение этого запроса позволяет не терять в производительности при тяжелых кастомных операциях фильтрации списка
		
		//Можно построить дополнительные временные таблицы, размещая их до ВЫБРАТЬ РАЗРЕШЕННЫЕ основного запроса.
		//И использовать их данные для редактирования запроса
		
		
		////Пример 1 - Исключим строки с типом сообщения INVOIC по контрагентам, у которых в КонтурEDI_ДополнительныеРеквизиты установлено НетЭДО ИСТИНА
		////!!!Не работает на внешнем хранилище!!!
		//
		//ЗапросСКэшемПартнеров	= Параметры.ЗапросСКэшемПартнеров; //сам запрос, готовый к исполнению
		//РежимРаботы				= Параметры.РежимРаботы;           //Мы в этот момент поставщик или сеть?
		//
		////Замены в тексте запроса
		//ЧтоМеняем1="ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		//
		//НаЧтоМеняем1="ВЫБРАТЬ
		//|	КонтурEDI_ДополнительныеРеквизиты.Объект КАК КонтрагентБезINVOIC
		//|ПОМЕСТИТЬ ВТ_КонтрагентыБезINVOIC
		//|ИЗ
		//|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
		//|ГДЕ
		//|	КонтурEDI_ДополнительныеРеквизиты.Свойство = ""НетЭДО""
		//|	И КонтурEDI_ДополнительныеРеквизиты.Значение = ИСТИНА
		//|;
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		//ЗапросСКэшемПартнеров.Текст=СтрЗаменить(ЗапросСКэшемПартнеров.Текст,ЧтоМеняем1,НаЧтоМеняем1);
		//
		//ЧтоМеняем2="ВТ_ТабСообщений_Внешняя КАК ВТ_ТабСообщений_Внешняя";
		//
		//НаЧтоМеняем2="ВТ_ТабСообщений_Внешняя КАК ВТ_ТабСообщений_Внешняя
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыБезINVOIC КАК ВТ_КонтрагентыБезINVOIC
		//|		ПО ВТ_ТабСообщений_Внешняя.Документ.Контрагент = ВТ_КонтрагентыБезINVOIC.КонтрагентБезINVOIC
		//|";
		//ЗапросСКэшемПартнеров.Текст=СтрЗаменить(ЗапросСКэшемПартнеров.Текст,ЧтоМеняем2,НаЧтоМеняем2);
		//
		//ЧтоМеняем3="&УсловиеОрганизации";
		//
		//НаЧтоМеняем3="&УсловиеОрганизации 
		//|		 И (ВТ_КонтрагентыБезINVOIC.КонтрагентБезINVOIC ЕСТЬ NULL 
		//|		ИЛИ ВТ_ТабСообщений_Внешняя.ТипСообщения<>""INVOIC"")";
		//ЗапросСКэшемПартнеров.Текст=СтрЗаменить(ЗапросСКэшемПартнеров.Текст,ЧтоМеняем3,НаЧтоМеняем3);
		
		//Конец примера 1
		
		//Возможно требуется установка доп. параметров
		//ЗапросСКэшемПартнеров.УстановитьПараметр("НовыйПараметр1",ЗначениеПараметра1);
		
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПринятьВходящееСообщение" Тогда
		// ******** Можно создать целиком документ здесь на основании входящего сообщения
		// ВходящееСообщение	= Параметры.Сообщение;
		// ..... необходимо написать свой алгоритм создания документа
		// необходимо вернуть ссылку на созданный документ и изменить СтандартнаяОбработкаEDI на Ложь
		// СтандартнаяОбработкаEDI = Ложь;  // чтобы не вызывался стандартный алгоритм создания документа
		// Возврат ДокументСсылка;
	КонецЕсли;
	
	Если ИмяСобытия = "ПриЗагрузкеВходящегоСообщения" Тогда
		// вызывается, когда документ нашим модулем уже заполнен, но еще НЕ Записан
		
		// ВходящееСообщение	= Параметры.Сообщение;
		// ДокументСсылка		= Параметры.ДокументСсылка;    // - уже созданный по типовым правилам заказ покупателя, у которого можно дозаполнить свои поля
		
		//Если Параметры.Сообщение.ТипСообщения = "ORDERS" Тогда
		
		//установка в документ заказа основного подразделения, установленного для текущего пользователя
		//Параметры.ДокументСсылка.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделение");
		
		//установка в документ заказа основного склада, установленного для текущего пользователя
		//Если ЗначениеЗаполнено(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад")) Тогда
		//	Параметры.ДокументСсылка.СкладГруппа = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		//КонецЕсли;
		
		//дописать в комментарий документа заказа номер заказа
		//Параметры.ДокументСсылка.Комментарий = Параметры.ДокументСсылка.Комментарий + ". Заказ № " + Параметры.Сообщение.ДокументEDI.Номер;
		
		//дописать в комментарий документа заказа дату поставки
		//Параметры.ДокументСсылка.Комментарий = Параметры.ДокументСсылка.Комментарий + ". Дата поставки " + Строка(Параметры.Сообщение.ДатаПоставки);
		
		////Если хочется потестировать создание входящего заказа без его сохранения в базу, раскомментировать текст ниже
		////Это замена старой настройки "ОткрыватьФормуЗаказаПередЗаписью"
		
		//ФормаДокумента = Параметры.ДокументСсылка.ПолучитьФорму();
		//ФормаДокумента.ЭлементыФормы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ОсновнойМодуль.ПолучитьТипЗначенияОбъекта("ТочкаДоставкиСвоя"));
		//ФормаДокумента.ОткрытьМодально(); 
		//
		//СсылкаНаДокумент = Параметры.ДокументСсылка.Ссылка;		
		//
		//Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		//	ВызватьИсключение "Отменяем создание заказа";
		//КонецЕсли;
		
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЗагрузкиВходящегоСообщения" Тогда
		// вызывается, когда документ нашим модулем уже заполнен и записан. Вызывается сразу после записи документа
		
		// ВходящееСообщение	= Параметры.Сообщение;
		// ДокументСсылка		= Параметры.ДокументСсылка;    // - уже созданный по типовым правилам заказ покупателя, у которого можно дозаполнить свои поля
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПередЗаписьюОбъектаСообщения" Тогда
		//Сразу после этого элемент справочника КонтурEDI_Сообщения будет записан в базу данных.
		//Здесь можно изменить логику сохранения, в том числе изменить статус/требуемое дуствие/ и любой реквизит
		//Обратите внимание что передается СообщениеОбъект - элемент справочника а не структура сообщения. 
		//Сама структура сообщения может быть получена так:  СообщениеСтруктура=Параметры.СообщениеОбъект.Хранилище.Получить();
		
		//Пример - пропуск DESADV если по части РТУ не нужно отправлять desadv, но нужно получать recadv
		//СообщениеОбъект = Параметры.СообщениеОбъект;
		
		//Если  СообщениеОбъект.ТипСообщения = "DESADV" Тогда
		//	Если СообщениеОбъект.Документ.ДоговорКонтрагента.Код = "УТ0000028" Тогда
		//		СообщениеОбъект.Статус = "Доставлен";
		//		СообщениеОбъект.ТребуемоеДействие = "РаботаЗавершена";
		//		СообщениеОбъект.Архив = 1;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьРезультатВалидацииСообщения" Тогда
		
		//Сообщение = Параметры.Сообщение;
		//
		//РезультатВалидации = Новый Структура;
		//
		//Успешно 	  	= Истина;
		//ТаблицаОшибок 	= Новый ТаблицаЗначений;
		//ТаблицаОшибок.Колонки.Добавить("ОписаниеОшибки");
		
		//пример валидации ORDRSP (проверяется наличие незаказанного товара)
		//Если Сообщение.ТипСообщения = "ORDRSP" Тогда
		//	Заказ1С = Документы.ЗаказПоставщику.НайтиПоНомеру( Сообщение.ЗаказEDI.Номер, ?( ЗначениеЗаполнено(Сообщение.ЗаказEDI.Дата), Сообщение.ЗаказEDI.Дата, ТекущаяДата() ) ); 
		//	Если ЗначениеЗаполнено(Заказ1С) Тогда
		//		ТоварыЗаказа 		= Заказ1С.Товары;
		//		ТоварыПодтверждения = Сообщение.Товары;
		//		Для Каждого Строка Из ТоварыПодтверждения Цикл
		//			Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения", Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры,Строка.ЕдиницаИзмерения);
		//			НайденныеСтроки = ТоварыЗаказа.НайтиСтроки(Отбор);
		//			Если НайденныеСтроки.Количество() = 0 Тогда
		//				Успешно 	= Ложь;
		//				НоваяСтрока = ТаблицаОшибок.Добавить();
		//				НоваяСтрока.ОписаниеОшибки = "Товар: " + Строка.Номенклатура + ?(ЗначениеЗаполнено(Строка.ХарактеристикаНоменклатуры),Строка.ХарактеристикаНоменклатуры+" "," ") + "(" + Строка.ЕдиницаИзмерения + ") (GTIN: " + Строка.GTIN + ", код покупателя: " + Строка.КодТовараПокупателя + ", код поставщика: " + Строка.КодТовараПоставщика + ")" + " отсутствовал в заказе № " + Сообщение.ЗаказEDI.Номер + " от " + Формат(Сообщение.ЗаказEDI.Дата,"ДФ=dd.MM.yyyy");	
		//			КонецЕсли;
		//		КонецЦикла;
		//	Иначе
		//		Успешно 	= Ложь;
		//		НоваяСтрока = ТаблицаОшибок.Добавить();
		//		НоваяСтрока.ОписаниеОшибки = "Не определен документ ""Заказ покупателя"" по переданным реквизитам (заказ № " + Сообщение.ЗаказEDI.Номер + " от " + Формат(Сообщение.ЗаказEDI.Дата,"ДФ=dd.MM.yyyy" + ")");
		//	КонецЕсли;
		//	Если Не Успешно Тогда
		//		Сообщить("Валидация подтверждения заказа №" + СокрЛП(Сообщение.ЗаказEDI.Номер) + " от " + Формат(Сообщение.ЗаказEDI.Дата, "ДФ=dd.MM.yyyy") + " прошла неудачно:");
		//		Для Каждого Строка Из ТаблицаОшибок Цикл
		//			Сообщить(Символы.Таб + Строка.ОписаниеОшибки);
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		
		//пример вализации на DESADV (проверяется, что по валидируемому уведомлению об отгрузке определился документ заказ поставщику)
		//Если Сообщение.ТипСообщения = "DESADV" Тогда
		//	Заказ = Документы.Заказ.НайтиПоНомеру( Сообщение.ЗаказEDI.Номер, ?( ЗначениеЗаполнено(Сообщение.ЗаказEDI.Дата), Сообщение.ЗаказEDI.Дата, ТекущаяДата() ) );
		//	Если Не ЗначениеЗаполнено(Заказ) Тогда
		//		Успешно 	= Ложь;
		//		НоваяСтрока = ТаблицаОшибок.Добавить();
		//		НоваяСтрока.ОписаниеОшибки = "В данном магазине не найден заказ: номер """ + Строка(Сообщение.ЗаказEDI.Номер) + """, дата заказа """ + ?( ЗначениеЗаполнено(Сообщение.ЗаказEDI.Дата), Сообщение.ЗаказEDI.Дата, ТекущаяДата() ) + """." ;
		//	КонецЕсли;
		//	Если Не Успешно Тогда
		//		Сообщить("Валидация уведомления об отгрузке по заказу №" + СокрЛП(Сообщение.ЗаказEDI.Номер) + " от " + Формат(Сообщение.ЗаказEDI.Дата, "ДФ=dd.MM.yyyy") + " прошла неудачно:");
		//		Для Каждого Строка Из ТаблицаОшибок Цикл
		//			Сообщить(Символы.Таб + Строка.ОписаниеОшибки);
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		
		//РезультатВалидации.Вставить("Успешно", 			Успешно);
		//РезультатВалидации.Вставить("ТаблицаОшибок", 	ТаблицаОшибок);
		//
		//Возврат РезультатВалидации;
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "ПолучитьНомерНаПечать" Тогда
		
		//ДокументДляПолученияНомера = Параметры.ДокументСсылка;
		//Возврат ДокументДляПолученияНомера.Номер;//вернем номер именно в таком виде, как он выглядит в журнале документов, не обрезая префиксы / лидирующие нули.
		
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменитьТекстЗапроса" Тогда
		
		////можно изменить тексты некоторых запросов.
		////Например, в новом интерфейсе можно отправлять PORDERS не из документа ЗаказПокупателя, а из РеализацииТоваровУслуг
		//Если Параметры.ИдентификаторЗапроса = "Заказы_ДляОтправкиPORDERS" Тогда
		//	Если Параметры.ЗаменятьСсылкиВнешнегоХранилища Тогда
		//		//...
		//	Иначе
		//		Параметры.ТекстЗапроса = СтрЗаменить(Параметры.ТекстЗапроса,"Документ.ЗаказПокупателя","Документ.РеализацияТоваровУслуг");
		//	КонецЕсли;	
		//КонецЕсли;	
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "ПослеОбработкиРасхожденияРезультатовПриемки" Тогда
		//Можно выполнить какие-то еще действия. Например, обработать возвратную тару, если выбрали действие "Создать корректировку реализации".
		//Документ - это сама Реализация, или Возврат - в тех случаях, когда создается возврат. 
		//ВыбранноеДействие = Параметры.ВыбранноеДействие;
		//ТаблицаРасхождений = Параметры.ТаблицаРасхождений;
		//ДокументСсылка = Параметры.Накладная;
		
		
		//дальше смотрим в исходный документ, и либо создаем новый документ ВозвратТоваровОтПокупателя, либо правим прямо в исходной реализации.
		
		
		//вариант 1: перенесем расхождения по таре в РеализациюТоваровУслуг
		//пройдемся по ТаблицаРасхождений, поищем строки в таб.части ВозвратнаяТара документа, и скорректируем /удалим их при необходимости
		
		//Если ВыбранноеДействие = "КорректировкаРеализации" Тогда
		//
		//	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		//	ЗаписатьДокумент = Ложь;
		//	Для Каждого СтрокаРасхождений Из ТаблицаРасхождений Цикл
		//		
		//		МассивУдаляемыхСтрок = Новый Массив;
		//		СтрокаДокумента = ДокументОбъект.ВозвратнаяТара.Найти(СтрокаРасхождений.Номенклатура);
		//		Если СтрокаДокумента<>Неопределено Тогда
		//			
		//			Если СтрокаРасхождений.КоличествоПринято = 0 Тогда
		//				//в RECADV по данной позиции 0, удалим эту строку вообще
		//				//тут мы предполагаем, что строка только одна! Иначе алгоритм будет на 3 этажа
		//				ЗаписатьДокумент = Истина;
		//				Если МассивУдаляемыхСтрок.Найти(СтрокаДокумента)=Неопределено Тогда
		//					МассивУдаляемыхСтрок.Добавить(СтрокаДокумента);
		//				КонецЕсли;
		//				
		//			Иначе
		//				//проверим расхождение цен/сумм
		//				Если 
		//					СтрокаДокумента.Количество<>СтрокаРасхождений.КоличествоПринято
		//					Или (СтрокаДокумента.Цена<>СтрокаРасхождений.ЦенаСНДСПринято и СтрокаРасхождений.ЦенаСНДСПринято<>0)
		//					Или (СтрокаДокумента.Сумма<>СтрокаРасхождений.СуммаСНДСПринято и СтрокаРасхождений.СуммаСНДСПринято<>0)
		//				Тогда
		//					СтрокаДокумента.Количество=СтрокаРасхождений.КоличествоПринято;
		//					СтрокаДокумента.Цена=СтрокаРасхождений.ЦенаСНДСПринято;
		//					СтрокаДокумента.Сумма=СтрокаРасхождений.СуммаСНДСПринято;
		//					//а если сеть не прислала цены/суммы?
		//					ЗаписатьДокумент = Истина;
		//				КонецЕсли;
		//				
		//			КонецЕсли;
		//		КонецЕсли;	
		//		
		//	КонецЦикла;	
		//	
		//	Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		//		ДокументОбъект.ВозвратнаяТара.Удалить(УдаляемаяСтрока);
		//	КонецЦикла;	
		//	
		//	Если ЗаписатьДокумент Тогда
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	КонецЕсли;	
		//КонецЕсли; //ВыбранноеДействие = "КорректировкаРеализации"	
		//
		////конец варианта 1
		
		
		///////////////////////////////-------------------------------------------------------//////////////////////////////////////////
		
		
		//вариант 2: создадим документ ВозвратТоваровОтПокупателя
		//пройдемся по ТаблицаРасхождений, поищем строки в таб.части ВозвратнаяТара документа, и скорректируем /удалим их при необходимости
		
		//Если ВыбранноеДействие = "КорректировкаРеализации" Тогда
		//	
		//	НовДок = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		//	НовДок.Дата = ТекущаяДата();
		//	НовДок.УстановитьНовыйНомер();
		//	
		//	ЗаписатьДокумент = Ложь;
		//	НовДок.Заполнить(ДокументСсылка);
		//	НовДок.Товары.Очистить();//из товаров ничего не возвращаем
		//	
		//	Для Каждого СтрокаРасхождений Из ТаблицаРасхождений Цикл
		//		
		//		СтрокаДокумента = НовДок.ВозвратнаяТара.Найти(СтрокаРасхождений.Номенклатура);
		//		Если СтрокаДокумента<>Неопределено Тогда
		//			
		//			Если 
		//				СтрокаДокумента.Количество<>СтрокаРасхождений.КоличествоПринято
		//				Или (СтрокаДокумента.Цена<>СтрокаРасхождений.ЦенаСНДСПринято и СтрокаРасхождений.ЦенаСНДСПринято<>0)
		//				Или (СтрокаДокумента.Сумма<>СтрокаРасхождений.СуммаСНДСПринято и СтрокаРасхождений.СуммаСНДСПринято<>0)
		//			Тогда
		//				СтрокаДокумента.Количество = (СтрокаРасхождений.КоличествоВНакладной - СтрокаРасхождений.КоличествоПринято);
		//				СтрокаДокумента.Цена = СтрокаРасхождений.ЦенаСНДСВНакладной;
		//				СтрокаДокумента.Сумма = СтрокаДокумента.Цена*СтрокаДокумента.Количество;
		//				ЗаписатьДокумент = Истина;
		//			ИначеЕсли СтрокаДокумента.Количество=СтрокаРасхождений.КоличествоПринято Тогда
		//				СтрокаДокумента.Количество = 0;//эта строка принята полностью, поставим в возврате 0, потом удалим
		//			КонецЕсли;
		//		КонецЕсли;	
		//		
		//	КонецЦикла;	
		//	
		//	Для Каждого Стр Из НовДок.ВозвратнаяТара Цикл
		//		Если Стр.Количество=0 Тогда//удалим пустые строки
		//			НовДок.ВозвратнаяТара.Удалить(Стр);
		//		КонецЕсли;	
		//	КонецЦикла;	
		//	
		//	Если ЗаписатьДокумент Тогда
		//		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		//		НовДок.Комментарий = "Создан из модуля Контур.EDI при обработке расхождений приемки";
		//		НовДок.ПолучитьФорму().ОткрытьМодально();//и покажем документ пользователю
		//	КонецЕсли;	
		//КонецЕсли; //ВыбранноеДействие = "КорректировкаРеализации"	
		////конец варианта 2
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбработатьРасхожденияРезультатовПриемки" Тогда
		
		//// если необходимо выполнять нестандартную обработку расхождения о приемке, то старую просто пропускаем и отображаем на экране инфу о расхождениях
		//
		//Для Каждого Стр из Параметры.ТаблицаРасхождений Цикл 
		//	Если Стр.КоличествоВНакладной <> Стр.КоличествоПринято Тогда 
		//		Сообщить ("Расхождения в товаре " + Стр.Номенклатура + "; В накладной " + Стр.КоличествоВНакладной + ", в приемке " + Стр.КоличествоПринято);	
		//	КонецЕсли;
		//КонецЦикла;
		//ОсновнойМодуль.УстановитьСтатусДокумента(Параметры.Накладная,"НакладнаяПринятЧастичноОбработан","Приемка");
		//СтандартнаяОбработкаEDI = Ложь;	
		
		//// если необходимо делать пересчет, т.к. в RECADV приходят коробки, а хранится в штуках.
		//// Часть №1. Часть вторая в ИмяСобытия = "ПослеПолученияТоваровДокумента1С"
		//Если Параметры.Накладная.Контрагент = Справочники.Контрагенты.НайтиПоКоду("КодМетроСС") Тогда
		//	Для Каждого Стр из Параметры.ТаблицаРасхождений Цикл 
		//		Стр.КоличествоПринято = Стр.КоличествоПринято * 10; // на самом деле вместо 10 д.б. Стр.Номенклатура.<КоэффПересчета>
		//		//Если Стр.КоличествоВНакладной <> Стр.КоличествоПринято Тогда 
		//		//            Сообщить ("Расхождения в товаре " + Стр.Номенклатура + "; В накладной " + Стр.КоличествоВНакладной + ", в приемке " + Стр.КоличествоПринято);    
		//		//КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "ИзменитьНастройкуТиповОбъектов" Тогда
		
		////установим собственные типы объектов
		//ТаблицаТипов	= Параметры.ТаблицаТипов;
		//
		//Для каждого СтрокаТипов Из ТаблицаТипов Цикл
		//	
		//	Если СтрокаТипов.ИмяОбъекта ="ЮрФизЛицоСвое" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.Фирмы";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="Грузоотправитель" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.Фирмы";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="Договор" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.Договоры";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="РасчетныйСчет" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.РасчетныеСчета";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="ЕдиницаИзмерения" Тогда
		//		
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.ЕдИзм";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="ХарактеристикаНоменклатуры" Тогда
		//		СтрокаТипов.ИмяТипа	= Неопределено;
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="НомерГТД" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.ГТД";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="Страна" Тогда
		//		СтрокаТипов.ИмяТипа	= "СправочникСсылка.Страны";
		//		
		//	ИначеЕсли СтрокаТипов.ИмяОбъекта ="ВходящийВозврат" Тогда
		//		СтрокаТипов.ИмяТипа	= "ДокументСсылка.ВозвратОтПокупателя";
		//		
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеПолученияТоваровДокумента1С" Тогда
		//// если необходимо делать пересчет, т.к. в RECADV приходят коробки, а хранится в штуках.
		//// Часть №2. Часть первая в ИмяСобытия = "ОбработатьРасхожденияРезультатовПриемки"
		//Если (Параметры.Источник = "ЗагрузкаУведомленияОПриемке") ИЛИ (Параметры.Источник = "ОбработкаРасхожденийПриемки") Тогда
		//	Если Параметры.ДокументСсылка.Контрагент = Справочники.Контрагенты.НайтиПоКоду("КодМетроСС") Тогда
		//		Для Каждого Стр Из Параметры.ТаблицаТоваров Цикл
		//			Стр.Количество = Стр.Количество / 10; // на самом деле вместо 10 д.б. Стр.Номенклатура.<КоэффПересчета>
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПриУстановкеСтатусаСообщения" Тогда
		////Параметры: СообщениеСсылка,ДокументСсылка,ТипСообщения,Статус
		//
		////Когда сообщение успешно подписано в Диадок, поставим в исходном документе "Счет-фактура выданный" способ выставления "Электронно"
		////и заполним дату выставления
		//Если Параметры.Статус = "ИсходящийПодписанВДиадок" Тогда
		//	
		//	_Документ = Параметры.ДокументСсылка;
		//	Если ЗначениеЗаполнено(_Документ) 
		//		И _Документ.Метаданные().Реквизиты.Найти("КодСпособаВыставления")<>Неопределено
		//		И _Документ.КодСпособаВыставления <> 2
		//	Тогда
		//		//установим нужные реквизиты в счет-фактуре
		//		
		//		СФОбъект = _Документ.ПолучитьОбъект();
		//		СФОбъект.КодСпособаВыставления = 2; //Электронно
		//		СФОбъект.Выставлен = Истина;
		//		СФОбъект.ДатаВыставления = ОсновнойМодуль.ДатаXML_в_Дата1С(Сообщение.ДатаОтправки);
		//		Если Не ЗначениеЗаполнено(СФОбъект.ДатаВыставления) Тогда
		//			СФОбъект.ДатаВыставления = Сообщение.ДатаДокумента;
		//		КонецЕсли;	
		//		СФОбъект.Записать();
		//		
		//	КонецЕсли;	
		//	
		//КонецЕсли;	
		
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменитьОписаниеПравилУстановкиСтатусаИТребуемогоДействия" Тогда
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляТаблицы" Тогда
		//Используется для построения основного списка документов и для поиска связанных друг с другом документов
		//Параметры: ИмяТаблицы,		ТаблицаСоединенийДокументов,	НазначениеЗапроса
		
		
		////Пример: Плагин для Астора, который сильно не укладывается в текущую логику
		//Если Параметры.НазначениеЗапроса = "ПостроениеСписка" Тогда
		//	Если Параметры.ИмяТаблицы = "Заказ" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	Документы.Ссылка КАК Док_Заказ,
		//		|	Документы.Проведен КАК Док_Проведен,
		//		|	ТаблицаКэшПартнеровКонтрагентов.Партнер КАК Партнер,
		//		|	ТаблицаКэшПартнеровКонтрагентов.PORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.DESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.RECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOIC,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOICДоОбработкиRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееDESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееINVOIC,
		//		|	Документы.ИтогоСумма КАК СуммаДокумента,
		//		|	ВЫРАЗИТЬ(ЗакрытиеЗаказов.ДокументЗакрытия КАК Документ.ПриходнаяНакладная) КАК Док_ПриходнаяНакладная
		//		|ПОМЕСТИТЬ ВТ_Заказ
		//		|ИЗ
		//		|	Документ.Заказ КАК Документы
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКэшПартнеровКонтрагентов КАК ТаблицаКэшПартнеровКонтрагентов
		//		|		ПО (ТаблицаКэшПартнеровКонтрагентов.Контрагент = Документы.Контрагент)
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|		ПО (ЗакрытиеЗаказов.ПоДокументу = Документы.Ссылка)
		//		|ГДЕ
		//		|	Документы.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		//		|	И НЕ Документы.ПометкаУдаления
		//		|	И &Условия
		//		|
		//		|ИНДЕКСИРОВАТЬ ПО
		//		|	Партнер,
		//		|	Док_Заказ,
		//		|	Док_ПриходнаяНакладная";
		//		;
		//	ИначеЕсли Параметры.ИмяТаблицы = "ПриходнаяНакладная" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	ПриходнаяНакладная.Ссылка КАК Док_ПриходнаяНакладная,
		//		|	ПриходнаяНакладная.Проведен КАК Док_Проведен,
		//		|	ТаблицаКэшПартнеровКонтрагентов.Партнер КАК Партнер,
		//		|	ТаблицаКэшПартнеровКонтрагентов.PORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.DESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.RECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOIC,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOICДоОбработкиRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееDESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееINVOIC,
		//		|	ЗакрытиеЗаказов.ДокументЗакрытия КАК Док_Заказ,
		//		|	ПриходнаяНакладная.ИтогоВсего КАК СуммаДокумента,
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка КАК Док_РегистрацияСчетаФактуры
		//		|ПОМЕСТИТЬ ВТ_ПриходнаяНакладная
		//		|ИЗ
		//		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКэшПартнеровКонтрагентов КАК ТаблицаКэшПартнеровКонтрагентов
		//		|		ПО (ТаблицаКэшПартнеровКонтрагентов.Контрагент = ПриходнаяНакладная.Контрагент)
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|		ПО ПриходнаяНакладная.Ссылка = ЗакрытиеЗаказов.ДокументЗакрытия
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСчетаФактуры.СоставНДС КАК РегистрацияСчетаФактурыСоставНДС
		//		|		ПО ПриходнаяНакладная.Ссылка = РегистрацияСчетаФактурыСоставНДС.Основание
		//		|ГДЕ
		//		|	ПриходнаяНакладная.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		//		|	И НЕ ПриходнаяНакладная.ПометкаУдаления
		//		|	И &Условия
		//		|
		//		|ИНДЕКСИРОВАТЬ ПО
		//		|	Партнер,
		//		|	Док_ПриходнаяНакладная,
		//		|	Док_Заказ,
		//		|	Док_РегистрацияСчетаФактуры";
		//		;
		//	ИначеЕсли Параметры.ИмяТаблицы = "РегистрацияСчетаФактурыСоставНДС" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка КАК Док_РегистрацияСчетаФактуры,
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка.Проведен КАК Док_Проведен,
		//		|	ТаблицаКэшПартнеровКонтрагентов.Партнер КАК Партнер,
		//		|	ТаблицаКэшПартнеровКонтрагентов.PORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.ORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.DESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.RECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOIC,
		//		|	ТаблицаКэшПартнеровКонтрагентов.INVOICДоОбработкиRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDERS,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееORDRSP,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееDESADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееRECADV,
		//		|	ТаблицаКэшПартнеровКонтрагентов.СообщениеБлокирующееINVOIC,
		//		|	ЗакрытиеЗаказов.ДокументЗакрытия КАК Док_ПриходнаяНакладная,
		//		|	ЗакрытиеЗаказов.ПоДокументу КАК Док_Заказ,
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка.ИтогоВсего КАК СуммаДокумента
		//		|ПОМЕСТИТЬ ВТ_РегистрацияСчетаФактуры
		//		|ИЗ
		//		|	Документ.РегистрацияСчетаФактуры.СоставНДС КАК РегистрацияСчетаФактурыСоставНДС
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКэшПартнеровКонтрагентов КАК ТаблицаКэшПартнеровКонтрагентов
		//		|		ПО РегистрацияСчетаФактурыСоставНДС.Ссылка.Контрагент = ТаблицаКэшПартнеровКонтрагентов.Контрагент
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		//		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|			ПО ПриходнаяНакладная.Ссылка = ЗакрытиеЗаказов.ДокументЗакрытия
		//		|		ПО РегистрацияСчетаФактурыСоставНДС.Основание = ПриходнаяНакладная.Ссылка
		//		|ГДЕ
		//		|	&Условия
		//		|
		//		|ИНДЕКСИРОВАТЬ ПО
		//		|	Партнер,
		//		|	Док_РегистрацияСчетаФактуры,
		//		|	Док_ПриходнаяНакладная,
		//		|	Док_Заказ";
		//		;
		//	КонецЕсли;	
		//КонецЕсли;	
		//
		//Если Параметры.НазначениеЗапроса = "СвязанныеСообщения" Тогда
		//	Если Параметры.ИмяТаблицы = "Заказ" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка КАК Док_РегистрацияСчетаФактуры,
		//		|	Заказ.Ссылка КАК Док_Заказ,
		//		|	ЗакрытиеЗаказов.ДокументЗакрытия КАК Док_ПриходнаяНакладная
		//		|ИЗ
		//		|	Документ.РегистрацияСчетаФактуры.СоставНДС КАК РегистрацияСчетаФактурыСоставНДС
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
		//		|			ПО ЗакрытиеЗаказов.ПоДокументу = Заказ.Ссылка
		//		|		ПО РегистрацияСчетаФактурыСоставНДС.Основание = ЗакрытиеЗаказов.ДокументЗакрытия
		//		|ГДЕ
		//		|	Заказ.Ссылка В(&Ссылка)";
		//	ИначеЕсли Параметры.ИмяТаблицы = "ПриходнаяНакладная" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка КАК Док_РегистрацияСчетаФактуры,
		//		|	ПриходнаяНакладная.Ссылка КАК Док_ПриходнаяНакладная,
		//		|	ЗакрытиеЗаказов.ПоДокументу КАК Док_Заказ
		//		|ИЗ
		//		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|		ПО ПриходнаяНакладная.Ссылка = ЗакрытиеЗаказов.ДокументЗакрытия
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСчетаФактуры.СоставНДС КАК РегистрацияСчетаФактурыСоставНДС
		//		|		ПО (РегистрацияСчетаФактурыСоставНДС.Основание = ПриходнаяНакладная.Ссылка)
		//		|ГДЕ
		//		|	ПриходнаяНакладная.Ссылка В(&Ссылка)";
		//	ИначеЕсли Параметры.ИмяТаблицы = "РегистрацияСчетаФактурыСоставНДС" Тогда
		//		ПолныйТекстЗапроса = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка КАК Док_РегистрацияСчетаФактуры,
		//		|	ПриходнаяНакладная.Ссылка КАК Док_ПриходнаяНакладная,
		//		|	ЗакрытиеЗаказов.ПоДокументу КАК Док_Заказ
		//		|ИЗ
		//		|	РегистрСведений.ЗакрытиеЗаказов КАК ЗакрытиеЗаказов
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		//		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСчетаФактуры.СоставНДС КАК РегистрацияСчетаФактурыСоставНДС
		//		|			ПО (РегистрацияСчетаФактурыСоставНДС.Основание = ПриходнаяНакладная.Ссылка)
		//		|		ПО (ПриходнаяНакладная.Ссылка = ЗакрытиеЗаказов.ДокументЗакрытия)
		//		|ГДЕ
		//		|	РегистрацияСчетаФактурыСоставНДС.Ссылка В(&Ссылка)";
		//	КонецЕсли;	
		//КонецЕсли;	
		//СтандартнаяОбработкаEDI = Ложь;
		//Возврат ПолныйТекстЗапроса;
		
	КонецЕсли;	
	
	
	//----------------------------------------------------------------------------------------------------------------	
	//-обработчики для учета особенностей текущей конфигурации
	
	
	Если ИмяСобытия = "ПослеКонвертацииСообщения1СвEDI" Тогда
		
		//// если товар весовой и INVOIC отбивается по валидации GTIN, то для Х5 заменим все GTIN на фейковый одинаковый
		//// на текущий момент валидации на GTIN отключены на ядре
		//Сообщение = Параметры.Сообщение;
		//Если Сообщение.ТипСообщения = "INVOIC" Тогда
		//	Если Сообщение.ПолучательEDI.GLN = "4606038000003" Тогда 
		//		Для Каждого Строка Из Сообщение.Товары Цикл
		//			Строка.GTIN = "02000000000008";
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		//Возврат Сообщение;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеКонвертацииСообщенияEDIв1С" Тогда
		
		// если в RECADV не пришел номер DESADV, то надо поискать по номеру заказа и привязаться к нужной реализации
		// данный кусок для бухгалтериии, где по ORDERS создаются реализации
		//
		//Сообщение = Параметры.Сообщение;
		//Если Сообщение.ТипСообщения= "RECADV" Тогда 
		//	Если не ЗначениеЗаполнено(Сообщение.Накладная1С) Тогда 
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = "ВЫБРАТЬ
		//					   |	КонтурEDI_Сообщения.Документ КАК Ссылка
		//					   |ИЗ
		//					   |	Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
		//					   |ГДЕ
		//					   |	КонтурEDI_Сообщения.НомерДокумента ПОДОБНО &НомерЗаказа
		//					   |	И КонтурEDI_Сообщения.ТипСообщения = ""ORDERS""";
		//		Запрос.УстановитьПараметр("НомерЗаказа", "_"+Сред(СокрЛП(Сообщение.ЗаказEDI.Номер),2));   
		//		Результат = Запрос.Выполнить();
		//		Выборка = Результат.Выбрать();
		//		Если Выборка.Следующий() Тогда 
		//			Попытка 
		//				Накладная=Выборка.Ссылка;
		//				Если Накладная<>Неопределено Тогда 
		//					Сообщение.Документ1С=Накладная;
		//					Сообщение.Накладная1С=Накладная;
		//					Сообщение.Приемка1С=Накладная;
		//				КонецЕсли;
		//			Исключение
		//				Сообщить("ПМ: Не удалось сопоставить");
		//			КонецПопытки;
		//		КонецЕсли;
		//		Возврат Сообщение;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбработатьОтменуЗаказа" Тогда
		
		// пришла отмена заказа от сети - сообщаем об этом окошком и отправляем уведомление на почту
		//СтандартнаяОбработкаEDI = Истина;
		//Сообщение = Параметры.Сообщение;
		////модальное предупреждение
		//Сообщить("Внимание! Заказ №"+Сообщение.ДокументEDI.Номер+" ("+Сообщение.НомерСерииЗаказов +") был отменен!",СтатусСообщения.ОченьВажное);
		////отправим почту
		//ОтправитьEmail(АдресЭлектроннойПочты,"Внимание! Заказ №"+Сообщение.ДокументEDI.Номер+" ("+Сообщение.НомерСерииЗаказов +") был отменен!","Внимание! Заказ №"+Сообщение.ДокументEDI.Номер+" ("+Сообщение.НомерСерииЗаказов +") был отменен!"+Символы.ПС+"Сообщение отправлено роботом сервиса Контур-EDI, пожалуйста не отвечайте на него.",);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеПодготовкиИсходящегоСообщения" Тогда
		////Porders ТС Низкоцен поле Контракт (Ранее КонтрактEDI) теперь доступно для всех сообщений
		//  Сообщение = Параметры.Сообщение;
		//Если Сообщение.ТипСообщения= "PORDERS" И Сообщение.ПолучательEDI.GLN = "2000000005768"  Тогда 
		//	Документ = Сообщение.Документ1С.ПолучитьОбъект();
		// 	Сообщение.Контракт.Номер = Документ.ДоговорКонтрагента.Номер;  //Убедиться что договор лежит именно по адресу:  Документ.ДоговорКонтрагента
		//  Сообщение.Контракт.Дата = Документ.ДоговорКонтрагента.Дата;
		//КонецЕсли;
		
		//// Если необходимо изменить ИНН/КПП организации в плательщике, в которую отправляется INVOIC.
		//// Используется для поставщиков МетроСС
		//Если (Параметры.Сообщение.ТипСообщения= "INVOIC") И ((Параметры.Сообщение.ПолучательEDI.GLN = "4607070199991") ИЛИ (Параметры.Сообщение.ПолучательEDI.GLN = "4007731000008") ИЛИ (Параметры.Сообщение.ПолучательEDI.GLN = "4607070198888"))  Тогда 
		//	Параметры.Сообщение.ПокупательEDI.GLN = Параметры.Сообщение.ПлательщикEDI.GLN;
		//	// Установим название юр лица Метро
		//	Параметры.Сообщение.ПлательщикEDI.Наименование = "ООО Метро Кэш энд Керри";
		//	// Установим ИНН Метро Можно, в принципе, забить ИНН всегда постоянным 7704218694, а можно взять из справочников в 1С
		//	Параметры.Сообщение.ПлательщикEDI.ИНН = Параметры.Сообщение.ДокументСсылка.Контрагент.ИНН;
		//	// Установим правильный КПП. Здесь должен встать КПП магазина. Где он лежит в структуре справочников поставщика - надо выяснить.
		//	// У Хладокомбината №3 каждый магазин встает в Контрагенты в документе, поэтому у них всё просто.
		//	Параметры.Сообщение.ПлательщикEDI.КПП = Параметры.Сообщение.ДокументСсылка.Контрагент.КПП;
		//	Параметры.Сообщение.ПлательщикEDI.Вид = "ЮрЛицо";
		//КонецЕсли;
		
		
		//// Если необходимо выпилить internalSupplierCode из всех исходящих сообщений для Х5, т.к. он в RECADV шлет GTIN в этом поле и мерж падает
		//// в текущей версии коробки есть соответствующая галочка для запрета отправки КодаПоставщика
		//Если Параметры.Сообщение.ПолучательEDI.GLN = "4606038000003" Тогда 
		//	Для Каждого Стр Из Параметры.Сообщение.Товары Цикл
		//		Стр.КодТовараПоставщика = "";
		//	КонецЦикла;
		//КонецЕсли;
		
		
		////ТС Линия просит в DESADV передавать порядковый номер строки исходного сообщения (в теге "Комментарий")
		//Если Параметры.Сообщение.ТипСообщения= "DESADV"
		//	И Параметры.Сообщение.ПолучательEDI.GLN = "4607811439997" //Линия
		//Тогда 
		//
		//	//Параметры.Сообщение.Товары.Сортировать("Наименование");
		//	Накладная = Параметры.Сообщение.Документ1С;
		//	Для Каждого Стр Из Параметры.Сообщение.Товары Цикл
		//		СтрокаНакладной = Накладная.Товары.Найти(Стр.Номенклатура);
		//		Если СтрокаНакладной<>Неопределено Тогда
		//			Стр.Комментарий = Формат(СтрокаНакладной.НомерСтроки,"ЧГ=");
		//		КонецЕсли;	
		//	КонецЦикла;
		//КонецЕсли;
		
		//отправка количества в одном месте (тег onePlaceQuantity)
		//Сообщение 	 = Параметры.Сообщение;
		//ТипСообщения = Сообщение.ТипСообщения;
		//Если ТипСообщения = "ORDRSP" или ТипСообщения = "DESADV" Тогда
		//	Для Каждого Строка Из Сообщение.Товары Цикл
		//		Строка.КоличествоВОдномМесте = 1;
		//	КонецЦикла;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаполнитьТоварнуюГруппуТаблицыТоваров" Тогда
		
		//Используется в том случае, если из одного сообщения ORDERS требуется создать несколько документов.
		//Можно, например, разбить по группам товаров, или по складам, на которых есть остатки.
		//В этом случае для каждого РАЗЛИЧНОГО значения колонки "ТоварнаяГруппа" будет создан отдельный документ в 1С.
		
		//Товары = Параметры.Товары; //Внимание! на УФ в Товарах приезжает ДанныеФормыКоллекция!
		//Сообщение = Параметры.Сообщение;
		//
		//Если Товары.Колонки.Найти("ТоварнаяГруппа")=Неопределено Тогда
		//	Товары.Колонки.Добавить("ТоварнаяГруппа");
		//КонецЕсли;	
		//
		//Запрос = Новый Запрос(
		//"ВЫБРАТЬ
		//|	спрНоменклатура.Ссылка КАК Номенклатура,
		//|	спрНоменклатура.ВидНоменклатуры КАК ТоварнаяГруппа
		//|ИЗ
		//|	Справочник.Номенклатура КАК спрНоменклатура
		//|ГДЕ
		//|	спрНоменклатура.Ссылка В(&Товары)"
		//);
		//Запрос.УстановитьПараметр("Товары",Товары.ВыгрузитьКолонку("Номенклатура"));
		//ТабЗапроса = Запрос.Выполнить().Выгрузить();
		//Для Каждого СтрокаТоваров Из Товары Цикл
		//	СтрокаЗапроса = ТабЗапроса.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		//	Если СтрокаЗапроса = Неопределено Тогда
		//		СтрокаТоваров.ТоварнаяГруппа = Неопределено;
		//	Иначе
		//		СтрокаТоваров.ТоварнаяГруппа = СтрокаЗапроса.ТоварнаяГруппа;
		//	КонецЕсли;	
		//КонецЦикла;
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "КнопкаФормыСообщенияНажатие" Тогда
		
		//// если хочется обработать событие по кнопке из формы сообщения, например, если сделали свою кнопку
		//// также см документацию по созданию ПМ
		//// Часть №1. Вторая часть в ПриОткрытииФормыСообщения
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПриОткрытииФормыСообщения" Тогда
		
		////// если хочется добавить кнопку на форму сообщения и, например, распечатать сообщение.
		////// работает на всех вариациях формы сообщения
		////// Часть №2. Первая часть в КнопкаФормыСообщенияНажатие
		////Если Параметры.Сообщение.Направление = "Входящее" и Параметры.Сообщение.ТипСообщения = "ORDERS" Тогда
		////	ТЗКнопкиКоманднойПанели = Параметры.ФормаСообщения.НастройкаФормы.КнопкиКоманднойПанели;
		////	НоваяСтрока                    = ТЗКнопкиКоманднойПанели.Вставить(1);
		////	НоваяСтрока.ВидКнопки          = "Кнопка";
		////	НоваяСтрока.Имя                         = "РаспечататьЗаказНовый";
		////	НоваяСтрока.ИмяКартинки     = "КартинкаСохранить";
		////	НоваяСтрока.ИсточникКартинки          = "ЭлементФормы";
		////	НоваяСтрока.КнопкаПоУмолчанию    = Ложь;
		////	НоваяСтрока.Представление                 = "Распечатать заказ";
		////	НоваяСтрока.ПроверятьПоля                = Ложь;
		////	НоваяСтрока.СохранятьСоответствия               = Ложь;                                              
		////	
		////	ДействиеКнопки = Новый Действие("КнопкаДействияФормыНажатие");
		////	КнопкиСписка = Параметры.ФормаСообщения.ЭлементыФормы.ОсновныеДействияФормы.Кнопки;
		////	НоваяКнопка = КнопкиСписка.Добавить("РаспечататьЗаказНовый",                ТипКнопкиКоманднойПанели.Действие,       "Тест", ДействиеКнопки);
		////	КоличествоКнопок = КнопкиСписка.Количество();
		////	КнопкиСписка.Сдвинуть(КнопкиСписка[КоличествоКнопок-1],-КоличествоКнопок+1);
		////КонецЕсли;
		
		////Заполним произвольный реквизит формы сообщения 
		//Если ЗначениеЗаполнено(Параметры.Сообщение.ПродавецEDI.КодВСистемеПокупателя) Тогда
		//	ФормаСообщения=Параметры.ФормаСообщения;
		//	ФормаСообщения.ЭлементыФормы.НадписьПроизвольныйРеквизит.Заголовок="Код продавца";
		//	ФормаСообщения.ЭлементыФормы.НадписьПроизвольныйРеквизит.Видимость=истина;
		//	ФормаСообщения.ПроизвольныйРеквизит=Параметры.Сообщение.ПродавецEDI.КодВСистемеПокупателя;
		//	ФормаСообщения.ЭлементыФормы.ПроизвольныйРеквизит.Видимость=истина;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "ПриОткрытииФормыОбработкиРасхождений" Тогда
		//Параметры: СообщениеСсылка, ФормаОбработкиРасхождений
		
		// Когда нужно запретить пользователю некоторые варианты обработки расхождений
		//Форма = Параметры.ФормаОбработкиРасхождений;
		//
		//// Для УФ
		//СкрытыеКнопки = Новый Массив;
		//СкрытыеКнопки.Добавить("ФормаСоздатьВозвратОтПокупателя");
		//СкрытыеКнопки.Добавить("ФормаСоздатьКорректировку");
		//СкрытыеКнопки.Добавить("ФормаПеренестиВДокументРеализация");
		//
		//Для каждого ИмяКнопки Из СкрытыеКнопки Цикл
		//	ЭлементФормы = Форма.Элементы.Найти(ИмяКнопки);
		//	Если ЭлементФормы <> Неопределено Тогда
		//		ЭлементФормы.Видимость = Ложь;
		//	КонецЕсли;
		//КонецЦикла;
		//
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеСравненияТаблицыТоваров" Тогда
		//Пример 1.
		//Сравним таблицы только по количеству.
		
		//СравниваемыеПоля = Параметры.СравниваемыеПоля;
		//РезультатСравнения = Параметры.РезультатСравнения;
		//Если СравниваемыеПоля.НайтиПоЗначению("Количество")<>Неопределено Тогда
		//	СтандартнаяОбработкаEDI = Ложь;
		//	РезультатСравнения.ЕстьРасхождения	= Ложь;
		//	Для Каждого СтрокаТаблицыСравнения Из РезультатСравнения.ТаблицаСравнения Цикл
		//		СтрокаТаблицыСравнения.ЕстьРасхождения = (СтрокаТаблицыСравнения.Количество1 <> СтрокаТаблицыСравнения.Количество2);
		//		РезультатСравнения.ЕстьРасхождения = РезультатСравнения.ЕстьРасхождения	Или СтрокаТаблицыСравнения.ЕстьРасхождения;
		//	КонецЦикла;
		//	
		//	Возврат РезультатСравнения;
		//КонецЕсли;	
		
		//Пример 2.
		//Если входящий RECADV не отличается от документа в 1С по количеству в каждой строке товаров, а общая сумма документа отличается от приемки не более чем на 1 рубль,
		//то не будем считать такой RECADV отличающимся от документа.
		
		//Если Параметры.СтруктураТаблицы1.ТипСообщения = "RECADV"
		//	И Параметры.СтруктураТаблицы2.ТипСообщения = "DESADV" Тогда
		//	
		//	РезультатСравнения = Параметры.РезультатСравнения;
		//	СтандартнаяОбработкаEDI = Ложь;
		//	
		//	РезультатСравнения.ЕстьРасхождения = Ложь;
		//	Для Каждого СтрокаТаблицыСравнения Из РезультатСравнения.ТаблицаСравнения Цикл
		//		СтрокаТаблицыСравнения.ЕстьРасхождения = (СтрокаТаблицыСравнения.Количество1 <> СтрокаТаблицыСравнения.Количество2);
		//		РезультатСравнения.ЕстьРасхождения = РезультатСравнения.ЕстьРасхождения	Или СтрокаТаблицыСравнения.ЕстьРасхождения;
		//	КонецЦикла;
		//	
		//	РазницаСумм = Параметры.СтруктураТаблицы1.Товары.Итог("СуммаСНДС") - Параметры.СтруктураТаблицы2.Товары.Итог("СуммаСНДС");
		//	Если РазницаСумм<-1 или РазницаСумм>1 Тогда
		//		РезультатСравнения.ЕстьРасхождения = Истина;
		//	КонецЕсли;
		//	Возврат РезультатСравнения;
		//	
		//КонецЕсли;	
		
		
		
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЧтенияСообщенияИзФайла" Тогда	
		
		//Сообщение = Параметры.Сообщение;
		//Если Сообщение.ТипСообщения = "ORDERS" 
		//	И Сообщение.ОтправительEDI.GLN="4607081909992"//Дикси
		//	И Сообщение.Свойство("ОбратныйЗаказEDI")
		//Тогда
		//
		//	Сообщение.ОбратныйЗаказEDI.Дата = Сообщение.ЗаказEDI.Дата;//Дикси ленится слать дату PORDERS, сделаем за них
		//			
		//	Если Сообщение.ОбратныйЗаказEDI.Свойство("Номер")
		//		И Сообщение.ОбратныйЗаказEDI.Номер="CS_"
		//	Тогда
		//		//А в поле "Номер", наоборот, всегда что-то пишет. Или реальный номер, или "CS_". Во втором случае имеется в виду, что на самом деле PORDERS не было.
		//		Сообщение.Удалить("ОбратныйЗаказEDI");
		//		Сообщение.Удалить("ОбратныйЗаказ1С");
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	
	Если ИмяСобытия = "ПередВыполнениемОбмена" Тогда
		
		// Если необходимо автоматом отправить DESADV, то надо выполнить следующее
		// А из двух запросов надо выбрать только один!!
		//
		//Если ЗначениеЗаполнено(ОсновнойМодуль.ПараметрыПользователяEDI.ЭтоАвтообмен) И ОсновнойМодуль.ПараметрыПользователяEDI.ЭтоАвтообмен Тогда
		//	Если Параметры.ИмяСписка = "РеализацияТоваров" Тогда
		//
		//      // Начало запроса 1 (на выбор)
		//		// Это общий запрос, который работает всегда. 
		//		// Суть запроса в том, что он отбирает все реализации за последние 3 дня по тем контрагентам, которые настроены у нас в админке
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = "ВЫБРАТЬ
		//			|              РеализацияТоваровУслуг.Ссылка КАК Объект,
		//			|              РеализацияТоваровУслуг.Представление
		//			|ИЗ
		//			|              Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//			|                              ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
		//			|                              ПО (КонтурEDI_Сообщения.ТипСообщения = ""DESADV"")
		//			|                                             И РеализацияТоваровУслуг.Ссылка = КонтурEDI_Сообщения.Документ
		//			|ГДЕ
		//			|              КонтурEDI_Сообщения.Документ ЕСТЬ NULL 
		//			|              И РеализацияТоваровУслуг.Контрагент В
		//			|                                             (ВЫБРАТЬ РАЗЛИЧНЫЕ
		//			|                                                             КонтурEDI_ДополнительныеРеквизиты.Объект
		//			|                                             ИЗ
		//			|                                                             РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
		//			|                                             ГДЕ
		//			|                                                             КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_Контрагента"")
		//			|              И РеализацияТоваровУслуг.Дата >= &ДатаМинус3Дня";
		//		Запрос.УстановитьПараметр("ДатаМинус3Дня",ТекущаяДата()-3*24*60*60);
		//		// Конец запроса 1
		//		
		//		// Начало запроса 2 (на выбор)
		//		// Если запрос надо построить по определенному свойству документа (в котором устанавливается дата отгрузки) и автоматом отправить DESADV
		//		// Это старая версия, нужно использовать аккуратно, осторожно
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = "ВЫБРАТЬ
		//			|	ЗначенияСвойствОбъектов.Объект,
		//			|	ПРЕДСТАВЛЕНИЕ(ЗначенияСвойствОбъектов.Объект)
		//			|ИЗ
		//			|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурEDI_Сообщения КАК КонтурEDI_Сообщения
		//			|		ПО (КонтурEDI_Сообщения.Документ = ЗначенияСвойствОбъектов.Объект)
		//			|		И КонтурEDI_Сообщения.ТипСообщения = ""DESADV""
		//			|ГДЕ
		//			|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		//			|	И НЕ (ЗначенияСвойствОбъектов.Значение = &ПустаяДата)
		//			|	И КонтурEDI_Сообщения.Документ ЕСТЬ NULL";
		//		Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("<название свойства документа>"));
		//		Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
		//      // Конец запроса 2
		//
		//
		//		ТЗ = Запрос.Выполнить().Выгрузить();
		//		Для каждого Стр из ТЗ Цикл
		//			Если ОсновнойМодуль.МожноОтправлятьУведомлениеОбОтгрузке(Стр.Объект,Ложь) Тогда
		//				ТекущийСтатус = ОсновнойМодуль.ПолучитьСтатусСообщения(, Стр.Объект, "DESADV");
		//				Если НЕ (ЗначениеЗаполнено(ТекущийСтатус) И НЕ СокрЛП(ТекущийСтатус)="Ожидает исправления ошибок") Тогда
		//					Сообщение = ОсновнойМодуль.ПодготовитьИсходящееСообщение("DESADV", Стр.Объект);  
		//					Если НЕ (Сообщение.СодержитОшибки = Истина) Тогда
		//						Параметры = Новый Структура();
		//						Параметры.Вставить("ОтправитьСообщениеИзФормы",	Истина);
		//						Параметры.Вставить("Сообщение",					Сообщение);
		//						ОсновнойМодуль.ОтправитьСообщение("DESADV",Стр.Объект,Параметры);
		//					КонецЕсли;
		//				КонецЕсли;
		//			КонецЕсли;
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполнитьАвтообмен" Тогда
		
		//Используется в том случае, если необходимо настроить автоматический обмен сообщениями в режиме служебного
		//пользователя, отличный от стандартного.
		//В приведенном примере модуль сначала загрузит статусные и обычные сообщения по всем активным учетным записям,
		//затем отправит все ожидающие отправки сообщения, уведомления о прочтении и ALCRPT; об успешных или неудачных 
		//операциях информация будет занесена в журнал регистрации.
		//Здесь можно реализовать загрузку или отправку только в определенные промежутки времени; в сочетании с событием
		//"ПолучитьСообщенияОжидающиеОтправкиПоТипу" можно отбирать сообщения для автоматической отправки по типам.
		//
		//СтандартнаяОбработкаEDI = Ложь;
		////загрузка сообщений
		//УчетныеЗаписи = ОсновнойМодуль.ПолучитьСписокЭлементовСправочника("УчетныеЗаписи");
		//Для Каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		//	Если УчетнаяЗапись.НеАктивна Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	Попытка
		//		ОсновнойМодуль.ЗагрузитьНовыеСообщения(УчетнаяЗапись,Истина);
		//		ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Информация, , , "Успешно загружены статусные сообщения", );
		//	Исключение
		//		ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось загрузить статусные сообщения: " + ОписаниеОшибки(), );
		//	КонецПопытки;
		//	Попытка
		//		ОсновнойМодуль.ЗагрузитьНовыеСообщения(УчетнаяЗапись,Ложь);
		//		ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Информация, , , "Успешно загружены сообщения", );
		//	Исключение
		//		ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось загрузить сообщения: " + ОписаниеОшибки(), );
		//	КонецПопытки;
		//КонецЦикла;
		////отправка сообщений
		//Попытка
		//	ОсновнойМодуль.ОтправитьСообщенияОжидающиеОтправки();
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Информация, , , "Успешно отправлены сообщения, ожидающие отправки", );
		//Исключение
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить сообщения, ожидающие отправки: " + ОписаниеОшибки(), );
		//КонецПопытки;
		//Попытка
		//	ОсновнойМодуль.ОтправитьУведомленияОПрочтенииСообщений();
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Информация, , , "Успешно отправлены уведомления о прочтении сообщений", );
		//Исключение
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить уведомления о прочтении сообщений: " + ОписаниеОшибки(), );
		//КонецПопытки;
		//Попытка
		//	ОсновнойМодуль.ОтправитьALCRPT();
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Информация, , , "Успешно отправлены сообщения ALCRPT", );
		//Исключение
		//	ЗаписьЖурналаРегистрации("Контур.EDI: Автообмен", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить сообщения ALCRPT: " + ОписаниеОшибки(), );
		//КонецПопытки;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьСообщенияОжидающиеОтправкиПоТипу" Тогда
		
		//Используется в том случае, если необходимо изменить стандартную функцию получения
		//ожидающих отправки сообщений. 
		//В данном примере в режиме служебного пользователя для автообмена производится отбор 
		//сообщений на отправку по типам (по всем возможным). 
		//
		//ЭтоАвтообмен 		= ОсновнойМодуль.ПараметрыПользователяEDI.ЭтоАвтообмен = Истина;
		//Если ЭтоАвтообмен Тогда
		//	СтандартнаяОбработкаEDI = Ложь;
		//	ТаблицаДокументов = Новый ТаблицаЗначений;
		//	ТаблицаДокументов.Колонки.Добавить("ТипСообщения");
		//	ТаблицаДокументов.Колонки.Добавить("Документ");
		//	ТаблицаДокументов.Колонки.Добавить("Параметры");
		//	ОтправляемыеТипыСообщений = Новый Массив;
		//	ОтправляемыеТипыСообщений.Добавить("PORDERS");                 
		//	ОтправляемыеТипыСообщений.Добавить("ORDRSP");
		//	ОтправляемыеТипыСообщений.Добавить("DESADV");
		//	ОтправляемыеТипыСообщений.Добавить("INVOIC");
		//	ОтправляемыеТипыСообщений.Добавить("ORDERS_Canceled");
		//	Для Каждого ТипСообщения Из ОтправляемыеТипыСообщений Цикл
		//		ЗначениеСвойства = ?(ТипСообщения = "ORDERS_Canceled", "Отменен, ожидает отправки", "Ожидает отправки");
		//		ОсновнойМодуль.ПолучитьСообщенияОжидающиеОтправкиПоТипу(ТаблицаДокументов, ТипСообщения, ЗначениеСвойства);
		//	КонецЦикла;
		//	Возврат ТаблицаДокументов;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПроверитьНеобходимостьЗагрузкиСохраненияСообщения" Тогда
		
		//При получении входящих сообщений с сервера можно отказаться от загрузки некоторых из них.
		//Например, при работе в РБД входящие RECADV должны грузиться только в периферийные базы, а в центральную не должны.
		
		//Если Параметры.Сообщение.ТипСообщения="RECADV" и ЭтоЦентральнаяБаза() Тогда
		//	Параметры.СтруктураВозврата.СохранятьСообщениеВБазу = Ложь;
		//	Параметры.СтруктураВозврата.МожноУдалятьСообщение = Истина;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПередВыборомТочкиДоставкиСвойСправочник" Тогда
		
		//Вызывается в ФормаТочкиДоставкиСторонние_Элемент при выборе поля "ТочкаДоставкиСвойСправочник".
		//Используется в случае, если данное поле слишком уж нестандартное.
		
		//ЮрФилЗицо = Параметры.ЮрФизлицо;
		//ТекущееЗначение = Параметры.ТекущееЗначение;
		//ФРМ = Справочники.ХитрыеТочкиДоставки.ПолучитьФормуСписка();
		////... установим параметры формы
		//ВыбранноеЗначение = ФРМ.ОткрытьМодально();
		//Возврат ВыбранноеЗначение;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЗаполнения_EdiMessage_XDTO" Тогда
		
		////Вызывается при записи исходящего сообщения в XML через XDTO, после заполнения всего сообщения.
		////Позволяет изменить теги записываемого файла, добавить новые, удалить существующие.
		////Параметры: EdiMessage,Сообщение
		//
		//EdiMessage = Параметры.EdiMessage;//вытащим поближе для удобства
		//
		//EdiMessage.Interchangeheader.sender = "123333";//поменяем значение существующего тега
		//
		////добавим новый тег в сообщение
		//Если EdiMessage.Тип().Свойства.Получить("NewTag")=Неопределено Тогда
		//	//Но для начала проверим, что его еще нет в схеме
		//	_Фабрика = ОсновнойМодуль.ФабрикаXDTO_EdiXml();
		//	_ТипСтрока = _Фабрика.Тип("http://www.w3.org/2001/XMLSchema","string");//Строка в терминах XML
		//	_Знач = _Фабрика.Создать(_ТипСтрока);
		//	EdiMessage.Добавить(ФормаXML.Элемент,EdiMessage.Тип().URIПространстваИмен,"NewTag",_Знач);//При использовании "ФормаXML.Атрибут" возникают артефакты в тексте полученного XML
		//КонецЕсли;
		//EdiMessage.NewTag = "123";//и теперь запишем значение нашего нового тега
		
		
		////Пример работы с termsOfPayment в ORDERS
		//Если Параметры.Сообщение.ТипСообщения = "ORDERS"
		//	И Параметры.Сообщение.Направление = "Исходящее" Тогда
		//	
		//	order        = Параметры.EdiMessage.order;
		//	Сообщение    = Параметры.Сообщение;
		//	
		//	КлючЗначениеСтроки = ОсновнойМодуль.xmlСоздатьДочернийЭлементXDTO(order,"termsOfPayment");
		//	КлючЗначениеСтроки.paymentTermsCode = "";
		//	
		//	//Если Сообщение.Документ1С.Соглашение.Наименование = "Факторинг" тогда
		//	//    КлючЗначениеСтроки.paymentTermsCode = "PKXX"; 
		//	//КонецЕсли;
		//	//Если Сообщение.Документ1С.Соглашение.Наименование = "Хранение" тогда
		//	//    КлючЗначениеСтроки.paymentTermsCode = "PF0D"; 
		//	//КонецЕсли;
		
		//	
		//КонецЕсли; 
		
		
		
		
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЗаполнения_LineItem_XDTO" Тогда
		
		//Вызывается при записи исходящего сообщения в XML через XDTO, после заполнения каждого lineItem.
		//Позволяет изменить теги записываемого файла, добавить новые, удалить существующие.
		//Параметры: lineItem,СтрокаТоваров,Сообщение
		
		//Сообщить(""+Параметры.lineItem.GTIN);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеПроверкиСообщенияEDI" Тогда
		
		//Вызывается после проверки сообщения на предмет заполненности обязательных полей, соответствия классификаторам и т.д.
		//Позволяет дополнить/переопределить результат проверки
		//Параметры: Сообщение,ТаблицаОшибок
		
		////Пример: для исходящих DESADV вызовем дополнительную проверку на готовность к отгрузке
		//Если Параметры.Сообщение.ТипСообщения = "DESADV"
		//	И Параметры.Сообщение.Направление = "Исходящее" Тогда
		//	
		//	Если Не ОбщийМодуль.НакладнаяГотоваКОтгрузке(Параметры.Сообщение.Документ1С) Тогда
		//		
		//		НовОшибка = Параметры.ТаблицаОшибок.Добавить();
		//		//НовОшибка.ИмяПоля				= "Накладная1С";//имя элемента управления на форме. Не обязательно.
		//		//НовОшибка.ИмяТабличнойЧасти		= "";
		//		//НовОшибка.НомерСтроки			= "";
		//		НовОшибка.СведенияОбОшибках		= "Накладная не готова к отгрузке";// или текст строкой, или таблица с ошибками подчиненных полей
		//		НовОшибка.СодержитОписаниеПоля	= Ложь;
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеЧтенияСообщения_XDTO" Тогда
		
		//// Здесь можно добавить в Сообщение любые теги из XML, о которых основной модуль еще не знает.
		//// Рекомендуется имена создаваемых элементов Структуры начинать с "_".
		//// Это позволит избежать пересечения с именами элементов в Структуре при обновлениях модуля.
		
		//ВНИМАНИЕ! Весь пример ниже уже реализован в коробке! поле сообщения КонтрактEDI переименовано в Контракт
		//Если Параметры.Сообщение.ТипСообщения="ORDERS" Тогда
		//	
		//	Параметры.Сообщение.Вставить("_КонтрактEDI",Новый Структура("Номер,Дата"));
		//	КонтрактХМЛ = ОсновнойМодуль.ПолучитьЗначениеСвойстваXDTO(Параметры.Данные.order,"contractIdentificator");
		//	
		//	Если НЕ КонтрактХМЛ=Неопределено Тогда
		//		Параметры.Сообщение.КонтрактEDI.Вставить("Дата",	ОсновнойМодуль.ДатаXML_в_ДатаВремя1С(Параметры.Данные.order.contractIdentificator.date));
		//		Параметры.Сообщение.КонтрактEDI.Вставить("Номер",	Параметры.Данные.order.contractIdentificator.number);
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПриОткрытииОсновнойФормы" Тогда
		//включить в основной форме отображение итогов по колонке "Сумма"
		
		//Форма = Параметры.Форма;
		//Форма.ЭлементыФормы.ТабСообщения.Подвал = Истина;
		//Форма.ЭлементыФормы.ТабСообщения.Колонки.Сумма.ОтображатьИтогиВПодвале = Истина;
		//Возврат Неопределено;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПолучитьТоварыДляНезависимогоСообщения" Тогда
		//  ТоварыРезультат = Новый ТаблицаЗначений
		// необходимо написать свой алгоритм заполнения товаров табличной части
		// необходимо вернуть таблицу значений ТоварыРезульта
		// Возврат ТоварыРезультат;
		//Если Параметры.ТипСообщения = "SLSRPT" Тогда
		
		// В итоговой таблице ожидаем поля:
		//
		// МестоПродаж
		// Менеджер
		// КаналСбыта
		// GTIN - Штрихкод
		// КодТовараПокупателя - код свой
		// КодТовараПоставщика - код партнера
		// Наименование
		// Номенклатура
		// ЕдиницаИзмерения
		// СтавкаНДС
		// СтавкаНДСПродажи
		// Количество
		// КоличествоПродано
		// КоличествоВозвращено
		// Цена
		// Сумма
		// СуммаНДС
		// СуммаВключаетНДС
		// ЦенаПроизводителя
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	спрНоменклатура.Ссылка КАК Номенклатура,
		//|	спрНоменклатура.Код КАК КодТовараПокупателя,
		//|	спрНоменклатура.Артикул КАК КодТовараПоставщика,
		//|	спрНоменклатура.Наименование КАК Наименование,
		//|	спрНоменклатура.СтавкаНДС КАК СтавкаНДС,
		//|	спрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		//|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПроизводителя,
		//|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК GTIN
		//|ПОМЕСТИТЬ ВТ_Номенклатура
		//|ИЗ
		//|	Справочник.Номенклатура КАК спрНоменклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&КонецПериода, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		//|		ПО спрНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
		//|			И (ЦеныНоменклатурыСрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка))
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
		//|		ПО спрНоменклатура.Ссылка = ШтрихкодыНоменклатуры.Владелец
		//|			И (ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка))
		//|			И (ШтрихкодыНоменклатуры.Характеристика = ЗНАЧЕНИЕ(СПравочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		//|ГДЕ
		//|	НЕ спрНоменклатура.ПометкаУдаления
		//|	И НЕ спрНоменклатура.ЭтоГруппа
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВыручкаИСебестоимостьПродаж.Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Количество > 0
		//|			ТОГДА ВыручкаИСебестоимостьПродаж.Количество
		//|		ИНАЧЕ -ВыручкаИСебестоимостьПродаж.Количество
		//|	КОНЕЦ КАК Количество,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Количество > 0
		//|			ТОГДА ВыручкаИСебестоимостьПродаж.Количество
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК КоличествоПродано,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Количество < 0
		//|			ТОГДА -ВыручкаИСебестоимостьПродаж.Количество
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК КоличествоВозвращено,
		//|	ВыручкаИСебестоимостьПродаж.Стоимость / ВыручкаИСебестоимостьПродаж.Количество КАК Цена,
		//|	ВыручкаИСебестоимостьПродаж.Номенклатура.СтавкаНДС КАК СтавкаНДСПродажи,
		//|	ИСТИНА КАК СуммаВключаетНДС,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Стоимость > 0
		//|			ТОГДА ВыручкаИСебестоимостьПродаж.Стоимость
		//|		ИНАЧЕ -ВыручкаИСебестоимостьПродаж.Стоимость
		//|	КОНЕЦ КАК Сумма,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Стоимость > 0
		//|			ТОГДА ВыручкаИСебестоимостьПродаж.Стоимость
		//|		ИНАЧЕ -ВыручкаИСебестоимостьПродаж.Стоимость
		//|	КОНЕЦ КАК СуммаНДС,
		//|	ВЫБОР
		//|		КОГДА ВыручкаИСебестоимостьПродаж.Количество > 0
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ЭтоВозврат,
		//|	ВыручкаИСебестоимостьПродаж.ДокументПродажи.Контрагент КАК МестоПродаж,
		//|	"""" КАК КаналСбыта,
		//|	ВыручкаИСебестоимостьПродаж.Продавец КАК Менеджер,
		//|	ВыручкаИСебестоимостьПродаж.Регистратор.Номер КАК НомерНакладной,
		//|	ВыручкаИСебестоимостьПродаж.Период КАК ДатаНакладной
		//|ПОМЕСТИТЬ ВТ_Продажи
		//|ИЗ
		//|	РегистрНакопления.Продажи КАК ВыручкаИСебестоимостьПродаж
		//|ГДЕ
		//|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
		//|	И НЕ ВыручкаИСебестоимостьПродаж.Количество = 0
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Номенклатура.Номенклатура,
		//|	ВТ_Номенклатура.ЕдиницаИзмерения,
		//|	ВТ_Номенклатура.КодТовараПокупателя,
		//|	ВТ_Номенклатура.КодТовараПоставщика,
		//|	ВТ_Номенклатура.Наименование,
		//|	ВТ_Номенклатура.СтавкаНДС,
		//|	ВТ_Номенклатура.ЦенаПроизводителя,
		//|	ВТ_Продажи.СтавкаНДСПродажи,
		//|	ВТ_Продажи.СуммаВключаетНДС,
		//|	СУММА(ВТ_Продажи.КоличествоПродано) КАК КоличествоПродано,
		//|	СУММА(ВТ_Продажи.КоличествоВозвращено) КАК КоличествоВозвращено,
		//|	ВТ_Продажи.Цена,
		//|	СУММА(ВТ_Продажи.Сумма) КАК Сумма,
		//|	СУММА(ВТ_Продажи.СуммаНДС) КАК СуммаНДС,
		//|	ВТ_Продажи.ЭтоВозврат,
		//|	ВТ_Продажи.МестоПродаж,
		//|	ВТ_Продажи.КаналСбыта,
		//|	СУММА(ВТ_Продажи.Количество) КАК Количество,
		//|	ВТ_Продажи.Менеджер,
		//|	ВТ_Номенклатура.GTIN,
		//|	ВТ_Продажи.НомерНакладной,
		//|	ВТ_Продажи.ДатаНакладной
		//|ИЗ
		//|	ВТ_Номенклатура КАК ВТ_Номенклатура
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Продажи КАК ВТ_Продажи
		//|		ПО ВТ_Номенклатура.Номенклатура = ВТ_Продажи.Номенклатура
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_Номенклатура.Номенклатура,
		//|	ВТ_Номенклатура.КодТовараПокупателя,
		//|	ВТ_Номенклатура.КодТовараПоставщика,
		//|	ВТ_Номенклатура.Наименование,
		//|	ВТ_Номенклатура.СтавкаНДС,
		//|	ВТ_Номенклатура.ЕдиницаИзмерения,
		//|	ВТ_Номенклатура.ЦенаПроизводителя,
		//|	ВТ_Продажи.СтавкаНДСПродажи,
		//|	ВТ_Продажи.СуммаВключаетНДС,
		//|	ВТ_Продажи.ЭтоВозврат,
		//|	ВТ_Продажи.МестоПродаж,
		//|	ВТ_Продажи.КаналСбыта,
		//|	ВТ_Продажи.Цена,
		//|	ВТ_Продажи.Менеджер,
		//|	ВТ_Номенклатура.GTIN,
		//|	ВТ_Продажи.НомерНакладной,
		//|	ВТ_Продажи.ДатаНакладной";
		//
		//
		//
		////Запрос.УстановитьПараметр("Организация", 		Параметры.Параметры.Покупатель);
		//Запрос.УстановитьПараметр("ТипЦен", 			Параметры.Параметры.ТипЦен);
		//Запрос.УстановитьПараметр("НачалоПериода", 		Параметры.Параметры.ДатаНачалаПериода);
		//Запрос.УстановитьПараметр("КонецПериода", 		КонецДня(Параметры.Параметры.ДатаОкончанияПериода));
		//
		//ТЗ = Запрос.Выполнить().Выгрузить();
		//СтандартнаяОбработкаEDI = Ложь;
		//
		//Возврат ТЗ;
		//КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

// СЛУЖЕБНЫЕ {

Процедура ОткрытьКонструктор(ИмяСобытия, Параметры, СтандартнаяОбработкаEDI, ОсновнойМодуль)
	
	Если ДанныеОтладки.ПодключаемыйМодульСообщатьОСобытиях = Истина Тогда
		Сообщить(ИмяСобытия);
	КонецЕсли;
	
	Если Не ДанныеОтладки.ПодключаемыйМодульИспользоватьОтладку = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОтладки.ПодключаемыйМодульСобытиеОтладки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеОтладки.ПодключаемыйМодульСобытиеОтладки = ИмяСобытия Тогда
		Возврат;
	КонецЕсли;
	
	ФормаКонструктор = ПолучитьФорму("Конструктор");
	ТаблицаПараметры = Новый ТаблицаЗначений;
	ТаблицаПараметры.Колонки.Добавить("Имя");
	ТаблицаПараметры.Колонки.Добавить("Значение");
	Для Каждого Элемент Из Параметры Цикл
		НоваяСтрока = ТаблицаПараметры.Добавить();
		НоваяСтрока.Имя 	 = Элемент.Ключ;
		НоваяСтрока.Значение = Элемент.Значение;		
	КонецЦикла;
	ФормаКонструктор.ТаблицаПараметры 		 = ТаблицаПараметры;
	ФормаКонструктор.СтандартнаяОбработкаEDI = СтандартнаяОбработкаEDI;
	ФормаКонструктор.ИмяСобытия 			 = ИмяСобытия;
	ПутьОсновногоМодуля = "";
	Если Не Найти( Строка(ТипЗнч(ОсновнойМодуль)), "Внешняя обработка объект") = 0 Тогда
		ПутьОсновногоМодуля = ОсновнойМодуль.ИспользуемоеИмяФайла;
	КонецЕсли;
	ФормаКонструктор.ПутьОсновногоМодуля = ПутьОсновногоМодуля;
	ФормаКонструктор.ОткрытьМодально();	
	
КонецПроцедуры

// Интерфейс для регистрации обработки.
// Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение:
// Структура:
// Вид - строка - возможные значения:	"ДополнительнаяОбработка"
//										"ДополнительныйОтчет"
//										"ЗаполнениеОбъекта"
//										"Отчет"
//										"ПечатнаяФорма"
//										"СозданиеСвязанныхОбъектов"
//
// Назначение - массив строк имен объектов метаданных в формате:
//			<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]
//			Например, "Документ.СчетЗаказ" или "Справочник.*"
//			Прим. параметр имеет смысл только для назначаемых обработок
//
// Наименование - строка - наименование обработки, которым будет заполнено
//						наименование справочника по умолчанию - краткая строка для
//						идентификации обработки администратором
//
// Версия - строка - версия обработки в формате <старший номер>.<младший номер>
//					используется при загрузке обработок в информационную базу
// БезопасныйРежим – Булево – Если истина, обработка будет запущена в безопасном режиме.
//							Более подбробная информация в справке.
//
// Информация - Строка- краткая информация по обработке, описание обработки
//
// ВерсияБСП - Строка - Минимальная версия БСП, на которую рассчитывает код
// дополнительной обработки. Номер версии БСП задается в формате «РР.ПП.ВВ.СС»
// (РР – старший номер редакции; ПП – младший номер ре-дакции; ВВ – номер версии; СС – номер сборки).
//
// Команды - ТаблицаЗначений - команды, поставляемые обработкой, одная строка таблицы соотвествует
//							одной команде
//				колонки: 
//				 - Представление - строка - представление команды конечному пользователю
//				 - Идентификатор - строка - идентефикатор команды. В случае печатных форм
//											перечисление через запятую списка макетов
//				 - Использование - строка - варианты запуска обработки:
//						"ОткрытиеФормы" - открыть форму обработки
//						"ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//						"ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
//				 - ПоказыватьОповещение – Булево – если Истина, требуется оказывать оповещение при начале
//								и при окончании запуска обработки. Прим. Имеет смысл только
//								при запуске обработки без открытия формы.
//				 - Модификатор – строка - для печатных форм MXL, которые требуется
//										отображать в форме ПечатьДокументов подсистемы Печать
//										требуется установить как "ПечатьMXL"
//
// Предусмотрено 2 команды:
// 1. "Открыть форму обработки" для загрузки прайс-листа в диалоговом режиме
// 2. "Загрузить прайс-лист и сохранить протокол в файл" для загрузки прайс-листа по регламентному заданию и
// сохранения протокола в файл.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", 		"Контур.EDI подключаемый модуль");
	РегистрационныеДанные.Вставить("БезопасныйРежим", 	Ложь);
	РегистрационныеДанные.Вставить("Версия", 			ПолучитьВерсиюПодключаемогоМодуля_КонтурEDI());
	РегистрационныеДанные.Вставить("Вид", 				"ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", 		"Обработка подключаемого модуля для Контур.EDI");
	
	ТЗКоманд = Новый ТаблицаЗначений;
	ТЗКоманд.Колонки.Добавить("Идентификатор");
	ТЗКоманд.Колонки.Добавить("Представление");
	ТЗКоманд.Колонки.Добавить("Модификатор");
	ТЗКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманд.Колонки.Добавить("Использование");
	
	РегистрационныеДанные.Вставить("Команды", ТЗКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьВерсиюПодключаемогоМодуля_КонтурEDI() Экспорт
	
	Возврат "1.01.02";
	
КонецФункции

// } СЛУЖЕБНЫЕ
