
&После("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое метода.
	УстановитьПредставлениеНомера();
	
	ПроверкаУникальностиНомер();
КонецПроцедуры


Функция ПроверкаУникальностиНомер()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	док.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК док
	               |ГДЕ
	               |	док.Ссылка <> &Ссылка
	               |	И док.Дата <= &ДатаК
	               |	И док.Дата >= &ДатаН
	               |	И док.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Номер",ЭтотОбъект.Номер);
	Запрос.УстановитьПараметр("ДатаН",НачалоГода(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаК",КонецГода(ЭтотОбъект.Дата));
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Номер не уникален "+ЭтотОбъект.Номер;
	КонецЕсли;
КонецФункции