///Локальные входящие вебхуки
Функция ПолучитьСекретнуюСсылку()
	Возврат "/rest/175/111j1gle9m8oignr/"
КонецФункции

Функция ПолучитьХост()
	Возврат "alsav.bitrix24.ru";
КонецФункции
Функция ОтправитьPOSTЗапрос(метод, тело)ЭКСПОРТ
	
	ИмяХоста = ПолучитьХост();
	
	HTTPЗапрос = Новый HTTPЗапрос(ПолучитьСекретнуюСсылку()+метод);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	HTTPЗапрос.УстановитьТелоИзСтроки(тело);
	
	РезультатЗапроса = ВыполнитьЗапрос(HTTPЗапрос, ИмяХоста);
	
	Если Не РезультатЗапроса.ЗапросВыполнен Тогда
		ВызватьИсключение (НСтр("ru = 'Не удалось выполнить перевод текста.'"));
	КонецЕсли;

    Возврат РезультатЗапроса.ОтветСервера;
КонецФункции    



Функция ВыполнитьЗапрос(Знач HTTPЗапрос, Знач ИмяХоста)
	
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	
	//Попытка
		Соединение = Новый HTTPСоединение(ИмяХоста, , , , Прокси, 60, ЗащищенноеСоединение);
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	//Исключение
	//	ЗаписатьОшибкуВЖурналРегистрации(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru = 'Не удалось установить соединение с сервером %1 по причине:
	//		|%2'"), ИмяХоста, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	//	ВызватьИсключение;
	//КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросВыполнен", Ложь);
	Результат.Вставить("ОтветСервера", "");
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"),
			HTTPЗапрос.АдресРесурса,
			HTTPОтвет.КодСостояния) + Символы.ПС + HTTPОтвет.ПолучитьТелоКакСтроку();
		//ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	Если HTTPОтвет.КодСостояния = 401 
		Или HTTPОтвет.КодСостояния = 403 Тогда
		ВызватьИсключение HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Результат.ЗапросВыполнен = HTTPОтвет.КодСостояния = 200;
	Результат.ОтветСервера = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Возврат Результат;
	
КонецФункции